// Xpilot Copyright 2025 [Fyisvia Virell] — https://mj.fyisvia.com
// Licensed under AGPL-3.0 with Additional Terms (see LICENSE).

export const breakdownProblems = [
  {
    "id": 0,
    "cards": "12234447m335679s",
    "answer": "2m",
    "tips": "这副牌我们应该打掉2万。此牌是典型的四搭牌，缺搭子，我们需要靠张能力强的单牌重新去组搭子，然后再用到我们经常说到的口诀，有将打边肚，无将打大肚，所以这牌咱直接打掉2万。"
  },
  {
    "id": 1,
    "cards": "3334889m1223367s",
    "answer": "4m",
    "tips": "这手牌保留4万是没有价值的，因为四万的能力是摸进二万或者五万，但是这手牌摸进二万，也得把二万打掉，因为它搭子的价值，不如二三条和六七条，摸进五万也得把它打掉，所以说这手牌保留四万在手上，没有任何的能力，所以打掉四万，有机会勾出三万开杠，并且保留九万的话，摸进七万打八万，可以改良成一个加强代碰的4人抬轿。"
  },
  {
    "id": 2,
    "cards": "23m244567p112334s",
    "answer": "2p",
    "tips": "这手牌是复合型牌搭，112334条，成牌可以固定成123条，也可以固定成234条，当123条时，进张就是25条，当234条时，进张就是12条。因此像这手牌，在优先留住两对子的情况下，拆搭就不能拆条子，正确打法应该是打2筒。"
  },
  {
    "id": 3,
    "cards": "3477889m2223889p",
    "answer": "3p",
    "tips": "这手牌能打的只有39筒，并且效果都是一样的，可以进2569万听牌，既然效果是一样的，那么就要去考虑后续的改良空间，如果打掉9筒的话，摸进134筒对整手牌都没有任何的改良，都需要拆搭，所以这手牌正确打法应该是打掉3筒，摸进78筒，可以把手牌改成四人抬轿牌型。"
  },
  {
    "id": 4,
    "cards": "224578m123p34889s",
    "answer": "5m",
    "tips": "根据麻将口诀，六搭拆搭，无论打8条还是9条之后，手上还是6搭牌，所以需要把牌型尽快打成5搭牌型。正确打法是应该打掉5万，因为5万是-个眼牌，224可以进3万，78万可以进6万，所以这张5万是没有多大作用的，应该直接打掉。"
  },
  {
    "id": 5,
    "cards": "1344789m1367p246s",
    "answer": "1m",
    "tips": "这副牌是典型的六搭拆搭牌型，因此可以打掉1万，剩下一张3万可以上靠4万，并重新组成一副五搭牌牌型。"
  },
  {
    "id": 6,
    "cards": "56667889p134456s",
    "answer": "8p",
    "tips": "这手牌应该打掉8筒，可以摸进25条听457筒，摸进147条听牌，摸进457筒听牌，有8门32张减去手上的6张，一共有26张的听牌机会，比打掉1条多了7张，提升了40%左右的听牌速度。"
  },
  {
    "id": 7,
    "cards": "2337m1115667p234s",
    "answer": "2m",
    "tips": "这是手一对三单的牌型，首先六简是绝对不能打的，因为6筒这边567简属于一个大肚子牌型，它的靠张能力非常强,摸进四五筒，或者七八简都能把它变成一个好搭子，所以这手牌论单张的进张能力，二万肯定不如七万，因为根据麻将口诀金三银七，所以这手牌的正确打法应该是打掉二万，保留六筒和七万，去做一个靠张一上听，摸进45678筒以及碰出三万，摸进56789万，都可以听胡，所以应该打二万。"
  },
  {
    "id": 8,
    "cards": "78m23666p1234567s",
    "answer": "1s",
    "tips": "这手牌应该打掉147条其中一张，打出去后就成了无将一上听四人抬轿牌型，四人抬轿就是保留3副成牌，外加两个两面搭，这时候两个搭子的周边，摸进6789万，1234筒都可以听牌，总共8门32张，减去手牌的4张，还有28张的一进听牌机会。"
  },
  {
    "id": 9,
    "cards": "78899m3399p13678s",
    "answer": "8m",
    "tips": "这手牌优先考虑拆掉89万，留下13条，因为89万进3张，13条进4张，而且89万周边的关联牌，已经占用了3张，相对而言，别人手里就少了一些需要进89万的搭子或者对子，所以应该选打掉八万。"
  },
  {
    "id": 10,
    "cards": "2334789p1114778s",
    "answer": "8s",
    "tips": "这副手牌打8条最佳。这是典型的四搭牌，缺搭子，所以我们需要靠张能力强的单牌重新去组搭子，然后再用到我们经常说到的口诀，有将打边肚，无将打大肚，8条相对于4条和3筒的靠搭能力最弱，所以这手牌需要打掉8条。"
  },
  {
    "id": 11,
    "cards": "2334m234888p3568s",
    "answer": "3m",
    "tips": "根据麻将口诀，无将打大肚，有将打边肚。这手牌没有将牌，所以优先打掉2334这种大肚牌型。打掉三万进张最多，可进345678条。其他牌进张可以点击下方分析按钮查看进张数量。"
  },
  {
    "id": 12,
    "cards": "3334889m1223367s",
    "answer": "4m",
    "tips": "这副牌最优是打掉4万。因为打9万，留下4万，来了25万，3万就要成对子了，但这副牌不缺对子，所以来了25万也是废牌，并且我们打掉9万会丢失7万的进张，打4万，摸进78万，67条，34万就形成4人抬轿。或者进1458条也可以下叫去听牌，所以这副牌应该打掉4万。"
  },
  {
    "id": 13,
    "cards": "11567m334p455666s",
    "answer": "3p",
    "tips": "三对拆对牌型，应该打三筒，只是会失去碰三筒的机会，但是换来的是进一万，二五筒，三四五六七条就可以听牌的牌型。一共是最高效率的八门牌进张效率。"
  },
  {
    "id": 14,
    "cards": "344567m11344789s",
    "answer": "4m",
    "tips": "根据麻将口诀，这手牌属于三对拆一对牌型，如果打掉4条，那么碰出1条或者碰出4万的情况下，只能打掉3万听在25条上面，但是如果打掉4万的话，无论是碰出14条，还是进张25条，都可听在258万上面，胡牌的几率会更大，所以正确打法应该是打掉4万。"
  },
  {
    "id": 15,
    "cards": "1134899m3578999s",
    "answer": "8s",
    "tips": "根据五搭拆搭原理，拆搭的原则就是拆掉丢张少或者说不丢张的牌，首先这里打掉8万肯定是不明智的，因为打掉8万，手里还是6搭牌，打掉3条之后，我们会丢4条的进张，打掉4万，虽然说手牌可以被打成5搭，但是丢了5万的进张，所以正确打法应该是打掉8条，保留8条的作用是进69条，打掉后，也不会丢失69条的进张。"
  },
  {
    "id": 16,
    "cards": "55m234678p445588s",
    "answer": "5s",
    "tips": "这手牌应该保留8条对子，因为靠边的对子比较容易碰牌,同时要尽量保留45条的搭子作为后续的听牌牌型，所以应该拆掉45条的对子，正确打法应该打掉5条，因为5条比4条有更大的概率，消耗对方更多的中心牌，可以从最中心的序数牌部位，破坏别人手牌的关联能力，从而降低别人创造多连顺，多门进牌的机会。"
  },
  {
    "id": 17,
    "cards": "1234789m388p2678s",
    "answer": "2s",
    "tips": "从单牌而言，关联性强弱依次是4万=3筒>2条>1万，因此很多人会打1万，但此牌建议打二条，虽然打二条会比打1万稍微危险些，但留住四连顺中的1万，关联能力却强很多，所以从攻防综合效益来说，进牌效益远超防守效益，所以答案是打二条。"
  },
  {
    "id": 18,
    "cards": "25m44455567p1238s",
    "answer": "2m",
    "tips": "这手牌是一个一对三单的牌型，要注意重复进张，如果打8条的话，保留25万来做靠张一上听，&nbsp;3万和4万是重复进张，所以这样的话效率会降低很多，所以像这种一对3单&nbsp;靠张一上听的牌，就不要保留同一门花色的，特别是有重复进张的，所以应该打掉2万，因为5万的进张能力是比2万要更强的。"
  },
  {
    "id": 19,
    "cards": "23456p113445667s",
    "answer": "6s",
    "tips": "这手牌应该打掉6条，因为如果打掉4条的话，1234条属于一条线上的牌，147是一条线上的牌，如果你打四条，对方手.上有1234的四连，他肯定也会跟着你打四条，所以这手牌，为了方便利于碰出的情况下，应该直接打掉6条。"
  },
  {
    "id": 20,
    "cards": "23355789m114567p",
    "answer": "3m",
    "tips": "正确打法应该是打掉3万，可以进145万，13568筒-共8门，并且下叫听牌的质量也是比较高的，但是如果打47筒的话，后期很有可能会听在一筒和5万的对倒胡上。"
  },
  {
    "id": 21,
    "cards": "123999m3578p7999s",
    "answer": "7s",
    "tips": "打掉7条可进3456789筒，一共7门进张，进张数量最多。可以点击下方分析进行查看其他牌进张数量！"
  },
  {
    "id": 22,
    "cards": "223888m4677p4667s",
    "answer": "4s",
    "tips": "这手牌应该优先打掉重复进张面的牌，需要在4筒和4条之间做一个选择，需要注意的是后续如果碰了7筒，那46筒依然可以组成一个搭子，但是如果碰了6条，剩下的47条就会变成散牌，所以正确打法应该打掉4条。"
  },
  {
    "id": 23,
    "cards": "224578m45899p111s",
    "answer": "5m",
    "tips": "这手牌最佳打掉5万。如果打掉8筒，这牌依然是六搭牌，并且会丢掉7筒的进张，而打掉5万不会丢张，进来3万可以组成234万，进来6万可以组成678万，并且打掉5万剩下的4万可以和2万重新组搭，这手牌就改良成五搭牌了,所以应该打掉5万。"
  },
  {
    "id": 24,
    "cards": "11122234566788s",
    "answer": "8s",
    "tips": "打6条胡258条，共3门6张胡牌机会，打8条胡1234679条共7门17张胡牌机会，所以这手牌正确打法是打掉8条，比打掉3条多11张的胡牌机会"
  },
  {
    "id": 25,
    "cards": "22356789m334788p",
    "answer": "3m",
    "tips": "根据麻将口诀，三对拆-对是在有两副成牌的情况下，才去做三对拆一对，没有两幅成牌3对也可以不拆对，应该打掉一个搭子，这手牌如果打7筒的话，会丢失69筒的进张，打掉4筒会丢失25筒的进张，打掉三万只会丢失一个一万的进张，所以应该打三万。"
  },
  {
    "id": 26,
    "cards": "888m1115688p4467s",
    "answer": "7s",
    "tips": "根据麻将口诀，二对拆搭，选择拆56饼或是67条的搭子。因为打7条，来3条打6条可以形成好的两对半，而打5饼来9饼无法和一对8饼开成好搭子。这手牌主要是考虑后续牌优化问题"
  },
  {
    "id": 27,
    "cards": "3444566m1112278p",
    "answer": "6m",
    "tips": "这副手牌打掉6万，可以形成两对半牌型，碰到那-对都可以听两面张，3456形成4连&nbsp;，进25万打4万胡69筒，摸7打3万，4万等杠。因此这副牌最优打法则是打掉6万。"
  },
  {
    "id": 28,
    "cards": "236789m23345667s",
    "answer": "9m",
    "tips": "这手牌的正确打法应该是打掉69万其中一张，因为打掉69万后，可以进14万，134568条总共8门32张，减去手牌6张，还有26张进牌机会。"
  },
  {
    "id": 29,
    "cards": "11123m5688p11577s",
    "answer": "5p",
    "tips": "这手牌是典型的6搭牌，需要拆掉一搭，所以正确打法应该是打掉5筒，因为后续如果摸上7筒，也不会浪费，并且整手牌变成了5搭牌。"
  },
  {
    "id": 30,
    "cards": "3456789m56p23555s",
    "answer": "9m",
    "tips": "这手牌应该打成无将一上听，也就是打掉三六九万其中的一张，条子可以进1234条，筒子可以进4567筒，总共8门32张，减去手上4张，还有28张进牌机会，像这种手上没有将，打掉手里的孤章，保留双搭做四人抬轿是最大几率打法。"
  },
  {
    "id": 31,
    "cards": "11234778m244456s",
    "answer": "7m",
    "tips": "这副牌的最优打法是打掉7万。首先，打2条有1679万，47条的进张一共是6门24张减去手上7张，17张胡牌的机会,也会丢失3条的进张;其次，4条如果来1万或者679万会把牌听在卡3条上面，会局限手牌;打7万，可以摸进169万347条，是6门24张，减5张，19张的进张，比2条多两张，同时7万中张不容易碰出，更有可能听胡到69万，所以这副牌应该打掉7万。"
  },
  {
    "id": 32,
    "cards": "22245667p345999s",
    "answer": "6p",
    "tips": "这手牌应该打掉6筒听牌，一共听347筒3门，比打掉其他牌要听的多。"
  },
  {
    "id": 33,
    "cards": "222468m334888p34s",
    "answer": "4p",
    "tips": "根据麻将口诀，一对先定将，因此正确打法应该是打掉4筒，专心优化条子和万字的搭子。"
  },
  {
    "id": 34,
    "cards": "57889m246p123999s",
    "answer": "8m",
    "tips": "这手牌应该选择打掉8万，因为打8万后整手牌会变成无将一上听，摸进5万可以听牌，保留三连砍摸进2356筒也可以听牌。"
  },
  {
    "id": 35,
    "cards": "234556m23677899s",
    "answer": "7s",
    "tips": "根据麻将口诀，两对拆搭，正确打法应该直接打掉7条，把手牌打成一个两对半的牌型，打掉7条后，进张可以是14条，碰9条，进147万，碰5万，比打掉五万多了两门牌的进张效果。"
  },
  {
    "id": 36,
    "cards": "346799p11267999s",
    "answer": "6p",
    "tips": "根据麻将口诀，这是手是六搭拆搭牌型，可能很多人会选择打掉二条，打掉二条会丢失三条的进张，并且整手牌依旧保留了一个6搭牌型，接下来不管是进张也好碰出也好，还是需要去继续拆掉一搭，因为6搭牌永远有两张废牌，所以说这手牌，应该直接打掉6筒，因为打掉6筒，67筒是一个搭子，67筒的能力是进58筒，打掉6筒，既不会丢失8筒的进张，也不会丢失5筒的进张，所以应该打掉6筒。"
  },
  {
    "id": 37,
    "cards": "11567m334p455666s",
    "answer": "3p",
    "tips": "大部分人可能会选择打掉4条，但是如果打4条的话，进张是235筒，5条和1万，总共5门20张，减去手牌6张，还有14张进牌机会。如果打掉5条的话，进张数也差不多。所以这里正确的打法是打掉3筒，保留条子的三连坎牌型，进张是1万，25筒，34567条，总共是8门32张，减去手牌8张，还有24张进牌。"
  },
  {
    "id": 38,
    "cards": "233444678p33488s",
    "answer": "3s",
    "tips": "这里正确的打法是打掉3条，保留筒子的三连坎牌型，进张是258条，12345筒，总共是8门32张，减去手牌8张，还有24张进牌。"
  },
  {
    "id": 39,
    "cards": "34555m78999p3378s",
    "answer": "3s",
    "tips": "这手牌可以看成是6搭牌的三对拆一对。打出3条只损失3条碰出机会。打5万会损失25万，打9饼会损失69饼。所以这手牌的正确打法是打掉三条。我们打出3条，进25万69条69饼均可以听牌。进张数量为4门24张-6=18张的进张机会"
  },
  {
    "id": 40,
    "cards": "44567899m345677p",
    "answer": "9m",
    "tips": "根据三对拆一对原理，需要拆掉一对，所以要打掉4万，9万或7筒。打9万万字可进234567，比打4万多一门进张。具体进张数可以点击下方辅助分析查看。"
  },
  {
    "id": 41,
    "cards": "23347789m4567p45s",
    "answer": "7m",
    "tips": "如果想组成四搭牌，缺将牌，所以我们需要将牌，把靠对能力强的留下来，无将拆大肚，根据靠对能力来看，4连牌型大于单张牌型大于大肚子牌型，我们可以看出来3万和7万都可以打，但七万是最佳选择，因为234万靠上15万能组成四连牌型，所以这手牌应该打掉7万。"
  },
  {
    "id": 42,
    "cards": "2223468m2467999p",
    "answer": "2p",
    "tips": "这副牌打掉2筒，进467筒2468万，可以成对，进58筒257万，可成牌一共是41张进张打掉8万，进346万2467筒可成对，进358筒25万，可成牌，也是41张进张，因此这副牌就需要根据有缘张来打，来3筒打8万，来7万打2筒，选项中只有2筒，依次选择打掉2筒。"
  },
  {
    "id": 43,
    "cards": "111m23378p344568s",
    "answer": "2p",
    "tips": "根据麻将口诀，一对先定将，正确打法应该先打掉2筒，可以进69筒和257条听牌。"
  },
  {
    "id": 44,
    "cards": "78m34666p1234567s",
    "answer": "1s",
    "tips": "这副牌可以选择打掉147条里的任意一张，可以做一个超级的四人抬轿，进来2345筒，6789万都能实现听牌，选项中只有1条，因此选择打掉1条。"
  },
  {
    "id": 45,
    "cards": "4568m123778p2456s",
    "answer": "8p",
    "tips": "这手牌是一将三单的经典牌型，根据麻将口诀，一对先定将原则，应该优先打掉8筒，并且打掉8筒的进张损失是最小的，因为万字上，如果摸到3万，可以和45万形成一副成牌，条子上，如果摸到7条，可以和56条形成一副成牌，所以打8筒是损失最小的。"
  },
  {
    "id": 46,
    "cards": "78999m12378p2244s",
    "answer": "4s",
    "tips": "根据三对拆一对原理，这副牌有两幅成牌三个对子，因此9万不能打，打掉剩下的一张将成为废牌，我们打掉24条，剩下一张都可以靠牌，但又因为2条比4条更容易碰出，所以我们选择打掉4条。"
  },
  {
    "id": 47,
    "cards": "3467889p3334567s",
    "answer": "8p",
    "tips": "这手牌正确打法应该是打掉8筒，只是丢失了78筒两门的进牌，但是可以进24578条，2569筒，属于最大几率打法。"
  },
  {
    "id": 48,
    "cards": "123789p11124566s",
    "answer": "6s",
    "tips": "这副牌打掉2条，可以胡36条，有6张进张打掉6条，可以胡23条，有7张进张，但是打6条可以降低3条防备更快胡牌，所以这副牌的最优打法是打掉6条。"
  },
  {
    "id": 49,
    "cards": "234678m22357888s",
    "answer": "3s",
    "tips": "这手牌打掉一张后直接听牌，考虑到后续改良可能性，正确打法应该打掉3条，如果后续再进2条，就可以改良成7888条，听3门的牌型。"
  },
  {
    "id": 50,
    "cards": "4445666m2345678p",
    "answer": "8p",
    "tips": "如果打掉5万，选听257筒的话，总共是3门12张，减去3张重复，一共有9张牌的一个胡牌机会，正确打法应该是打掉258筒其中一张，可以听34567万五门牌，五门20张减去手上的7张，一共有13张的进张机会，比打5万听258简要多。"
  },
  {
    "id": 51,
    "cards": "123789m579p33577s",
    "answer": "5p",
    "tips": "这手牌的正确打法，应该把它打成一个两对半的牌型，直接打掉五筒或者九筒，可以保留条子这边的跳对3连坎，可碰3条，可进4条，可碰7条，可进夹6筒或者夹8筒，-共是5门20张，减去手上4张，还有16张进张机会，所以应该打5筒。"
  },
  {
    "id": 52,
    "cards": "13556m123334778p",
    "answer": "3p",
    "tips": "这手牌还没有那么快听牌，考虑打掉哪张不容易损失更多的进张机会，如果打1万，损失两万一门的机会，如果打1筒，损失2筒和5筒两门的机会，如果打3筒，只会损失3筒1门一张的进张机会，况且绝张的中心牌更不容易进张，所以这手牌应该打掉3筒。"
  },
  {
    "id": 53,
    "cards": "2356778m23888p22s",
    "answer": "2m",
    "tips": "这手牌正确打法应该打掉2万，因为打掉2万后，可以进469万听牌，而打掉其他的牌，进张只有2门。"
  },
  {
    "id": 54,
    "cards": "446688m11145789p",
    "answer": "6m",
    "tips": "像这副牌这样的跳对，应该拆掉中间的一对牌，打6万的话，可以碰出48万或者进57万，都可以实现听牌，如果打4万的话会丢失7万的进张，所以这副牌最优打法是打掉6万。"
  },
  {
    "id": 55,
    "cards": "2255578p2245667s",
    "answer": "2s",
    "tips": "这手牌要拆掉两个搭子和两个对子，在听牌时，搭子的效率要比对子高，所以应该在2条和2筒之间做选择，打2筒的话，可以进69筒，58条总共4门牌，打2条的花，可以进69筒，358条总共5门牌，所以这手牌打掉2条是最佳打法，多进一门3条。"
  },
  {
    "id": 56,
    "cards": "1244m4457789p127s",
    "answer": "1m",
    "tips": "这副牌搭子较多，边搭质量不高。留中张7条来68条能优化搭子，打1万是因为1万和2万需要的是3万。打出1万，并不会损失3万的进张。"
  },
  {
    "id": 57,
    "cards": "1233367m668p1156s",
    "answer": "2m",
    "tips": "在这幅手牌中56条与67万都是双面搭，摸进47条，58万就能成牌了，打出8筒，这牌依然是6搭牌，并且会丢失7筒的进张。这副牌当中，3万就可以组成一副成牌，所以12万的价值是最低的，我们直接打掉因此可以拆掉12万，根据选项则选择打掉2万"
  },
  {
    "id": 58,
    "cards": "35799m777p456888s",
    "answer": "3m",
    "tips": "如果打7万只能听夹4万，但是打3万时后续有更好的优化机会，除了听夹6万之外，当来8万或者9万时，就可以继续优化手牌打出5万，可以听7999万或者7899万，所以正确打法应该是打三万。"
  },
  {
    "id": 59,
    "cards": "112m57999p346799s",
    "answer": "6s",
    "tips": "这副手牌应该打掉6条。根据六搭拆搭，不丢张或者少丢张原则，这手牌应该打掉6条，因为打掉6条，不会丢失58条的进张。"
  },
  {
    "id": 60,
    "cards": "13888m566777p445s",
    "answer": "5s",
    "tips": "根据麻将口诀，两对拆搭，所以正确打法应该是打掉5条,保留筒子的321牌型，打掉5条后，可以进2万，4条，45678筒一共7门28张，减去手牌8张，还有20张进牌机。"
  },
  {
    "id": 61,
    "cards": "11124789p112489s",
    "answer": "4s",
    "tips": "这手牌，我们打出4条，进3饼和7条都可以听牌。如果打出4饼，进了37条可以听牌。听牌机会相同，但是打了4饼，来了3饼相当要拆出一个1饼来做成牌，丢了杠出机会。所以建议打出4条"
  },
  {
    "id": 62,
    "cards": "13567889p133456s",
    "answer": "1s",
    "tips": "这手牌如果打掉9筒的话，可以进28筒，23条，一共4门如果打掉1条的话，可以进2478筒和3条，一共5门，而且可以把手牌打成一个两对半的牌型，所以正确打法应该是打掉1条。"
  },
  {
    "id": 63,
    "cards": "244456899m22246p",
    "answer": "8m",
    "tips": "这手牌应该打掉8万，因为打掉8万并不会丢失7万的进张，三个4万看作一副成牌，56万照样可以进7万，所以说这手牌8万是一个不丢张的打法，可以进3479万和5筒听牌。"
  },
  {
    "id": 64,
    "cards": "2224589m1234456p",
    "answer": "9m",
    "tips": "这副牌的最优解是打掉9万，因为1，4筒打出去的话，只能摸89万才能两面听牌，2,9万打出去可以摸来147筒，或者是8万都可以两面听牌，所以这副牌应该打掉9万。"
  },
  {
    "id": 65,
    "cards": "45999m344568p788s",
    "answer": "7s",
    "tips": "根据一对先定将原则，这副手牌应该打掉7条，如果打掉8筒，则会丢失7筒的进张。"
  },
  {
    "id": 66,
    "cards": "22257799m13p1135s",
    "answer": "5s",
    "tips": "根据麻将口诀，六搭拆搭，正确打法应该是打掉5条，虽然丢失了4条的进张，但是手牌依旧保持5搭牌，之后可以进2筒，12条，5789万都可以算做进章，这样效率会提高很多。"
  },
  {
    "id": 67,
    "cards": "13m2345568p11788s",
    "answer": "8p",
    "tips": "可以看到这手牌是一个6搭牌，如果打掉8条的话，会丢失8条的碰张，而且整手牌依然有6搭牌，如果打1万的话，会丢失2万的进张。正确的打法应该是打掉8筒，因为打掉8筒后，没有丢失7筒的进张，依旧有234筒和556筒可以保留7筒的进张"
  },
  {
    "id": 68,
    "cards": "3457m111p1126999s",
    "answer": "2s",
    "tips": "这副牌型7万肯定是不能打的，如果打出6条，万子都是进张，条子则是1234条进张打出2条话，条子能进45678的进张，明显进张更多，因此这副牌最优打法则是打2条。"
  },
  {
    "id": 69,
    "cards": "3444789m2333778p",
    "answer": "7p",
    "tips": "这副牌打掉8筒，要想胡牌的话，除非碰7筒不然只能胡对倒和坎张，但是打掉7筒的话，来任何牌都可以进行两面听牌，因此这副牌最优打法是打掉7筒。"
  },
  {
    "id": 70,
    "cards": "23456p113445667s",
    "answer": "6s",
    "tips": "这手牌应该打掉6条，因为如果打掉4条的话，1234条属于一条线上的牌，147是一条线上的牌，如果你打4条，对方手上有1234的四连，他肯定也会跟着你打4条，所以这手牌，为了方便利于碰出的情况下，应该直接打掉6条。"
  },
  {
    "id": 71,
    "cards": "677m566777p45699s",
    "answer": "7m",
    "tips": "根据口诀，三对拆一对，打六筒多出一对七筒，打七万进张最多，可以五八万，四五六七八筒与九条."
  },
  {
    "id": 72,
    "cards": "23466999m224467p",
    "answer": "4p",
    "tips": "这副牌打7筒看起来不丢5筒的进张，但当我们对子较多时就得留好的搭子去拆对子，这个时候打掉4筒，虽然损失了4筒的进张，但是多了3筒的进张，并且2筒比4筒更容易碰出，因此这副牌应该打掉4筒。"
  },
  {
    "id": 73,
    "cards": "7888m6678p112334s",
    "answer": "3s",
    "tips": "根据智能分析，打三条进张最多，可以进56789万，456789筒，1条，一共12门进张，进张数最多，可以点击下方分析进行辅助分析进张数量对比。"
  },
  {
    "id": 74,
    "cards": "245667m999p23778s",
    "answer": "8s",
    "tips": "根据麻将口诀一对先定将，应该打八条，这样就会有三万，五万，八万，一条和四条的进张后直接听牌。"
  },
  {
    "id": 75,
    "cards": "1223467m3456777p",
    "answer": "2m",
    "tips": "该副手牌分解之后，以成牌为主，7筒为将牌，可以发现24万为卡张搭子，所以需要拆掉24万，打掉2万进14万也可以做将牌，这样的话7筒可以做成牌，打掉4万，则会丢失14万的进张，因此打掉2万是最优打法。"
  },
  {
    "id": 76,
    "cards": "456788m78p333788s",
    "answer": "7s",
    "tips": "听牌前，两对子的进张能力，比双面搭子强，所以两个对子8条和8万都不能拆，所以就要考虑打4万或者7条了，由于4万是五连顺中的一张，打4万会丢369万，打7条会丢69条机会，所以正确打法是打7条。"
  },
  {
    "id": 77,
    "cards": "12344588m345788s",
    "answer": "1m",
    "tips": "这手牌应该在788条和445万之间进行拆对，如果打掉4万,可以进368万，689条，总共6门牌19张牌，如果打8条，可以进3468万，69条，总共也是6门19张牌;考虑到8条对子比4万对子更好碰出，所以应该拆445搭，但是由于手牌有123万可以和445万连起来，所以打掉1万，才是最正确最安全的打法。"
  },
  {
    "id": 78,
    "cards": "23789m6688p11123s",
    "answer": "8p",
    "tips": "可能很多人会选择打掉3条，碰68筒,进14万听牌，选择打3条的一定是把3个一条看作一副成牌，但是正确打法应该是把123条看成一副成牌，根据麻将口诀，三对拆一对，三对拆对不拆搭，应该打8筒，可以进67筒，14万和14条听牌。"
  },
  {
    "id": 79,
    "cards": "2337m1115667p234s",
    "answer": "2m",
    "tips": "根据麻将口诀，应该一对先定将，这手牌的正确打法应该是打掉2万，因为打掉7万的话，可以进1234万，45678筒，总共9门36张，减去手牌7张，还有29张的进牌机会;打掉6筒的话，可以进123456789万，&nbsp;总共9门36张，减去手牌4张，还有32张进牌机会。但是打2万的话，可以进45678筒，356789万，总共11门44张，减掉手牌7张，还有37张进牌的机会。"
  },
  {
    "id": 80,
    "cards": "223468p23666888s",
    "answer": "2p",
    "tips": "如果打2筒，可以进678筒，1234条，总共7门牌，如果打8筒，可以进256筒，14条，总共5门牌，所以这手牌正确打法应该打掉2筒。"
  },
  {
    "id": 81,
    "cards": "46888m112456668s",
    "answer": "2s",
    "tips": "这手牌的正确打法应该是打2条，因为打8条会丢失7条的进张，打2条并不会丢失3条的进张，并且可以进5万，367条听牌。"
  },
  {
    "id": 82,
    "cards": "355799p23467899s",
    "answer": "5p",
    "tips": "这手牌如果打掉3筒，有效进张是5门20张减去手牌6张，还有14张牌的进张机会，同时也保留了3对在手上这明显是不对的;这手牌我们有两幅成牌，根据麻将口诀，三对拆一对，正确打法应该是打掉5筒，保留了筒子的四连坎，可进468筒，碰9筒和9条，一共是5门20张，减去手牌4张，一共有16张牌的进张机会"
  },
  {
    "id": 83,
    "cards": "1223478m1122378s",
    "answer": "1m",
    "tips": "这手牌分解手牌后，看成两副成牌234万，123条，剩下4个搭子，12万、78万、12条、78条中间拆一个，那肯定从12万或者12条之间拆掉1搭，所以正确打法应该是打掉1万，后续无将时，留12条还可以碰一对，留一对做将。"
  },
  {
    "id": 84,
    "cards": "566999m56p233457s",
    "answer": "5m",
    "tips": "根据麻将口诀，一对先定将，所以这手牌应该打掉5万。可以进47筒，146条，一共5门牌。"
  },
  {
    "id": 85,
    "cards": "13579m123444788p",
    "answer": "7p",
    "tips": "根据麻将口诀，一对先定将，正确打法应该先打掉7筒，可以进2467万听牌。"
  },
  {
    "id": 86,
    "cards": "3467889p3334567s",
    "answer": "8p",
    "tips": "如果打掉47条的话，可以进23456789筒听牌，一共8门32张减去手.上7张，还有25张的进张机会，但是会丢失条子五连的效果，丢失四门牌，所以这手牌应该打掉8筒，可以进24578条，2569筒效率最高。"
  },
  {
    "id": 87,
    "cards": "555m34678p122667s",
    "answer": "1s",
    "tips": "该副牌是典型的两对拆搭，打成两对半，直接打出7条的话，会丢失58条的进账，但如果直接打1条，只会丢失3条的进张，因此这副牌的最优打法是1条。"
  },
  {
    "id": 88,
    "cards": "23345m34567p7888s",
    "answer": "7s",
    "tips": "这手牌的正确打法应该是打掉7条，可以进123456万,2345678筒，一共13门52张牌，减去手上的10张，一共有42张进牌就听牌的机会。"
  },
  {
    "id": 89,
    "cards": "11123344567789m",
    "answer": "7m",
    "tips": "这手牌最佳应该打掉7万。打1万有258三门减去手牌有9张，打2万有34万两门减去手牌有4张，打3万有147万三门减去手牌有5张，打4万有2358万四门减去手牌有11张，打7万有25369万五门减手牌有14张"
  },
  {
    "id": 90,
    "cards": "334779p12366789s",
    "answer": "3p",
    "tips": "该打掉3筒。此牌是典型的三对牌型，三个对子两幅成牌，所以根据三对拆一对原则，&nbsp;拆掉好成牌的对子，留下不好成牌的对子去碰牌，组牌，所以拆掉3筒有较大概率可能胡25筒的口子，如果拆掉7筒就会胡到卡8筒的口子上，所以这牌应该打掉3筒。"
  },
  {
    "id": 91,
    "cards": "24499m45p3477789s",
    "answer": "9s",
    "tips": "这手牌应这手牌保留89条的搭子是没有任何作用的，正确打法应该是打掉9条，如果打掉2万的话不仅会损失3万的进张，而且仍然有6搭牌，还是需要拆掉搭子。所以应该打掉9条。"
  },
  {
    "id": 92,
    "cards": "1123468m2223579s",
    "answer": "9s",
    "tips": "这手牌如果打掉8万的话，只能进48条，如果打掉9条的话，可以进7万，46条，所以正确打法应该是先打掉9条，把手牌先打成三连坎，然后再调整机会看看1万能不能碰出，如果碰出的话，打掉7条，就可以把手牌打成一个超级四人抬轿，可以进678万，1345条听牌，所以应该打9条。"
  },
  {
    "id": 93,
    "cards": "12366799m345667p",
    "answer": "6p",
    "tips": "这手牌是三对拆一对牌型,如果打掉六万，接下来碰了9万，那6筒就只能做将听在58万上，但是如果打掉6筒，即使碰了9万，也可以听在258万上，比打9万多一门，所以正确打法应该是打6筒。"
  },
  {
    "id": 94,
    "cards": "111357m46p234777s",
    "answer": "7m",
    "tips": "这手牌只能从357万，46筒这两搭牌中拆掉一张，&nbsp;首先排除5万，357万是两连坎牌搭，作为中间牌5万肯定不能拆;暗刻带单张有利于增加进张面，因此3万也不能打，那么这手牌比较合理的打法只能从7万，4筒和6筒当中选-&nbsp;-张。正确打法应该是打掉7万，因为打6筒的话，进234567万,4筒，总共6门，打7万可以进2345万，456筒，总共7门，所以正确打法应该打7万。"
  },
  {
    "id": 95,
    "cards": "2368m34667p11288s",
    "answer": "8m",
    "tips": "根据麻将口诀，六搭拆搭，小技巧就是如果优先拆搭，而不是三对拆一对，所以这手牌正确打法应该是打8万，因为其他3个选项打出去后，手里还是6搭牌。"
  },
  {
    "id": 96,
    "cards": "355m1234p1225667s",
    "answer": "1s",
    "tips": "首先这手牌的四连牌型和大肚子牌型不能动，因为这种牌型的靠张能力非常强，正确打法应该打掉1条，因为打掉1条后，可以进45万，2356筒，24578条都是有用的，所以打掉1条是最高效的打法。"
  },
  {
    "id": 97,
    "cards": "34567778m345566s",
    "answer": "6s",
    "tips": "正常情况下都会打三六条，虽然同样是听四、七条，但建议打六条，首先保持出牌安全性，因为六条有一对，三条只是单张，这样打六条相对不容易被碰，其次保持序数牌延伸优势，打六条后，后续如果来二条，再打出五条，手牌就可以优化成23456的五连顺听三门。"
  },
  {
    "id": 98,
    "cards": "44568999p888999s",
    "answer": "4p",
    "tips": "这副牌打8筒听4、7筒，打掉4筒，可以听7、8筒,根据147原理，带掉4筒可以降低7筒防备，并且手牌有3个9筒,8筒也能快速打出，因此这副牌最优打法则是打掉4筒。"
  },
  {
    "id": 99,
    "cards": "23456p113445667s",
    "answer": "6s",
    "tips": "这副牌最优解是打掉6条。首先，打4条，如果别人手牌有1234这种，就会跟着打4条，1条就难打出来，只能自己摸;其次，如果打6条，打哪-&nbsp;-张都可以碰出下叫听胡，或者摸进147筒听258条，摸进258条听147筒，所以这副牌应该打掉6条。"
  },
  {
    "id": 100,
    "cards": "11179m334p677888s",
    "answer": "4p",
    "tips": "这手牌应该直接打掉4筒，保留复合牌型，这样就有进张三筒，八万和56789条，都可以听胡。"
  },
  {
    "id": 101,
    "cards": "1124889m1245667s",
    "answer": "1s",
    "tips": "可能很多人会选择打掉4万，不仅变成5搭牌，而且进3万也不丢张，但是这样打就会剩下一对8万做将，有效进张就只有358条了。所以更优秀的打法应该是打1条，后面不论是进3条还是进58条，都可以把牌型打成两对半的牌型，胜率会比打4万更高，所以正确打法应该是打1条。"
  },
  {
    "id": 102,
    "cards": "113467p22245899s",
    "answer": "4p",
    "tips": "正确打法应该打4筒，因为打4筒不会损失25筒的进张，而打其他牌，都会损失进张。"
  },
  {
    "id": 103,
    "cards": "34567m34p3444567s",
    "answer": "3s",
    "tips": "如果打3条，进2345678万，2345筒都可以听牌，总共11门。如果打4筒，进3筒，258万，2358条都可以听牌，总计8门。因此这手牌打3条才是最佳打法。"
  },
  {
    "id": 104,
    "cards": "11468999p224578s",
    "answer": "5s",
    "tips": "根据六搭拆搭原理，以不丢张或者少丢张为原则，所以这副手牌应该打掉5条，因为打掉5条，不会丢失36条的进张。"
  },
  {
    "id": 105,
    "cards": "34666778m224567s",
    "answer": "7s",
    "tips": "如果打掉8万的话，可以进257万，23条，一共5门。如果打掉7万的话，可以进2569万，23条，一共6门。如果打掉47条，可以进256789万，23条，一共7门。所以正确答案是打7条。"
  },
  {
    "id": 106,
    "cards": "999m34467p236799s",
    "answer": "6s",
    "tips": "这手牌应该拆搭不拆对，所以要在3筒和6条当中进行选择，当拆牌后影响进牌几率相差不大时，就要考虑后续手牌的优化，因为这手牌留下3筒，还有一个摸进5筒形成五连顺的几率，所以正确打法应该打掉6条。"
  },
  {
    "id": 107,
    "cards": "2345567m1122247s",
    "answer": "4s",
    "tips": "这手牌是一个一对三单的牌型，很明显2345万四连牌型可以进1234567万是不能动万字，能选的就是打掉47条其中的一张，打7条进56789条，打4条进23456条，由于自己手上已经有三张二条，所以正确打法应该是打4条。"
  },
  {
    "id": 108,
    "cards": "1123467p3477789s",
    "answer": "9s",
    "tips": "这副牌是典型的六搭牌，根据先拆边后拆卡原则，打掉89条并不会丢掉7条的进张，所以可以直接拆89条，因此选择打掉9条。"
  },
  {
    "id": 109,
    "cards": "4456788m44555p45s",
    "answer": "4m",
    "tips": "根据麻将口诀，这手牌是典型的三对拆一对牌型，&nbsp;需要从48万和4筒之间拆掉一对，由于8万更容易碰出，优先考虑留下，因此剩下4万和4筒可以选择，正确打法应该是打4万，因为如果打4筒，那另外一张4筒，就会变成没有用的单牌，而打4万，剩下的4万还可以组成369进张牌型。所以应该打4万。"
  },
  {
    "id": 110,
    "cards": "2356778m22888p22s",
    "answer": "2m",
    "tips": "六搭拆搭，以不丢张少丢张为原则，打掉2万会丢掉1万的进张，如果打掉78万，会丢失69万的进张，损失更大，所以这手牌应该打掉2万。"
  },
  {
    "id": 111,
    "cards": "124588m368p45688s",
    "answer": "1m",
    "tips": "这手牌正确打法应该先打1万，不影响3万的进张，并且可以创造优化手牌的机会，因为有两个进单张的边搭和坎搭，其中边搭是所有搭子里最不容易进张的搭子，会拖慢手牌进牌效率，所以应该打1万。"
  },
  {
    "id": 112,
    "cards": "4568m123778p2456s",
    "answer": "8p",
    "tips": "应该打掉8筒，保留八万和二条，因为八万可以进三六七八九万听牌，二条也是同样的效率，可以进一-二三四七条听牌，留八筒会降低效率，所以正确打法应该打八筒。"
  },
  {
    "id": 113,
    "cards": "1345m15558p36789s",
    "answer": "1p",
    "tips": "这手牌闲张孤张比较多，应该优先打掉靠张组搭能力最弱的牌，应该从1筒和1万中选择一张，由于一万有345万顺子的存在，变相增强了1万的靠搭能力，比如后续如果进6万，13万就可以组成搭子，所以这手牌的正确打法应该打掉1筒。"
  },
  {
    "id": 114,
    "cards": "23555678p446688s",
    "answer": "6s",
    "tips": "这手牌正确打法应该是拆468的条子对子，打8条的话，可以进467条3门牌，打4条的话，可以进568条3门牌，打6条的话，可以进4578条4门牌，因此，这手牌打掉6条是正确打法。"
  },
  {
    "id": 115,
    "cards": "334778m12345788s",
    "answer": "7s",
    "tips": "这手牌的正确打法应该打掉7条，因为打掉7条并不会损失6条的进张，但是打三万或者七万，都会损失较多的进张，所以应该打7条。"
  },
  {
    "id": 116,
    "cards": "11123m5688p11577s",
    "answer": "5p",
    "tips": "根据麻将口诀，六搭拆搭，应该打5筒，6筒可以跟8筒进行靠搭，组成5搭牌牌型。其他选项拆掉后，手里还是有6搭牌。"
  },
  {
    "id": 117,
    "cards": "23m244567p112334s",
    "answer": "2p",
    "tips": "这手牌是复合型牌搭，112334条，成牌可以固定成123条，也可以固定成234条，当123条时，进张就是25条，当234条时，进张就是12条。因此像这手牌，在优先留住两对子的情况下，拆搭就不能拆条子，正确打法应该是打2筒。"
  },
  {
    "id": 118,
    "cards": "233456778p23478s",
    "answer": "3p",
    "tips": "这手牌的正确打法应该是打掉3筒，可以进12456789筒,6789条，一共12门48张牌，减去手牌9张还有39张进牌机会，比打掉28筒多了20张的进张机会。"
  },
  {
    "id": 119,
    "cards": "13666m2344p11167s",
    "answer": "4p",
    "tips": "这副牌最优打法是打掉4筒，做无将一上听，&nbsp;四人抬轿，如果这时摸进123万，5678条都能听牌，因此这副牌需要打掉4筒。"
  },
  {
    "id": 120,
    "cards": "22257799m13p1135s",
    "answer": "5s",
    "tips": "这手牌最佳应该打掉5条。57万打出都是6搭牌，没有改良，打掉1筒丢失2筒进张，并且摸2条就没有搭子了，打掉5条，打成5搭牌，进2筒进12条。5789条都算有效进张，进张效率高。"
  },
  {
    "id": 121,
    "cards": "22378m68999p1124s",
    "answer": "4s",
    "tips": "这手牌不缺对子，不缺搭子，只缺成牌。打6筒跟4条丢张是一样的，所以考虑的就是成牌效率，打掉2万来14万是6搭牌，打6筒来7简也是6搭牌，打掉4条来3条，&nbsp;打1条不来3条，1条边张也好碰牌，然后再来14万或者7筒就可以形成4人抬轿牌型，所以这手牌应该打掉4条。"
  },
  {
    "id": 122,
    "cards": "224567m22488999p",
    "answer": "4p",
    "tips": "听牌前坎搭的进牌效率不如对子，所以这手牌要留对子,那么就要拆坎搭中的4简，4万和7万，但是47万是四连顺中的一部分，后续有比较大的优化机会，所以这手牌应该打4筒。"
  },
  {
    "id": 123,
    "cards": "4556799m1156789p",
    "answer": "5m",
    "tips": "遇到六搭牌，有两个对子，两个双面搭子的时候，早拆中间晚拆边，所以可以打掉5万，7万可以靠上9万，重新变成五搭牌，因此这副牌最优打法是打掉5万。"
  },
  {
    "id": 124,
    "cards": "888999m335p57889s",
    "answer": "8s",
    "tips": "这手牌把8条拆出来，是-一个-对三单的牌型，应该打8条，这样就会有34567简和34567条的进张听牌机会"
  },
  {
    "id": 125,
    "cards": "13556m122234778p",
    "answer": "1p",
    "tips": "这手牌还没有那么快听牌，考虑打掉哪张不容易损失更多的 进张机会,根据五搭牌原理，这手牌已经是六搭牌了，需要拆掉一搭， 在复合搭子里面选择一搭拆掉，打掉1桶5万7桶进张最多，根据筋线牌理论，打掉1桶容易引出4桶7桶，并且尽量保持对子可碰后续杠，所以打掉1桶最优，可进2457万，25679桶，9门29张。"
  },
  {
    "id": 126,
    "cards": "4556779m1156789p",
    "answer": "9m",
    "tips": "\r\n根据麻将口诀，三对拆一对，打掉9万形成455677万复合牌型进张效率最高，可进367万，147筒，6门18张。"
  },
  {
    "id": 127,
    "cards": "123999m3578p4699s",
    "answer": "5p",
    "tips": "根据6搭拆搭不丢张或者丢张最少的原则,那么这首牌的正确答案打掉5筒，首先来看一下这手牌为什么不能打 掉 4条,4条一打。第一丢掉了5条的进张，其次你丢掉了3条来形成二5条的双面搭的几率，6条一打丢掉了5条，还丢掉了7 条。打掉三筒 ，既丢掉了四筒，还丢掉了二筒，这手牌打掉五筒，只会丢失一门四筒的进张， 5筒打掉了过后摸来了6 筒七八筒接得住，因为5筒跟七 八筒之间有一个重复进张的6筒。打掉5 筒只会丢失一门 4 筒，而并不丢6筒的进张。七八筒就不用拆了，为什么呢？全手只有一个69 筒的双面搭，把8筒拆掉了过后听口质量就差了，所以说打掉 5 筒是更为高效的"
  },
  {
    "id": 128,
    "cards": "2377m2245p234779s",
    "answer": "7m",
    "tips": "这首牌的正确答案打掉7万，首先我们排除掉79条，打掉79条还是6搭牌，并没有对手牌起到推进的作用，其次5筒也不能打，我们要保留好的进口质量，全手两个双面搭，打掉后进口质量就差了，所以在7万和2筒之间做选择，金三银七臭二八，2筒比7万好碰出，所以保留2筒，打掉7万"
  },
  {
    "id": 129,
    "cards": "5688m4467p111777s",
    "answer": "7p",
    "tips": "这首牌的正确答案打掉7筒，打掉7筒，摸来了3筒过后，可以打掉 6 筒改良成二 5筒的双面搭。手牌往前推进一步，如果这手牌打掉5万过后，摸来了9万，因为麻将没有10万,所以不能改良成7万跟10万的双面搭，所以说这手牌打掉7筒比打掉5万要高效的多，8万是属于边张牌型，它不具备靠搭能力，而这个4 筒是属于中间的牌型，它具备靠搭能力。所以说打掉7筒才是最正确的打法"
  },
  {
    "id": 130,
    "cards": "222677m11123778s",
    "answer": "7s",
    "tips": "这手牌打掉7万跟打掉7条，是不是理论上来讲都可以，但是正确答案是打掉7条，举个例子，把7万一打，摸来了 147 条，是不是 100% 会打掉这个八条？因为你要打掉 8 条，听五8万的双面听，这个8条它本身就是属于边缘牌型，边缘牌型被别人碰出的概率永远比中章牌型要高，把八条一打过后，如果摸来了九条过后，是不是又要去打这九条？那这个九条是不是又有可能给别人杠，又有可能给别人碰呢？也就是说打掉 8 条的麻友，既没有防守住 9 条，还没有防守住 8 条。相当于两张边张牌型你都没有防守住。那现在退一万步讲，打7条来试一下，如果打掉 7 条的话，这手牌摸来了一四条，碰7万，摸五8万，都可以选择打掉6万或者是打掉7万，而这个六七万都是属于中间的牌型，被别人碰出跟杠出的概率本身就不高，所以说，这手牌的正确答案，打掉7条，叫做攻守兼备，既懂得进攻，你还要懂得防守。"
  },
  {
    "id": 131,
    "cards": "346789p12233478s",
    "answer": "3p",
    "tips": "这手牌是4人抬轿的牌型，四人抬轿的牌型指的是当我们的手上有三副完整的成牌，再加上两副没有完成的成牌，这两副没有完成的成牌组合在一起就叫做四人抬轿的牌型。四人抬轿的牌型它有一个特点，它的特点是进张数量特别的多。也就是说这手牌无论你是打掉369 桶任何一张都可以打成一个四人抬轿的牌型。都是进8门牌32张的进张，打3筒进4569筒6789条听牌，打69筒进2345筒6789条听牌， 但是有一个问题点，打掉69筒只能摸来34筒78条一共4门牌16张能听双面听，减去手上的4张，还剩下12张听双面听，打掉3筒可以摸469筒69条听双面听，一共20张，减去手上3张，还有17张，所以这手牌正确答案打掉3筒"
  },
  {
    "id": 132,
    "cards": "23555667m335678p",
    "answer": "5p",
    "tips": "这手牌是321的复合牌型，特点是进张数量特别的多，这手牌摸来了 45678 万，其中的任何一张牌你都可以听牌。所以说这手牌 67 万一定不能打，那这首牌打掉 58桶取决于牌局的分段。如果这首牌在牌局的早期，建议大家打掉这个 8 筒，因为打掉 8 筒叫做拆回头牌如果摸来了 4 筒的话，你可以改良辰 258 筒的三面搭。这个时候再去选择打六七万，不影响你杠5万，碰6万也不影响你进二 58 筒，碰 3 筒摸一四万，如果摸来了一四万，你还可以听到二五八筒的三面听。如果这手牌到了牌局的中后期，这个8桶都还没有出来，那你肯定就要打掉5桶。你打掉5桶过后，如果摸来了9 桶，你可以打掉 6 桶。既可以防守住 8 筒，还能防守住这个9桶，所以牌局的中后期一定要选择打掉这个 5筒"
  },
  {
    "id": 133,
    "cards": "3336778m678p2337s",
    "answer": "2s",
    "tips": "这手牌就是非常非常典型的一对三单的牌型，它有一个特点，二条、七条7万三个单张，对不对？其他的都是成牌，都是对子，所以说这样的牌型叫做一对三单的牌型。一对三单的牌型有一个特点，你只需要找到哪一张牌的靠搭子的能力最差，你就打掉哪一张牌。那么二条七万，哪一张牌的靠搭能力最差呢？那很明显是这个二条吗？金三银七、臭二八吗所以说这手牌闭着眼睛打掉二条。"
  },
  {
    "id": 134,
    "cards": "455m789p34456679s",
    "answer": "4m",
    "tips": "这手牌是一个一对定将的牌型，一对定将指的是当我们的手牌处于一进听且只有一个对子的情况下，我们直接打掉对子旁边所关联的牌型，保留下这个对子作为将牌，这叫做一对定将，这手牌，一定要打掉4万，而不能打掉 9 条。很多朋友一来，啪，把 9 条打掉了啊。打掉9条的麻友，你打麻将肯定是经常点杠，经常点炮，想都不用想，来为什么不能打掉 9 条，首先第一9条是属于边张牌型，打出去容易被别人碰，容易被别人杠，这是第一。第二，打掉九条过后，你只能摸二条、听五八条，摸五条、听二五八条、摸八条来，听到二五条。打掉 9 条的麻友，只能摸 3 门牌 12 张牌的进章，那如果这手牌打掉4万，是不是摸来了二五八条也可以听牌，还可以碰5万，碰 6 条来听牌，所以说打掉4万比打掉 9 条多了两门牌 8 张牌的进张。打掉4万可以摸二五八条，碰六条，碰五万来听牌，而你这手牌如果打掉九条，你只能摸二五八条来听牌"
  },
  {
    "id": 135,
    "cards": "345579m11355999s",
    "answer": "9m",
    "tips": "这手牌我们就一定要注意了，前面给大家讲过的，一队定将两队拆搭 3 队拆队， 4 队必碰牌， 5 队摸 7 队。那这手牌分解手牌只有两对，两队我们要拆掉搭子，所以说这首牌只能在5万跟9万之间做选择，答案很明显，是打9万。那为什么不能打掉5万呢？有三个原因，这手牌可以做 7 对的，摸来了3万、4万，3条，7万就变成了5 对牌了，这是第一，你把5万一打，是不是丢掉了你唯一做 7 对的机会？这是第二。第三，打掉9万，就算摸不来7 对，打掉9万，摸来了4万，还可以改良成 25 万的双面搭，所以打掉9万是正确选择"
  },
  {
    "id": 136,
    "cards": "345667m11334p123s",
    "answer": "6m",
    "tips": "首先我们来看一下这个牌型，那么这个牌型它是一个一进听的牌型，同时是一个三个对子，是不是这手牌要不打掉6万，要不打掉三桶？但是这手牌告诉了我们一个知识点，叫做预留好你的听口质量，很多朋友打三桶，你把三桶打掉，碰一桶碰6万，你只能听25筒，那这手牌如果打掉6万，碰一桶，3筒，摸25筒，可以听二五八万，这就叫做预留好你的听口质量。既然你想听二五八万，那你就提前打掉6万，防止6万碰到过后你听不了二五8万"
  },
  {
    "id": 137,
    "cards": "12337m112378p245s",
    "answer": "7m",
    "tips": "这首牌叫做无将的牌型，缺对子就一定要保留靠对能力比较强的牌型，只需要找到哪一张牌的靠对能力比较强，你就保留下哪一张牌就行了，对吧？那么这手牌首先一桶排除掉不能打，因为摸14筒能形成一个对子和一幅成牌。那答案也就在7万和2条中选择，这手牌一定要打掉7万，无将一听，打闲不打连，当我们手上缺对子的时候，打短不打长，这个7万不就是一张废牌吗？二条摸来了三条，可以形成二三四五条的四连牌型，缺降缺搭留四连，四连牌型是所有牌型里面它的利用价值非常高的一种牌型了。这是第一，第二，二条不打，摸来了 2 条，四五条可以形成一个双面搭，摸来了 5 条，二 4 条可以形成一个卡张搭子。而这个七万唯一的作用就是摸来7万，摸来搭子意义不大，所以正确答案打掉7万"
  },
  {
    "id": 138,
    "cards": "2455568m1245667s",
    "answer": "2m",
    "tips": "这手牌就考验大家是如何分解手牌，比较简单，直接打掉2，8万其中一张即可，这首牌是一进听牌型，要学会分解手牌规则，先分解成牌（先顺子，再刻子），再分解对子，再搭子，所以不能打12条，只能打28万"
  },
  {
    "id": 139,
    "cards": "2234m236678p3799s",
    "answer": "2m",
    "tips": "那这手牌是不是似曾相识？一对3单跟一对 4 单的牌型感觉区别没有什么区别，对不对？那么这首牌型叫做一对4单，那么一对4单跟一对3单其实原则上是一样的，因为都缺搭子，你只需要找到哪一个牌的靠单能力比较弱，你就打掉它,金三银七臭二八，所以说打掉二万"
  },
  {
    "id": 140,
    "cards": "2334578m1134678s",
    "answer": "8m",
    "tips": "首先这手牌是一个非常典型的六搭牌，那么六搭牌我们一定要学会一件事情，六大拆搭不丢张，或者是丢张最少，把我们手上的牌处理成五大牌。这是所有打麻将的朋友必须要知道的一件事情，因为五搭牌原理是优于一切麻将打法的，只要你打的是全国的 13 张麻将，你听牌、胡牌一定只需要 5 个搭子。那你多一个搭子，少一个搭子，你既不能听牌，你也不能胡牌，所以说这首牌你一定要学会去判断你手牌的价值。这手牌我们一定要打掉这个8万，千万不要去打掉三四条，二三万，那很多朋友不理解为什么要打掉8万呢？因为打掉8万才能丢张最少，打掉8万，虽然丢掉了9万的进张，但是保留了6万。那如果这手牌打掉 23 万，是不是丢掉了 14 万两门牌？要是打掉三四条的话，是不是丢掉了 25 条两门牌？所以说这手牌的正确答案一定要打掉8万，因为打掉8万才能丢张少，丢张少进张就多了。"
  },
  {
    "id": 141,
    "cards": "23456m5779p11123s",
    "answer": "5p",
    "tips": "这手牌是一个非常典型的一个两对的牌型。一对定将两对拆搭，也就是说这手牌只能打掉 5 桶跟 9 桶，千万不要拆 7 桶跟一条来打，更不能去打掉二三条。那么这首牌能打的只有这个 5 桶跟 9 桶，如果这首牌把9桶一打，保留下 5 桶的意义是什么呐？就算摸来一个四桶，是不是还要打掉 4 桶啊？因为并不能改良成 36 筒的双面搭，对不对？那既然打掉 9 筒，保留下 5 筒，并不能改良成 3 三 6 筒的双面搭，也就是说这手牌 5 桶存在的价值只能摸一张卡6桶的进张，而9桶存在的价值，它不仅可以摸卡 8 桶，它还可以摸9桶的进张吗？打掉 9 桶，摸来了 5 桶怎么打？是不是不打 5 桶就打 7 桶，那打掉 5 桶，既可以摸 8 桶，还可以摸 9 桶吗？因为一对 9 桶肯定比一对 7 桶好碰，另外一对 7 桶加一个酒桶叫做半封闭半包围的牌型，因为一对 7 桶加一个9桶对 8 桶形成了半封闭， 8 桶需求 7 桶的概率降低了，那么 7 桶需求 8 桶的概率它不就提高了吗？所以说卡 8 桶的进张效率，它是永远高于这个卡 6 桶的啊。那么这手牌的正确答案是打掉 5 桶 "
  },
  {
    "id": 142,
    "cards": "12234447m115679p",
    "answer": "2m",
    "tips": "这首牌叫做一对三单的牌型，只需要找到哪一张牌的靠打能力最差，就打掉哪一张牌，去保留下靠搭能力最强的那一张牌就可以了。那么9桶二万跟七万之间,首先排除掉7万，7万的靠答能力是最强的，金三银七臭二八这个麻将的口诀大家天天都在背，所以说这首牌七万他一定不能打，那这个二万顶天了，摸 123四万,这个 9 桶了，最多摸 789 桶带 4 桶吗？他们都只有 4 门牌 16 张牌的竞争，而这个7万可以有 5 门牌 20 张牌的竞争。那么正确答案干掉这个二万就可以了啊。打掉2万叫做最大几率打法。因为2万周边只有1234万，我们手上已经有7张1234万了，而9桶靠搭的手上只有2张，打掉2万可以摸来有用牌概率更大，麻将它本身就是一个概率游戏跟数字游戏，你只有让你的进张数量变得越来越多，那摸来有用牌的概率就会越来越大，摸来有用牌的概率越来越大，那么你听牌胡牌的概率才会越来越大，这就叫做麻将的最大几率打法。"
  },
  {
    "id": 143,
    "cards": "224688m23456799p",
    "answer": "2m",
    "tips": "这手牌有三个对子，那么三个对子一定要学会拆搭子的原则，一对定将两对拆搭 3 对去拆掉一对。那么三队拆队它有一个前提条件，三队拆队的前提条件是你的手上必须拥有两幅完整的成牌，也就是说你的手牌得处于一进听的时候，你才能三队拆掉一队。那这手牌 234567 筒刚好两副完整的成牌，符合三队拆队的原则。那既然三队拆队，你就拆掉二万跟八万呢？打掉二万你可以摸三万，摸五万，摸七万，碰八万，碰 9 桶，一共是五门牌 20 张牌的进张。打掉八万，你可以摸三万，摸五万，摸七万，碰二万，碰9桶，你也是五门牌 20 张牌的进张，所以说这手牌的正确答案，打掉二万，打掉八万都可以"
  },
  {
    "id": 144,
    "cards": "234778m6667p3334s",
    "answer": "7m",
    "tips": "我们可以把六七桶跟三四条分开来看，我们看成是3 对的牌型，当然我们也可以把它看成是两对的牌型，那么这手牌一对 6 筒，一对 3 条可以作为将牌，六七筒跟三四条可以看成是两个双面搭。也就是说这手牌给我们得到的信息是什么呢？永远不可能缺对子，这手牌闭着眼睛打，永远不可能单调嘛，那么既然这手牌不可能缺对子，那就打掉7万，因为就算摸来了 69 万，还要打七万，而打掉7万的话，只丢两张7万的进张。最差你都可以听到六9万的双面听。甚至是听到三面听。那这首牌打掉8万的麻友，打麻将绝对是经常输的，第一，你打掉8万，你丢掉了 4 张6万， 4 张9万，丢掉了 8 张牌，第二8万是属于边缘牌，打出去被别人碰触跟杠处的概率比较高。那如果别人把这个8万碰了或者是杠了，你的手上还有一个隐形的炸弹，9万，对吧？你把 8 万一打，如果你反手摸来了一个9万，那这个9万你必打无疑。打掉8万的麻友，不知道什么叫做进攻，什么叫做防守。我打掉7万既懂得了防守住了8万，还防守住了9万，同时还保留了 69 万的进张。而且的进张效率是最高的，所以说这手牌一定要选择打掉7万，而不能去打掉8万啊。"
  },
  {
    "id": 145,
    "cards": "133799p12345667s",
    "answer": "7p",
    "tips": "这手牌正确答案要打掉 7 桶，原因很简单，首先第一个原因，因为一对 9 桶它肯定比一对 3 桶好碰，是吧？所以说既然一对酒桶比一对三桶好碰，那就让一对酒桶去碰。既然这个三桶不好碰，那就去把这个一桶留住，让一桶帮一下这个三桶，防止这个三桶碰不到听不了牌。第二个打掉7筒的原因，打掉7筒叫做打勾章，因为打掉 7 桶过后，是有可能骗到 9 桶的碰出的，而你打掉一桶永远骗不出这个 3 桶。第三个原因打掉7筒保留半封闭牌型，一对三桶加一个一桶叫做半封闭半包围的牌型，叫做关门打狗的牌型，一对三桶加一个一桶对二桶形成了半封闭，二桶需求三桶的概率降低了50%，三桶需求二桶的概率就提高了50%。也就是说，这手牌卡二筒永远比卡8筒好糊，所以正确答案打掉7筒"
  },
  {
    "id": 146,
    "cards": "24556m124567p789s",
    "answer": "2m",
    "tips": "这手牌很明显是缺对子，那么既然缺对子，就去符合型排型里面去找，筒子这手牌是100%不能打 ，124567 桶这个牌型叫做复合型牌型。符合性排型的特点是进张数量特别的多，摸来了一二三四五六七八九筒，其中的任何一张筒子你都有用这手牌摸来了一四七筒，你可以听牌。摸来了三桶，你还可以听到一四七桶的三面听，所以说这手牌桶子可以摸四门牌， 16 张牌的进张你都可以听牌，那这手牌是不是只能从二五万当中选择打掉一张？大家一定要注意这手牌，不仅缺对子，还缺搭子，四五五六万叫做大肚子的牌型。大肚子的牌型它有一个特点，它的特点是靠搭能力非常的强，我们可以把四五万跟五六万看成是两个双面搭，摸来了三六万，可以形成四七万的双面搭，摸来了四七万，可以形成三六万的双面搭，摸来了五万，还可以直接定牌，也就是说这个五万可以摸到五门牌 20 张牌的紧张。你把二万留在手上，就算你摸来了一万，这个一万也是废牌。你无论是打掉2万还是打掉五万，都不影响你摸三万，因为这个三万是二五万之间的重复进张。你打掉二万也好，你打掉五万也罢，他都不丢三万的进张，所以说打掉二万只会丢失一门牌二万的进张，也就是说打掉二万你只会丢二万一张牌，而你打五万呢？你会丢四五六、七万四，门牌十六张。而打掉二万只会丢二万一张牌的竞争，所以说这手牌永远是打掉二万比打掉五万更为高效。大家把这手牌的知识点记一下，无将一上听，打闲不打连，这个2万就是一个最没有用的孤张，所以说直接打掉2万就可以了"
  },
  {
    "id": 147,
    "cards": "33367m4467p22356s",
    "answer": "7p",
    "tips": "这手牌相对来说就比较简单了，因为这手牌是一个六搭牌，六搭拆搭不丢张或者是丢张最少把我们手上的牌处理成五搭牌，这是所有打麻将的朋友你们必须要知道的一件事情。所以说这首牌只能打掉 7 筒。打掉7筒过后，你虽然丢掉了 4 张 8 筒的进张，但是你保留了卡 5 筒，所以说打掉 7 桶的马友，你只丢一门牌 8 筒的进张，那如果这手牌你打掉7万，打掉六万，你肯定丢掉了五八万两门牌呀。打条子同理，所以正确答案打掉7筒"
  },
  {
    "id": 148,
    "cards": "1134579m1233479p",
    "answer": "9p",
    "tips": "这首牌我们把五七九万看成是一个三连卡，七九桶看成是一个卡 8 桶的搭子，七九桶的利用价值是不是远远没有五七九万的利用价值高，那么既然七九筒没有七九万的利用价值高，那你就打九桶啊，这是打掉酒桶的第一个原因。第二个原因我们用逆向思维来打一下这手牌，如果把 9 万一打，摸来了 6 桶，是不是还要打掉 9 桶？或者摸来了6万过后，是不是还要拆掉七9桶？或者是要拆掉三四桶，是不是这手牌在原地踏步？也就是说这个9筒早打晚打都得打，那如果提前打九筒，摸来了6万，可以选择打七筒，这个9万就不用打了，这叫做打扣张，把这个9万一定要扣在手里。因为9万是属于危险章子，连牌都没有听，为什么要打掉9万呢？所以说把这个9万一定要扣在手里，叫做打扣张，如果打掉七桶过后，能摸来二五桶过后，这个时候你已经听牌二五八万了，这个时候再去选择打九万，因为这个时候打九万叫做打冲张，这个时候打九万是为了骗这个八万，因为你已经定牌二五八万了，再去打掉九万过后，如果九万被别人碰了，他手上有八万，他这个八万是必打无疑的。所以说打麻将扣牌跟冲牌是很重要的。为什么麻将高手打麻将总是能接住别人的杠上炮呢？为什么你跟那个麻将高手打麻将的时候，你会发现他的这个生张，这种生死张永远是在他听牌的时候才打，他没有听牌的时候他永远不会打，所以说你一定要去注意，一定要学会去判断有没有可能给他点杠上炮，所以这手牌的正确答案是打掉9筒"
  },
  {
    "id": 149,
    "cards": "4568m123778p2456s",
    "answer": "8p",
    "tips": "应该打掉8筒，保留八万和二条，因为八万可以进三六七八九万听牌，二条也是同样的 效率，可以进一二三四七条听牌，留八筒会降低效率，所以正确打法应该打八筒。"
  },
  {
    "id": 150,
    "cards": "566999m56p233457s",
    "answer": "5m",
    "tips": "根据麻将口诀，一对先定将，所以这手牌应该打掉5万。可以进47筒，146条，一共5门牌。"
  },
  {
    "id": 151,
    "cards": "25m44455567p1238s",
    "answer": "2m",
    "tips": "这手牌是一个一对三单的牌型，要注意重复进张，如果打8条的话，保留25万来做靠张一上听，3万和4万是重复进张，所以这样的话效率会降低很多，所以像这种一对3单靠张一上听的牌，就不要保留同一门花色的，特别是有重复进张的，所以应该打掉2万，因为5万的进张能力是比2万要更强的。"
  },
  {
    "id": 152,
    "cards": "11468999p224578s",
    "answer": "5s",
    "tips": "根据六搭拆搭原理，以不丢张或者少丢张为原则，所以这副手牌应该打掉5条，因 为打掉5条，不会丢失36条的进张。"
  },
  {
    "id": 153,
    "cards": "224567m22488999p",
    "answer": "4p",
    "tips": "听牌前坎搭的进牌效率不如对子，所以这手牌要留对子，那么就要拆坎搭中的4筒，4万和7万，但是47万是四连順中的一部分，后续有比较大的优化 机会，所以这手牌应该打4筒。"
  },
  {
    "id": 154,
    "cards": "34567m34p3444567s",
    "answer": "3s",
    "tips": "如果打3条，进2345678万，2345筒都可以听牌，总共11门。如果打4筒进3筒，258万，2358条都可以听牌总计8门。因此这手牌打3 条才是最佳打法。"
  },
  {
    "id": 155,
    "cards": "55m234678p445588s",
    "answer": "5s",
    "tips": "这手牌应该保留8条对子，因为靠边的对子比较容易碰牌，同时要尽量保留45条的搭子作为后续的听牌牌型，所以应该拆掉45条的对子，正确 打法应该打掉5条，因为5条比4条有更大的概率，消耗对方更多的中心牌，可以从最中心的序数牌部位，破坏别人手牌的关联能力，从而 降低别人创造多连张的进牌机会"
  },
  {
    "id": 156,
    "cards": "23555678p446688s",
    "answer": "6s",
    "tips": "这手牌正确打法应该是拆468的条子对子，打8条的话，可以进467条3门牌，打4条的话，可以进568条3门牌打6条的话，可以进4578条4门牌，因此，这手牌打掉6条是正确打法。"
  },
  {
    "id": 157,
    "cards": "12234447m335679p",
    "answer": "2m",
    "tips": "这副牌我门应该打掉2万。这手牌是典型的四搭牌，缺搭子，我门需要靠张能力强的單牌重新去组搭子，然后再 用到我们经常说到的口诀，有将打边肚无将打大肚，打掉2万就可以了"
  },
  {
    "id": 158,
    "cards": "2225799m113p1135s",
    "answer": "5m",
    "tips": "根据麻将口诀，六搭拆搭，虽然35条，57条是中张牌，13筒是边张牌，但是拆掉13筒，我们没有把牌形打成进一步，所以正确打法应该是打掉5条或者5万都可以，打五条丢4条，打五万丢6万，但我们会把手牌推进成5搭牌，当 我们手理是6搭牌的时候，我们一定是先把牌推进成5搭牌。"
  },
  {
    "id": 159,
    "cards": "13888m566777p445s",
    "answer": "5s",
    "tips": "根据麻将口诀，两对拆搭，所以正确打法应该是打掉5条，保留筒子的321牌型，打掉5条后，可以进2万，4条45678筒一共7门28张，减去手牌8张，还有20张进牌机会。"
  },
  {
    "id": 160,
    "cards": "13m2345568p11788s",
    "answer": "8p",
    "tips": "可以看到这手牌是一个6搭牌，如果打掉8条的话，会丢失8条的碰张，而且整手牌依然有6搭牌，如果打1万的话会丢失2万的进张。正确的打法应该是打掉8筒，因为打掉8筒后，没有丢失7筒的进张，依旧有234筒和556筒可以保留7筒的进张。"
  },
  {
    "id": 161,
    "cards": "11179m334p677888s",
    "answer": "4p",
    "tips": "如果打7条的 话，进牌有8万，235筒58条，总共是6门24张，减去手里的5张，还有19张牌的进牌机会，正确打法应该打掉4筒，进牌有8万，3筒56789条，总共是7门28张，减去手里的8张，还有20张牌的听牌机会，所以打4筒才是最大几率打法。"
  },
  {
    "id": 162,
    "cards": "2334m234888p3568s",
    "answer": "3m",
    "tips": "这手牌的正确答案是打掉3万，我们可以把手牌打成无將 一上听，条子进345678条，六门牌任何一张都可以听牌"
  },
  {
    "id": 163,
    "cards": "344567m11344789s",
    "answer": "4m",
    "tips": "根据麻将口诀，这手牌属于三对拆一对牌型，如果打掉4条，那么碰出1条或者碰出4万的情况下，只能打 掉3万听在25条上面，但是如果打掉4万的话，无论是碰出14条还是进张25条，都可听在258万上面，胡牌的几率会更大，所以正确打法应 该是打掉4万。"
  },
  {
    "id": 164,
    "cards": "23456p113445667s",
    "answer": "6s",
    "tips": "首先这 手牌是一进听胡的状态，打掉4条和6条都可以一进听胡，但是打4条的话，对手打出1条的概率就会比较小但是打6条的话，就不存在这种 情况无论是碰1条还是碰4条，都可以直接听牌，所以正确打法应该是打6条。"
  },
  {
    "id": 165,
    "cards": "35799m777p456888s",
    "answer": "3m",
    "tips": "如果打7万只能听夹4万，但是打3万时后续有更好的优化机会，除了听夹6万之外，当来8万或者9万时，就可以继续优化手牌打出5万，可以听7999万或者7899万，所以正确打法应该是打3万。"
  },
  {
    "id": 166,
    "cards": "4445666m2345678p",
    "answer": "8p",
    "tips": "如果打掉5万，选听257筒的话，总共是3门12张，减 去3张重复，一共有9张牌的一个胡牌机会，正确打法应该是打掉258筒其中一张，可以听34567万五门牌，五门20张减去手上的7张，一共 有13张的进张机会，比打5万听258筒要多。"
  },
  {
    "id": 167,
    "cards": "344567m11334p123s",
    "answer": "4m",
    "tips": "三对拆一对，如果打掉打掉3饼，如果碰牌，我们大概率只能听25饼的叫口，打掉四万只要我们碰牌，就可以听258万的叫口，所以正确打法就是打掉4万。"
  },
  {
    "id": 168,
    "cards": "11234778m244456s",
    "answer": "7m",
    "tips": "根据麻将口诀，三对拆一对的情况，正确打法应该是打掉七万，如果打2条的话，可以进1679万，47条，总共6门24张，减 掉手上的7张，还有17张牌的进牌机会，同时也丢失了三条的进张；打7万的话，可以进169万，347条，总共也是6门24张，减掉手上的5张，还有19张的进牌机会，比打掉2条多了2张，并且七万是一个中张牌，并不好碰，所以应该打掉七万。"
  },
  {
    "id": 169,
    "cards": "78899m3399p13678s",
    "answer": "9m",
    "tips": "这手牌优先考虑拆掉89万，留下13条的门子，因为89万进只有七进万才有用，进89万，只能组成一个789万一副成牌加八万或者九万的搭子，我们本来就有3饼，9饼的二个对子了，所以我们的正 确打法是打掉这个8万的搭子。"
  },
  {
    "id": 170,
    "cards": "23m244567p112334s",
    "answer": "2p",
    "tips": "这手牌是复合型牌搭，112334条，成牌可以固定成123条，也可以固定成234条，当123条时，进张就是25条，当234条时，进张就 是12条。因此像这手牌，在优先留住两对子的情况下，拆搭就不能拆条子，正确打法应该是打2筒。"
  },
  {
    "id": 171,
    "cards": "222468m334888p34s",
    "answer": "4p",
    "tips": "根据麻将口诀，一对先定将，因此正确打法应该是打掉4筒 ，专心优化条子和万字的搭子。"
  },
  {
    "id": 172,
    "cards": "1124889m1245667s",
    "answer": "1s",
    "tips": "可能很多人会选择打掉4万，不仅变成5搭牌，而且进3万也不丢张，但是这样打就会剩下一对8万做将，有效进张就只有358条了。所以更优秀的打法应该是打1条，后面不论是进3条还是进58条，都可以把牌型打成兩对半的牌型，胜率会比打4万更高，所以正确 打法应该是打1条。"
  },
  {
    "id": 173,
    "cards": "1122378p1223478s",
    "answer": "1s",
    "tips": "分解手牌，看成两幅成牌234条，123筒，剩下4个搭子，12条，89条，12 筒78筒中间拆一个，那肯定从12条或者12筒之间拆掉一搭，所以正确打法应该是打掉1条，后续无将时，留12筒还可以碰一对，留一对做 将。"
  },
  {
    "id": 174,
    "cards": "113467p22245899s",
    "answer": "4p",
    "tips": "六搭拆搭的牌型，第一步是在不丢张或者少丢张的情况下，把6搭牌推进成5搭牌，所以正确打法应该打4筒，打4筒把牌打成了五搭牌，同时也不会损失25筒的进张，而打其他的任何一张牌，都会损失进张。"
  },
  {
    "id": 175,
    "cards": "334778m12345788s",
    "answer": "7s",
    "tips": "三对拆一对，是在有二副成牌的情况下，我们三对拆一对，这手牌的正确打法应该打掉7条，打7条我们只丢失9条的进张，还打其它的任何一张都至少丢失了二门的进张，打四万丢25万，打8万丢69万。打掉7条过后，进368条，进235679万，九门牌的任何一张都可以把牌打成2对半。"
  },
  {
    "id": 176,
    "cards": "123789m579p33577s",
    "answer": "9p",
    "tips": "这手牌的正确打法，应该把它打成一个两对半的牌型，直接打掉五筒或者九筒，可以保留条子这边的跳对3连坎，可以碰37条，可以进46条，卡6筒或者卡8筒，共是5门20张，减去手上4张，还有16张进张机会，所以这手牌的正确答案是打掉9筒，留下5筒的话，我们可以预留进4筒做一个优化改良的机会。"
  },
  {
    "id": 177,
    "cards": "11567m334p455666s",
    "answer": "3p",
    "tips": "这手牌有二副成牌，所以我们是三对拆对牌型，这手牌应该打3筒，打3筒我们只失去碰3筒的机会，但是换来的是进1万，25筒，34567条，一共8门牌的任何一张，一进就可以听牌，"
  },
  {
    "id": 178,
    "cards": "44479m334p677888s",
    "answer": "4p",
    "tips": "如果打7条的话，进牌有8万，235筒58条，总共是6门24张，减去手里的5张，还有19张牌的进牌机会，正确打法应该打掉4筒，进牌有8万，3筒，56789条，总共是7门28张，减去手里的8张，还有20张牌的听牌机会，所以打4筒才是最大几率打法。"
  },
  {
    "id": 179,
    "cards": "3456789m56p23555s",
    "answer": "9m",
    "tips": "这手牌应该打成无将一上听，也就是打掉三六九万其中的一张，条子可以进1234条，筒子可以进4567筒，总共8门32张，减去手上4张，还有28张进牌机会，像这种手上没有将，打掉手里的孤章，保留双搭做四人抬轿是最大几率打法。"
  },
  {
    "id": 180,
    "cards": "1123468m2223579s",
    "answer": "9s",
    "tips": "这手牌如果打掉8万的话，只能进48条，如果打掉9条的话，可以进7万，46条，所以正确打法应该是先 打掉9条把手牌先打成三连坎，然后再调整机会看看1万能不能碰出，如果碰出的话，打掉7条，就可以把手牌打成一个超级四人抬轿，可 以进678万，1345条听牌，所以应该打9条。"
  },
  {
    "id": 181,
    "cards": "46888m112456668s",
    "answer": "2s",
    "tips": "这手牌的正确打法应该是打2条，因为打8条会丢失7条的进张，打2条并不会丢失3条的进张，并且可以进5万，367条 听牌。"
  },
  {
    "id": 182,
    "cards": "23345m34567p7888s",
    "answer": "7s",
    "tips": "这手牌的正确打法应该是打掉7条，可以进123456万，2345678筒，一共13门52张牌，减去手上的10张，一共有42张进牌就听牌的机会。"
  },
  {
    "id": 183,
    "cards": "3334889m1223367s",
    "answer": "4m",
    "tips": "这手牌保留4万是没有价值的，因为四万 的能力是摸进二万或者五万，但是这手牌摸进二万,也得把二万打掉，因为它搭子的价值，不如二三条和六七条，摸进五万也得把它打掉 ，所以说这手牌保留四万在手上，没有任何的能力,所以打掉四方，有机会勾出三方开杠，并且保留九方的话，摸进七万打八万，可以改 良成一个加强代碰的4人抬轿。"
  },
  {
    "id": 184,
    "cards": "11456m1135666p35s",
    "answer": "5p",
    "tips": "这手牌考虑拆对子还是拆搭子，由于听牌前，两对子的进牌效率是大于坎搭，因此这手牌只能考虑从35筒和35条之间拆掉一张牌 ，如果拆35条，丢4条进张，如果拆35筒，丢的是4筒的进张面，看似区别不大，但是值得注意的是，当当前进牌几率相差不大时，就要考虑是否后续对优化有帮助。所以正确打法应该打5筒，剩下的3筒还可以和1筒的对子组成进2筒的搭子。"
  },
  {
    "id": 185,
    "cards": "2345567m1122247s",
    "answer": "4s",
    "tips": "这手牌是一个一对三单的牌型，很明显2345万四连牌型，可以进1234567万，所以万字不能动，能打掉的就是打掉47条其中的一张，7条进56789条，4条进23456条，由于自己手上已经有3张2条， 所以正确打法应该是打4条"
  },
  {
    "id": 186,
    "cards": "34567778m345566s",
    "answer": "6s",
    "tips": "正常情况下都会打三六条，虽然同样是听四、七条，但建议打六条，首先保持出牌安全性，因为六条有一对，三条 只是单张，这样打六条相对不容易被碰，其次保持序数牌延伸优势，打六条后，后续如果来二条或者七条再打出五条，手牌就可以优化成23456,或者345657的五连顺听三门。"
  },
  {
    "id": 187,
    "cards": "223468p23666888s",
    "answer": "2p",
    "tips": "如果打2筒，可以进678筒，1234条，总共7门牌，如果打8筒，可以进256筒，14条，总共5门牌，所以这手牌正确打法应该打掉2筒。"
  },
  {
    "id": 188,
    "cards": "24499m45p3477789s",
    "answer": "9s",
    "tips": "这手牌保留89 条的搭子是没有任何作用的，正确打法应该是打掉9条，如果打掉2万的话不仅会损失3万的进张，而且仍然有6搭牌，还是需要拆掉搭子。所以应该打掉9条。"
  },
  {
    "id": 189,
    "cards": "1123457p3477789s",
    "answer": "7p",
    "tips": "这副牌是典型的六搭牌，正确打法是打掉7筒，可以把牌打成2对半，进136筒，进25条，进8条，共6门牌的进张。"
  },
  {
    "id": 190,
    "cards": "2457m11135p12278s",
    "answer": "2m",
    "tips": "这手牌是一个两进听的牌型，没有那么 快听牌，所以打掉1条是不对的，因为2457万里面，2万和7万的作用都是进3万和6万，45万的作用也是如此所以这手牌应该在2万和7万之 间选择，根据麻将口诀臭28原则，应该打掉2万。"
  },
  {
    "id": 191,
    "cards": "1134899m3578999s",
    "answer": "8s",
    "tips": "根据五搭拆搭原理，拆搭的原则就是拆掉丢张少或者说不丢张的牌，首先这里打掉8万肯定是不明智的，因为打掉万，手里还是6搭牌，打掉3条之后我们会丢4条的进张，打掉4万，虽然说手牌可以被打成5搭，但是丢了5万的进张，所以正确打法应该是打掉8条，保留8条的作用是进69条，打掉后也不会丢失69条的进张"
  },
  {
    "id": 192,
    "cards": "233456778p23478s",
    "answer": "3p",
    "tips": "这手牌的正确打法应该是打掉3筒，可以进12456789筒，6789条，一共1248张牌，减去手牌9张还有39张进牌机会，比打掉28筒多了20张的进张机会。"
  },
  {
    "id": 193,
    "cards": "113557m11234678p",
    "answer": "5m",
    "tips": "正确打法应该是打掉5万，进1筒，1246万总共5门20张，减掉手上的4张，共16张的进牌机会可以听牌，比打7万多了两张，并且保留了两对三连坎牌型，是最优打法"
  },
  {
    "id": 194,
    "cards": "13556m123334678p",
    "answer": "4p",
    "tips": "这手牌还没有那么快听牌，考虑打掉哪张不容易损失更多的进张机会，如果打1万，损失两万一门的机会，如果打1筒，损失2筒和5筒两门的机会，如果打3筒，只会损失3筒1门一张的进张机会，但是无法形成2对半的牌型，只能进25筒和2万听牌，所以说这手牌要从6万和4筒之间去做选择，打掉6万的进235筒25万听牌，一共有14张有效进张，打掉4筒有2457万3筒有效进张，一共有15张，所以这手牌打掉4筒最为高效"
  },
  {
    "id": 195,
    "cards": "56m233457p111566s",
    "answer": "5s",
    "tips": "根据 麻将口诀，一对先定将，所以这手牌应该打掉5条。可以进47万，146筒，一共5门牌。"
  },
  {
    "id": 196,
    "cards": "78m23666p1234567s",
    "answer": "1s",
    "tips": "这手牌应该打掉147条其中一张，打出去后就成了无将一上听四人抬轿牌 型四人抬轿就是保留3副成牌，外加两个两面搭，这时候两个搭子的周边摸进6789万，1234筒都可以听牌，总共8门32张，减去手牌的4张 ，还有28张的一进听牌机会。"
  },
  {
    "id": 197,
    "cards": "111m23378p344568s",
    "answer": "2p",
    "tips": "根据麻将口诀，一对先定将，正确打法应该先打掉2筒，可以进69筒和257条听牌。"
  },
  {
    "id": 198,
    "cards": "355799p23467899s",
    "answer": "5p",
    "tips": "这手牌如果打掉3筒，有效进张是5门20张减去手牌6张还有14张牌的进 张机会，同时也保留了3对在手上这明显是不对的，这手牌我们有两幅成牌，根据麻将口诀，三对拆一对，正确打法应该是打掉5筒，保留了筒子的四连坎一共是5可进468筒，碰9筒和9条，门20张，减去手牌4张，一共有16张牌的进张机会"
  },
  {
    "id": 199,
    "cards": "12344588m345788s",
    "answer": "1m",
    "tips": "这手牌应该在788条和445万之间进行拆对，如果打掉万，可以进368万，689条，总共6门牌19张牌，如果打8条，可以进3468万，69条，总共也是6门19张牌，考虑到8条对子比4万对子更好碰出，所 以应该拆445搭，但是由于手牌有123万可以和445万连起来所以打掉1万，才是最正确最安全的打法"
  },
  {
    "id": 200,
    "cards": "22245667p345999s",
    "answer": "6p",
    "tips": "这手牌应该打掉6筒听牌，一共听347筒3门，比打掉其他牌要 听的多"
  },
  {
    "id": 201,
    "cards": "22356789m334788p",
    "answer": "3m",
    "tips": "根据麻将口诀，三对拆一对是在有两副成牌的情况下，才去做三对拆一对没有两幅成牌3对也可以不拆对，应该打掉一个搭子，这手牌如果打7筒的话，会丢失69筒的进张，打掉4简会丢失25筒的进张，打掉三方只会丢失个一万的进张，所以应该打三万"
  },
  {
    "id": 202,
    "cards": "56667889p134456s",
    "answer": "8p",
    "tips": "这手牌应该打掉8筒，可以摸进25条听457筒，摸进147条听牌，摸进457筒听牌，有8门32张减去手上的6张-共有26张的听牌机会，比打掉1条多了7张，提升了40%左右的听牌速度。"
  },
  {
    "id": 203,
    "cards": "4456788m44555p45s",
    "answer": "4m",
    "tips": "根据麻将口诀，这手牌是典型的三对拆一对牌型，需要从48万和4筒之间拆掉一对，由于8万更容易碰出，优先考虑留下，因此剩下4万和4筒可以选择，正确打法应该是打4万，因为如果打4筒，那另外一张4筒，就会变成没有用的单牌，而打4万，剩下的4万 还可以组成369进张牌型。所以应该打4万"
  },
  {
    "id": 204,
    "cards": "23355789m114567p",
    "answer": "3m",
    "tips": "正确打法应该是打掉3万，可以进145万，13568筒一共8门，并且下叫听牌的质量也是比较高的，但是如果打47筒的话，后期很有可能会听在一筒和5万的对倒胡上"
  },
  {
    "id": 205,
    "cards": "3588899m3588999s",
    "answer": "5s",
    "tips": "根据麻将口诀，六搭拆搭，所以需要从35万和35条中间做选择，考虑到手牌的关联性，关键点就在5万和5条，五万右边的进张是67万假设打了5万和3万，后面进了67万，和8万组成了一副成牌，然后保留一对8万，一对9万一 共还是6搭牌，并没有对手牌起到推进的作用。所以正确打法应该是打掉5条，后面进67条后，可以和8条组成一副成牌，退掉8条就是5搭 牌型。"
  },
  {
    "id": 206,
    "cards": "233789m2456p4568s",
    "answer": "2m",
    "tips": "分析牌型后，这手牌是一对三单的牌型，要注意单张的靠张能力，正确打法应该是打掉二万，因为2万保留的话它的进张能力是1234万，保留八条的话， 进张能力是36789条，二简的进张能力是12347筒，对比下来只有2万的靠张能力最差，所以应该打掉2万"
  },
  {
    "id": 207,
    "cards": "7888m6678p112334s",
    "answer": "3s",
    "tips": "这手牌的正确打法应该是打3条,打6筒可以进12345条，56789万，一共10门打7万可以进12345条，456789筒共11门打3条可以进1条，456789筒，56789万，一共12门"
  },
  {
    "id": 208,
    "cards": "2368m34667p11288s",
    "answer": "8m",
    "tips": "根据麻将口诀，六搭拆搭，小技巧就是如果优先拆搭，而不是三对拆一对所以这手牌正确打法应该是打8万，因为其他3个选 项打出去后，手里还是6搭牌。"
  },
  {
    "id": 209,
    "cards": "223888m4677p4667s",
    "answer": "4s",
    "tips": "这手牌应 该优先打掉重复进张面的牌需要在4筒和4条之间做一个选择，需要注意的是后续如果碰了7筒，那46筒依然可以组成一个搭子，但是如果 碰了6条，剩下的47条就会变成散牌所以正确打法应该打掉4条。"
  },
  {
    "id": 210,
    "cards": "12366799m345667p",
    "answer": "6p",
    "tips": "这手牌是三对拆一对牌型，如果打掉六万，接下来碰了9万，那6筒就只能做将听在58万上，但是如果打掉6筒 即使碰了9万，也可以听在258饼上，比打9万多一门，所以正确打法应该是打6筒。"
  },
  {
    "id": 211,
    "cards": "233789m2456p4568s",
    "answer": "2m",
    "tips": "分析牌型后，这手牌是一对三单的牌型，要注意单张的靠张能力，正确打法应该是打掉二万，因为2万保留的话它的进张能力是1234万，保留八条的话，进张能力是36789条，二简的进张能力是12347筒，对比下来只 有2万的靠张能力最差，所以应该打掉2万"
  },
  {
    "id": 212,
    "cards": "244456899m22246p",
    "answer": "8m",
    "tips": "这手牌应该打掉8万，因为打掉8万并不会丢失7万的进张，三个4万看作一副成牌，56万照样可以进7万，所以说这手牌8万是一个不丢张的打法，可以进3479万和5筒听牌"
  },
  {
    "id": 213,
    "cards": "2356778m23888p22s",
    "answer": "2m",
    "tips": "这手牌正确打法应该打掉2万，因为打掉2万后，可以进469万听牌，而打掉其他的牌，进张只有2门。"
  },
  {
    "id": 214,
    "cards": "11123m5688p11577s",
    "answer": "5p",
    "tips": "这手牌是典型的6搭牌，需要拆掉一搭所以正确打法应该是打掉5筒，因为后续如果摸上7筒，也不会浪费，并且整手牌变成了5搭牌。"
  },
  {
    "id": 215,
    "cards": "2337m1115667p234s",
    "answer": "2m",
    "tips": "根据麻将口诀，应该一对先定将，这手牌的正确打法应该是打掉2万，因为打掉7万的话，可以进1234万，45678筒，总共9门36张，减去手牌7张，还有29张的进牌机会;打掉6筒的话，可以进123456789万，总共9门36张，减去手牌4张，还有32张进牌机会。但是打2万的话，可以进45678筒，356789万，总共1144张，减掉手牌7张，还有37张进牌的机会"
  },
  {
    "id": 216,
    "cards": "13567889p133456s",
    "answer": "1s",
    "tips": "这手牌如果打掉9筒的话，可以进28筒，23条，一共4门如果打掉1条的话可以进2478筒和3条，一共5门门，而且可以把手牌打成一个两对半的牌型,所以正确打法应该是打掉1条。"
  },
  {
    "id": 217,
    "cards": "224578m123p34889s",
    "answer": "5m",
    "tips": "根据麻将口诀，六搭拆搭，无论打8条还是9条之后，手上还是6搭牌，所以需要把牌型尽快打成5搭牌型。正确打法是应该打掉5万，因为5万是一个眼牌，224可以进3万，78万 可以进6万所以这张5万是没有多大作用的，应该直接打掉。"
  },
  {
    "id": 218,
    "cards": "13556m123334778p",
    "answer": "3p",
    "tips": "这手牌还没有那么快听牌，考虑打掉哪张不容易损失更多的进张机会，如果打1万，损失两万一门的 机会，如果打1筒，损失2筒和5筒两门的机会，如果打3筒，只会损失3筒1门一张的进张机会，况且绝张的中心牌更不容易进张，所以这手牌应该打掉3筒"
  },
  {
    "id": 219,
    "cards": "2333m3456p116778s",
    "answer": "2m",
    "tips": "打7条，进14万乘二对牌，不能一进听牌，36筒更加不能打，3456筒的四连牌型，可以进12345678再筒，进56789条都可以听牌，所以正确打法是打掉 2万，二万的有效进张只有14万，进了14万你牌型变成2对，不能一进听牌，进其它 的张还是要打掉2万。所以正确打法是打掉2万。"
  },
  {
    "id": 220,
    "cards": "224578m11156899s",
    "answer": "5m",
    "tips": "六搭牌型的原则是，第一步把六搭牌打成五搭牌，以不丢张或少丢张的原则，这手牌，所以打掉5万，能把牌打成5搭牌，也没有丢失369万的进张。"
  },
  {
    "id": 221,
    "cards": "236789m23345667p",
    "answer": "6m",
    "tips": "打2筒，3筒做将牌，只能进58万跟14万，四门牌打3筒，可以进1469万，6筒，五门牌打6筒，也是一样的效果。打6万，可 以进14万，1458筒，36筒共8门牌进张，所以打掉69万是正确的"
  },
  {
    "id": 222,
    "cards": "2377789m34p45566s",
    "answer": "5s",
    "tips": "这手牌，45566，要拆分成456条跟56条的搭子，77789万，要看成一副成牌跟一个对子，如果把777万看成一副成牌，拆掉89万的话，这手牌变成了两进听，所以这手牌看成三对拆一对就可以了。拆掉这个五条六条对子是正确的，打五六条可以进，14万，25万，一进听牌，打八九万，要二进才能听牌。"
  },
  {
    "id": 223,
    "cards": "78m11557p3477789s",
    "answer": "9s",
    "tips": "根据麻口诀一对定将，两对拆搭，这首牌是典型的两对牌型，两个对子只能拆搭子，打掉89条是最好的选择，进一筒，五筒可以做将，进五筒六筒，一筒可以做将，拆 89条还有扛七条的机会"
  },
  {
    "id": 224,
    "cards": "11157799m5779p13s",
    "answer": "5p",
    "tips": "6搭拆搭原理，799筒看成一搭，打掉5筒我们把牌打成了5搭，只丢失一个6筒的进张，打五七万，折13条，都不能让牌更进一步，还是6搭牌，所以正确打法是打掉5筒"
  },
  {
    "id": 225,
    "cards": "11124m6899p22367s",
    "answer": "6p",
    "tips": "根据麻将口决，六搭拆搭，正确打法是打掉 6筒，千万不能打4万，因为摸来三万，会多一个一万的对子，整手牌变成了3个对子，最后很可能听到对倒湖上面，正确打法是打掉 6筒，"
  },
  {
    "id": 226,
    "cards": "1388m23788p13567s",
    "answer": "1m",
    "tips": "这手牌很简单，拆一三万 跟拆一三条，正确打法打掉一三万，因为摸来4条的话，条子可以改良成258条的进张，当然摸来二条更好。"
  },
  {
    "id": 227,
    "cards": "234566m11234566s",
    "answer": "1s",
    "tips": "三对拆一对的牌型，千万不要去打掉四连。打六万，进147万，147条，六条，共7门进张，打6条，1234567万，17条，共10门牌，打一条进1234567万，345678条，共13门牌，所以正确打法是打掉一条"
  },
  {
    "id": 228,
    "cards": "245667m67999p233s",
    "answer": "2s",
    "tips": "这手牌很 简单，我们只能在2条跟2万里面选择一张，打掉2万会丢掉一个3万的进张，只能进58万跟58筒四门进牌，打掉2条，我们可以进358万，58筒四五进牌，所以打掉2条是正确的"
  },
  {
    "id": 229,
    "cards": "116m2336p3445789s",
    "answer": "6p",
    "tips": "打四条，进25条，36条，都能形成一个二面搭，所以我们不能打掉这个大肚子的四条，因为我们手里还有6万6饼的孤张，所以这手牌，我们只能在6万跟6饼里选，很明显6饼跟3饼的重重进张所以这手牌我们打掉6饼是正确的"
  },
  {
    "id": 230,
    "cards": "3467899p1233367s",
    "answer": "1s",
    "tips": "这手牌，12333条，给到我们的就是个123条加一个3条对子 ，这手牌不缺对子，所以我们要把好的机会给到好的搭子，所以我们要在34筒67条12条三个搭子之间拆掉一搭，正确打法是打掉12条，把机会给到34筒，67条这二个好的搭子，来了三条我们还能杠。"
  },
  {
    "id": 231,
    "cards": "1244789m1367p246s",
    "answer": "1p",
    "tips": "首选，26条不能打好，打掉2六条牌不能更进一步，我们根据6搭拆一拆的原理，我们要拆掉丢张 最少，进张最多的拆子，13筒的搭子跟67筒的搭子有重复的进张，所以进确的打法是手机掉 13筒。"
  },
  {
    "id": 232,
    "cards": "344568p11134778s",
    "answer": "8s",
    "tips": "一对定将，打掉8条是最进确的，可以进257筒，25条，共五门进张，一对定将的牌就是二进听牌的情况，如果首先打掉8筒，摸来69条，我们不仅不能听牌，还没有了对子，所以正确打法是打掉8条"
  },
  {
    "id": 233,
    "cards": "2345567m3688899s",
    "answer": "6s",
    "tips": "这个牌9条是将牌，那这手牌是一个对子加三个单张，我们要考虑5万，3条，6条三个单张的靠张能力，6条进45678条，我们有三个8条，所以正确打法是打掉6 条"
  },
  {
    "id": 234,
    "cards": "22356789m344788p",
    "answer": "3m",
    "tips": "这手牌在3万，3饼 ，7饼中打掉一张，因为23万跟56万有重重的进张4万，打掉3万是正确的，"
  },
  {
    "id": 235,
    "cards": "2488m123p2466788s",
    "answer": "2s",
    "tips": "这是一个6搭牌型，把2468条看成一个四连。打掉2条，变成了5搭牌，可以摸57条， 来有6条可以碰，来了8条也可以碰8条，24万不能打，打了24万，还是六搭牌，所以打掉2条是正确的"
  },
  {
    "id": 236,
    "cards": "2334568p1145599s",
    "answer": "8p",
    "tips": "打掉8饼，可以保持手上4对牌型，再摸一对可以做小七对，摸来7条也不丢张，19条也容易碰出。所以这手牌打8饼是正确的。"
  },
  {
    "id": 237,
    "cards": "234678m22357888s",
    "answer": "3s",
    "tips": "这手牌打掉一张后直接听牌，考虑到后续改良可能性正确打法应该打掉3条，如果后续再 进2条，就可以改良成7888条，听3门的牌型。"
  },
  {
    "id": 238,
    "cards": "124588m368p45688s",
    "answer": "1m",
    "tips": "这手牌正确打法应该先打1万，不影响3万的进张，并且可以创造优化手牌的机会，因为有两个进单张的边搭和坎搭，其中边搭是所有搭子里最不容易进张的搭子，会拖慢手牌进牌效率，所以应该打1万。"
  },
  {
    "id": 239,
    "cards": "234556m23677899s",
    "answer": "7s",
    "tips": "根据麻将口诀，两对拆搭，正确打法应该直接打掉7条， 把手牌打成一个两对半的牌型，打掉7条后，进张可以是14条，碰9条，进147万，碰5万，比打掉五万多了两门牌的进张效果。"
  },
  {
    "id": 240,
    "cards": "13579m123444788p",
    "answer": "7p",
    "tips": "根据麻将口诀，一对先定将，正确打法应该先打掉7筒，可以进2467万听牌。"
  },
  {
    "id": 241,
    "cards": "22257799m13p1135s",
    "answer": "5s",
    "tips": "根据麻将口诀，六搭拆搭，正确打法应该是打掉5条，虽然丢失了4条的进张，但是手牌依日保持5搭牌，之后可以进2筒，12条，5789万都可以算做进章，这样效率会提高很多。"
  },
  {
    "id": 242,
    "cards": "13888m566777p445s",
    "answer": "5s",
    "tips": "根据麻将口决，两对拆搭，所以正确打法应该是打掉5条，保留筒子的321牌型，打掉5条后，可以进2万，4条;45678筒一共7门28张，减去手牌8张，还有20张进牌机会。"
  },
  {
    "id": 243,
    "cards": "3467889p3334567s",
    "answer": "8p",
    "tips": "如果打掉47条的话，，可以进23456789筒听牌，一共8门32张减去手上7张，还有25张的进张机会，但是会丢失条子五连的效果，丢失四门牌，所以这手牌应该打掉8筒，可以进24578条，2569筒效率最高。"
  },
  {
    "id": 244,
    "cards": "78m333788p456788s",
    "answer": "7p",
    "tips": "这手牌是经典的两对半牌型，可打的牌只有7筒和7条，只需要看丢张情况就可以了，打7简丢69筒的进张，打7条丢369条的进张，很明显直接打掉7筒"
  },
  {
    "id": 245,
    "cards": "245667m999p23778s",
    "answer": "8s",
    "tips": "根据麻将口诀一对先定将，应该打八条，这样 就会有三万，五万，八万，一条和四条的进张后直接听牌"
  },
  {
    "id": 246,
    "cards": "46999m112456668s",
    "answer": "2s",
    "tips": "这手牌的正确打法应该是打2条，因为打8条会丢失7条的进张，打2条并不会丢失3条的进张，并且可以进5万，367条听牌。"
  },
  {
    "id": 247,
    "cards": "22256899p346799s",
    "answer": "6s",
    "tips": "正确打法应该打6条，因为打6条不会损失58条的进张，而打其他牌，都会损失进张。"
  },
  {
    "id": 248,
    "cards": "233444678p33488s",
    "answer": "3s",
    "tips": "这里正确的打法是打掉3条，保留筒子的一二三牌型，进张是258条，12345筒，总共是8门32张，减去手牌8张，还有24张进牌。"
  },
  {
    "id": 249,
    "cards": "5666m6678p112334s",
    "answer": "3s",
    "tips": "根据5搭牌原理，此时缺搭子，3条，6筒，5万的复合组搭能力中，三条最差，根据辅助器分析，打三条能进12门38张牌。"
  },
  {
    "id": 250,
    "cards": "1113489p2226678s",
    "answer": "6s",
    "tips": "这手牌正确的打法，应该是打掉六条，把手牌打成无将-上听，四人抬轿的牌型，可以 进2345789筒，总共7门28张，减去手牌4张，一共24张进张机会，比打掉9筒和4筒，多了7张牌的进账机会。"
  },
  {
    "id": 251,
    "cards": "11123m5688p11577s",
    "answer": "5p",
    "tips": "根据麻将口诀，六搭拆搭，应该打5筒，6筒可以跟8筒进行靠搭，组成5搭牌牌型。其他选项拆掉后，手里还是有6搭牌。"
  },
  {
    "id": 252,
    "cards": "112m2245p1112357s",
    "answer": "2s",
    "tips": "根据六搭拆搭原理，拆搭的原则就是拆掉丢张少或者说不丢张的牌，首先这里打掉2万肯 定是不明智的，因为打掉2万，手里还是6搭牌，打掉7条之后，我们会丢6条的进张，打掉5筒，虽然说手牌可以被打成5搭，但是丢了6筒的进张，所以正确打法应该是打掉2条，保留2条的作用是进14条，打掉后，也不会丢失14条的进张。"
  },
  {
    "id": 253,
    "cards": "237899m3457p3557s",
    "answer": "9m",
    "tips": "手里只有4搭牌:一对5条、345同789万、23万。根据5搭牌原理少了一搭，就要想办法凑一搭牌，很明显9万凑搭子能力最弱。"
  },
  {
    "id": 254,
    "cards": "57889m246p123999s",
    "answer": "8m",
    "tips": "这手牌应该选择打掉8万，因为打8万后整手牌会变成无将一上听，摸进5万可以听牌，保留三连砍摸进2356筒也可以听牌。"
  },
  {
    "id": 255,
    "cards": "3477889m2223889p",
    "answer": "3p",
    "tips": "这手牌能打的只有39筒，并且效果都是一样的，可以进2569万听牌，既然效果是一样的，那么就要去考虑后续的改良空间，如果打掉9筒的话，摸进134筒对整手牌都没有任何的改良，都需要拆搭，所以这手牌正确打法应该是打掉3筒，摸进78筒， 可以把手牌改成四人抬轿牌型。"
  },
  {
    "id": 256,
    "cards": "2256m12257p45579s",
    "answer": "9s",
    "tips": "手上3对牌，但是听牌还很远，所以不能拆 对。优先考虑打掉卡张搭子，所以主要在9条和7同中选择，打7同，进6条成2面搭子，但是有45条在，6条出现有效牌重复，打9条，进48 同成2面搭子。"
  },
  {
    "id": 257,
    "cards": "34666778m224567s",
    "answer": "7s",
    "tips": "如 果打掉8万的话可以进257万，23条，一共5门。，23条一共6门。如果打掉7万的话，可以进2569万，一共7门。如果打掉47条，可以进256789万，23条，所以正确答案是打7条。"
  },
  {
    "id": 258,
    "cards": "34666778m224567s",
    "answer": "7s",
    "tips": "听牌数量都较多的时候应该追求听牌质量而不是数量:打14同，可进3-9万，24张听牌机会。打9万，可进147同、368万，20张听牌机会。比打14同少了4张，但是打14同，进3456万都是1门听牌，而打9万听牌都是2门 或者3门。"
  },
  {
    "id": 259,
    "cards": "444m11145699p258s",
    "answer": "5s",
    "tips": "258牌型要打中。原因:打掉2、8条。分别有6、7条、3、4条有效牌重复问题少了4张听牌机 会。打5条，进3条、7条都可以听2面牌，不存在丢失2面听牌情况。"
  },
  {
    "id": 260,
    "cards": "23566788m445667s",
    "answer": "6m",
    "tips": "打掉8万的话，6条他就成了一张废牌，4条要做将牌，23万跟这边的56万他有重复进张，所 以这个牌型我们打掉6万呢，会更加高效"
  },
  {
    "id": 261,
    "cards": "1124677m24699p55s",
    "answer": "4m",
    "tips": "根据麻将口诀6答猜答，咱们呢打掉这张4万呢，是正确的，我们要去做减法猜塔子，这个7万就不能打，而且会丢掉两 个碰7万的机会，你打掉这个6筒呢会丢5筒，打掉2筒会丢3筒，不打4万啊，只能进来13578万，打掉这张4万，也是一样摸进13578万，所 以打4万不丢张，可以把手牌打成5答牌，"
  },
  {
    "id": 262,
    "cards": "223378p11166789s",
    "answer": "3p",
    "tips": "这个牌型，6条肯定是拿来做将的，打掉3饼是正确的，3饼打掉之后，碰了2饼我们可以直接 听69饼，打掉3饼越多，别人打掉12饼的机会就更多，摸进来14饼也可以听69饼，"
  },
  {
    "id": 263,
    "cards": "78m12234p3456999s",
    "answer": "3s",
    "tips": "我们这个牌型，他是一进听的牌型，打掉2筒的话，那我们只能进来14筒，69 万36条6门牌的一个进张可以听牌，打掉1筒，可以进来36条36万25筒也是6门牌进张可以听牌，这个牌型我们我们去打掉这张3条才是最高效的打法，为什么打掉这3条，不去打6条，因为麻将里面他有一个金线理论，金线牌理论讲的是什么，369他是一条线，258是一条线，147是一条线，打掉六条别人6789的牌型，就会跟你的臭张六条，掉出9条的机会就很小，所以正确打法是打掉3条，可以进来12345筒6789万9门牌的一个进张，这里是9门牌，比打12筒6门牌多了3门牌的进张。"
  },
  {
    "id": 264,
    "cards": "222388m11145889p",
    "answer": "3m",
    "tips": "这手牌很简单，直接打掉3万就可以了，留下3万来14万会多出二张二万，还要三对拆一对，没有必要，9筒也不能打会丢掉7筒的进张，很简单的牌型"
  },
  {
    "id": 265,
    "cards": "23789m33p2356778s",
    "answer": "2s",
    "tips": "打掉二条，只会丢一个一条的进章，保留469条3门牌的一个进章，也做到了一个6塔拆搭，如打掉二万的话会丢14万的进张，很简单的牌型"
  },
  {
    "id": 266,
    "cards": "33356m33467p2245s",
    "answer": "5s",
    "tips": "六塔拆塔，打4四7饼没有做到六塔拆塔，打掉5条只丢失了一个六条的进张，做到六塔拆塔，224也是一塔牌，33467饼，摸进来8饼还可以25的进张，打掉五是正确的。"
  },
  {
    "id": 267,
    "cards": "258m234888p11267s",
    "answer": "5m",
    "tips": "147打小，258打中，369打大，所以打掉5万是正确的。2万靠张1234万，8万靠张6789万，打五万只丢张了5万的 进张，打2万丢12万，打8万丢89万。2条不能打，会丢失3条的进张，打麻将要灵活运用，不能只记得一对先定将，这个牌型后期摸进来28万摸进来69条，都可以定将，"
  },
  {
    "id": 268,
    "cards": "234788m445p45578s",
    "answer": "4s",
    "tips": "这手牌型5搭牌型，三个对子，但不能三对拆一对，3对拆一对的前提是能一进听二进听才三对拆一对，这个牌型3对拆一对要三进才能听牌，扬以不能三对拆一对，455条跟78条有一个重复的进张6条，打掉4条只丢失一个三条的进张，还有一个碰 五条的机会能做到二进听牌，打麻将要灵活运用"
  },
  {
    "id": 269,
    "cards": "57889m335p111222s",
    "answer": "8m",
    "tips": "3饼做将，5万，8万，5饼三张牌靠张一上听，8万的靠张能力最差，所以打掉8成是正确的。"
  },
  {
    "id": 270,
    "cards": "336778m2234p2345s",
    "answer": "2p",
    "tips": "这是一个典型的四搭牌型 ，确少搭子，2筒是一个边肚子的牌型，只有摸进来25筒才可有用，6778万的进张能力是456789万，2345条的进张能力是1234567条，所以打2筒是最优的打法。"
  },
  {
    "id": 271,
    "cards": "4556m3445667p556s",
    "answer": "5m",
    "tips": "这手牌34筒，67筒是一个二面的搭子，所以这手牌不缺搭子，如果留下5万的进张是34567万，摸进来34567万的任意一张，这首牌变成了6搭牌，还要拆搭子，打掉5万我们可以进258筒一进听牌，如果摸来457条，我们可以把牌改良成一个四人抬轿，所以打掉5万是正确的"
  },
  {
    "id": 272,
    "cards": "12234447m335679p",
    "answer": "2m",
    "tips": "我们是一个靠张一上天的 牌型，打掉靠张能力最弱的牌，7万是中间张可以进56789万听牌，所以不能打，9筒在33567筒的带动下可以进34789筒，跟据麻将口诀， 臭28，打掉2万是最正确的。"
  },
  {
    "id": 273,
    "cards": "2488899m3588999p",
    "answer": "2m",
    "tips": "24万只能摸进来3万才有用，35筒可以进3筒，67筒可以靠张8筒。所以24万的搭子后期改良能力不如35筒。打掉2万是正确的。"
  },
  {
    "id": 274,
    "cards": "2457789p2226778s",
    "answer": "7s",
    "tips": "根据麻将品决，无将拆大 肚，把大肚子牌型7条打掉就可以了。"
  },
  {
    "id": 275,
    "cards": "11157799m5799p13s",
    "answer": "5p",
    "tips": "六搭拆搭，打掉5筒把六搭牌拆成5搭牌，799形成一搭，还可以保留4个对子，后续摸来一个对子，还有做大牌的 机会，打掉五筒是正确的。"
  },
  {
    "id": 276,
    "cards": "3334889m1223467s",
    "answer": "4m",
    "tips": "正确打法应该是打掉4万，如果78万进牌，牌型就变成了一进听牌的牌型，同时也是四人抬轿牌型，如果没有进78万，也可以进1458条也可以快速听胡"
  },
  {
    "id": 277,
    "cards": "25m44455567p1238s",
    "answer": "2m",
    "tips": "这手牌是一个一对三单的牌型，要注意重复进张，如果打8条的话，保留25万来做靠张一上听，3万和4万是重复进张，所以这样的话效率会降低很多，所以像这种一对3单靠张一上听的牌，就不要保留同一门花色的，特别是有重复进张的，所以应该打掉2万，因为5 万的进张能力是比2万要更强的。"
  },
  {
    "id": 278,
    "cards": "1113479p2226678s",
    "answer": "6s",
    "tips": "这手牌正确的打法，应该是打掉六条，把手牌打成无将一上听，四人抬轿的牌型，可以进2345789筒，总共7门28张，减去手牌4张，一共24张进 张机会，比打掉9筒和4筒，多了7张牌的进账机会。"
  },
  {
    "id": 279,
    "cards": "112334m3334p6678s",
    "answer": "3m",
    "tips": "1如果打1万的话，可以进25万，69条，245筒门牌，如果打3万的话，可以进1万，23456筒，456789条总共12门牌。如果打6条，可以进12345万23456筒总共10门牌。如果打4筒，可以进12345万，456789条，总共11门牌。所以应该打3万。"
  },
  {
    "id": 280,
    "cards": "2255578p2245667s",
    "answer": "2s",
    "tips": "这手牌要拆掉两个搭子和两个对子，在听牌时，搭子的效率要比对子高，所以应该在2条和2筒之间做选择，打2筒的话，可以进69筒，58条总共4门牌，打2条的花，可以进69筒，358条总共5门牌，所以这手牌打 掉2条是最佳打法，多进一门3条。"
  },
  {
    "id": 281,
    "cards": "222468m334777p34s",
    "answer": "4p",
    "tips": "根据麻将口诀，一对先定将，因此正确打法应该是打掉4筒，专心 优化条子和万字的搭子"
  },
  {
    "id": 282,
    "cards": "2244m78999p12378s",
    "answer": "4m",
    "tips": "根据麻将口诀，三对拆对，最佳打法应该是二四万所以选C，打四万后，可以碰出二万或者摸进三万都可以听牌六九条，摸进六九条后，也可以胡六九筒摸进六九筒，也可以胡六 九条，并且就算杠了九筒还有一对二万做将。"
  },
  {
    "id": 283,
    "cards": "113557m11234678p",
    "answer": "5m",
    "tips": "正确打法应该是打掉5万，进1筒，1246万总共5门20张，减掉手上的4张，一共16张的进牌机会可以听牌，比打7万多了两张，并且保留了两对三连坎牌型，是最优打法。"
  },
  {
    "id": 284,
    "cards": "888999m335p57889s",
    "answer": "8s",
    "tips": "这手牌把8条拆出来，是一个一对三单的牌型，应该打8条，这样就会有34567筒和34567条的进张听牌机会"
  },
  {
    "id": 285,
    "cards": "222468m334p34999s",
    "answer": "4p",
    "tips": "根据麻将口诀，一对先定将 ，因此正确打法应该是打掉4筒，专心优化条子和万字的搭子"
  },
  {
    "id": 286,
    "cards": "2337m2225667p234s",
    "answer": "2m",
    "tips": "根据麻将口诀，应该一对先定将，这手牌的正确打法应该是打掉2万，因为打掉7万的话，可以进1234万45678筒，总共9门36张，减去手牌7张，还有29张的进牌机会:打掉6筒的话，可以进123456789万，总共9门36张，减去手牌4张，还有32张进牌机会。但是打2万的话，可以进45678筒，356789万，总共11门44张减掉手牌7张 ，还有37张进牌的机会。"
  },
  {
    "id": 287,
    "cards": "2356778m23777p22s",
    "answer": "2m",
    "tips": "这手牌正确打法应该打掉2万，因为打掉2万后可以进469万听牌，而打掉其他的牌，进张只有2门。"
  },
  {
    "id": 288,
    "cards": "355m1234p1225667s",
    "answer": "1s",
    "tips": "首先这手牌的四连牌型和大肚子牌型不能动，因为这种牌型的靠张能力非常强，正确打法应该打掉1条，因为打掉1条后，可以进45万，2356筒，24578条都是有用的 ，所以打掉1条是最高效的打法。"
  },
  {
    "id": 289,
    "cards": "2337m1115667p234s",
    "answer": "2m",
    "tips": "这是手一对三单的牌型，首先六筒是绝对不能打的,因为6筒这边567筒属于一个大肚子牌型，它的靠张能力非常强，摸进四五 筒，或者七八筒都能把它变成一个好搭子，所以这手牌论单张的进张能力，二方肯定不如七方，因为根据麻将口诀金三银七，所以这手牌的正确打法应该是打掉二万，保留六筒和七万，去做一个靠张一上听，摸进45678筒以及碰出三万，摸进56789万，都可以听胡，所以应该打二万。"
  },
  {
    "id": 290,
    "cards": "13556m122234778p",
    "answer": "1p",
    "tips": "这手牌还没 有那么快听牌，考虑打掉哪张不容易损失更多的进张机会，如果打1万，损失两万一门4张的机会，如果打1筒，只损失3筒一门3张的机会，所以这手牌应该打掉1筒。"
  },
  {
    "id": 291,
    "cards": "555m34467p236799s",
    "answer": "6s",
    "tips": "这手牌应该拆搭不拆对，所以要在3筒和6条当中进行选择，当拆牌后影响进牌几率相差不大时，就要考虑后续手牌的优化，因为这手牌留下3筒，还有一个摸进5筒形成五连 顺的几率，所以正确打法应该打掉6条"
  },
  {
    "id": 292,
    "cards": "236899m11124788p",
    "answer": "6m",
    "tips": "手里有6搭牌，需要拆掉一搭，24同或者68万，都是卡张，我们要考虑拆掉一张后，剩下的一张有没有丢失作用，打掉4同，进3同，还是6搭牌。如果打掉6万进7万可以打掉9万变成5搭牌。一上听。"
  },
  {
    "id": 293,
    "cards": "334778m12345788s",
    "answer": "7s",
    "tips": "这手牌的正确打法应该打掉7条，因为打掉7条并不会损失6条的进张，但是打三万或者七万，都会损失较多的进张，所以应该打7条。"
  },
  {
    "id": 294,
    "cards": "223468p34666888s",
    "answer": "2p",
    "tips": "如果打2筒，可以进678筒，1234条，总共7门牌，如果打8筒，可以进256筒，25条，总共5门牌，所以这手牌正确打法应该打掉2筒。"
  },
  {
    "id": 295,
    "cards": "346799p11267999s",
    "answer": "6p",
    "tips": "根据麻将口诀，这是手是六搭拆搭牌型，可能很多人会选打掉二条，打掉二条会丢失三条的进张，并且整手牌依日保留了一个6搭牌型，接下来不管是进张也好碰出也好，还是需要去继续拆掉一搭，因为6搭牌永远有两张废牌，所以说这手牌，应该直接打掉6筒因为打掉6筒，67筒是一个搭子，67筒的能力是进58筒，打掉6筒，既不会丢失8筒的进张，也不会丢失5筒的进张，所以 应该打掉6筒。"
  },
  {
    "id": 296,
    "cards": "123m44789p113577s",
    "answer": "7s",
    "tips": "打7条保留357条的3连坎的进张机会。可进牌为4饼1246条，共20-4=16张进张听牌机会。打1条和7条进 张机会相同，但1条相对碰出机会大一些。打4饼的话，只有来147条才能听牌，进张机会为12-4=8。所以打出7条为最佳选择。"
  },
  {
    "id": 297,
    "cards": "34m3456p23345667s",
    "answer": "3p",
    "tips": "根据丢张最少进张最多原则，打 出36饼。进张机会为134568条，任意一张都可以听牌。进25万也可以听牌"
  },
  {
    "id": 298,
    "cards": "123m5678p5677888s",
    "answer": "5p",
    "tips": "这关考验的是怎么样听牌更宽。abccddd牌型，a不为1和d不为9，可以听4张牌，所以打5饼或8饼，听4769条。为标准4面听牌型"
  },
  {
    "id": 299,
    "cards": "79m22399p2345568s",
    "answer": "8s",
    "tips": "六搭拆搭，打掉8条丢张最少"
  },
  {
    "id": 300,
    "cards": "23345667m6789p78s",
    "answer": "6p",
    "tips": "两个大肚牌型 (2334为大肚牌型)相连叫双翼牌型，进张机会是相当多的，所以不拆万字。打掉69饼。进134568万，69条都能听牌。进张机会有32-6=26张。"
  },
  {
    "id": 301,
    "cards": "234556m67799p678s",
    "answer": "5m",
    "tips": "在手上有两个成牌加3对时，遵循3对拆一对原则，拆有最好搭子的对子。所以拆5万。进张5789饼147万可以听牌，28-6张进张听牌机会。进56789饼，听147万。进147万打7饼听58万。都是很不错的听口。"
  },
  {
    "id": 302,
    "cards": "4556779m1156789p",
    "answer": "9m",
    "tips": "\r\n根据麻将口诀，三队拆一对，打掉9万形成455677万复合牌型进张效率最高，可进367万，147条，6门18张。"
  },
  {
    "id": 303,
    "cards": "1156688m2334568p",
    "answer": "8p",
    "tips": "麻将口诀三对拆一对是在有两搭成牌的情况。这里只有456饼一搭成牌。所以根据丢张最少进张最多原则打出8饼。打8饼没有丢张"
  },
  {
    "id": 304,
    "cards": "345667m12366799p",
    "answer": "6m",
    "tips": "手上有两副成牌时,三对拆对，拆掉带最好搭子的对子。这里打出6万，万子可进张为258万，筒子可以进5689筒，7门28-6=22张进牌机会。摸258万打6筒听58筒。摸5689筒听258万"
  },
  {
    "id": 305,
    "cards": "2467m111p2477999s",
    "answer": "2m",
    "tips": "六搭拆搭原则，为什么拆24万而不是24条，因为拆24条的话，如果来了5万，和78万有重复进张。摸进来3万，再拆24条"
  },
  {
    "id": 306,
    "cards": "11357m233p233444s",
    "answer": "3p",
    "tips": "233444条的牌型靠张能力是最强的，可以进12345条形成两副成牌，所以不能拆。321牌型成将的能 力也是超强的。所以打出3饼。打3饼只损失2张3饼进张。打其他牌丢都至少都是4张"
  },
  {
    "id": 307,
    "cards": "344568m778p11134s",
    "answer": "8p",
    "tips": "一对先定将。打出8饼，进张机会为257万，25条，20张-1=19张进牌机会"
  },
  {
    "id": 308,
    "cards": "2377m56777p45666s",
    "answer": "7m",
    "tips": "456条一搭，66条一搭，567饼一搭，77饼一搭。3对折一对。打出7万只损失2张7万碰的机会。打其他牌损失进张数都大于2张。"
  },
  {
    "id": 309,
    "cards": "13456999m22p4455s",
    "answer": "1m",
    "tips": "这是个进张一上听的牌型，进张概率最大的是36条这就是连队牌型的利用，进36条听36条，而不是拆掉45条来胡卡2万"
  },
  {
    "id": 310,
    "cards": "35567m45789p2267s",
    "answer": "5m",
    "tips": "多搭了需要拆掉一搭只能拆35万卡张搭子，但是先要打5万预防摸回4万"
  },
  {
    "id": 311,
    "cards": "22779m234789p445s",
    "answer": "4s",
    "tips": "三对拆一对，保留质量最好的搭子做为听口"
  },
  {
    "id": 312,
    "cards": "1227778p2233478s",
    "answer": "8p",
    "tips": "根据5搭牌原理如果8饼和7饼组成搭子，进689饼都会变成6搭牌 ，对首牌没有帮助。所以打出8饼，形成5搭牌。进1469条可以听牌。进3饼打2饼，进2饼打1饼，都能形成八门全开的四人抬轿。"
  },
  {
    "id": 313,
    "cards": "1135m22257799p13s",
    "answer": "5m",
    "tips": "6搭拆搭，打出5万，变成5搭牌"
  },
  {
    "id": 314,
    "cards": "2233789m4556788p",
    "answer": "3m",
    "tips": "我们手牌处于一进听 时要考虑有效进张，打掉五筒只能进1234万听口较好，打掉3万可以进124万368筒都可以得到双面听"
  },
  {
    "id": 315,
    "cards": "1377m34579p23788s",
    "answer": "1m",
    "tips": "手上有6搭牌，根据6搭牌原理，拆掉79饼或是13万而1和9的优化能力是最差的。所以先打1万或是9饼"
  },
  {
    "id": 316,
    "cards": "666m345679p46778s",
    "answer": "4s",
    "tips": "这是无将一上听的牌型需要靠对，同时只有四搭牌繁要靠搭改良，所以打掉孤张4条"
  },
  {
    "id": 317,
    "cards": "3477789m45p44599s",
    "answer": "9m",
    "tips": "六搭拆搭，保留好的搭子。所以可打8万和9万，保留7万杠的机会"
  },
  {
    "id": 318,
    "cards": "4467m22356p33356s",
    "answer": "7m",
    "tips": "手上有6搭牌，根据6搭牌的2对拆搭原理，需要拆一个搭子，打7万只损失8万4个进张，拆其他搭子会损失8个进张。"
  },
  {
    "id": 319,
    "cards": "11344789m344567p",
    "answer": "4p",
    "tips": "手上有两副成牌时.三对拆对，拆掉带最好搭子的对筒子可进张为258筒，万子可以进子。这里打出4筒，1245万，7门28-6=26张进牌机会。摸258筒听25万。摸1245万听258筒"
  },
  {
    "id": 320,
    "cards": "2488m123p2466788s",
    "answer": "2s",
    "tips": "打2条，只丢失3条进 张，来57条和3万都可听牌。12-1=11张进张听牌机会。如果打2万，只有来3条可以听牌。只有4张进张听牌机会。"
  },
  {
    "id": 321,
    "cards": "1245667m3566679s",
    "answer": "9s",
    "tips": "这手牌主要分解手牌五搭牌原理，打掉九条既能进听还可以改良优化"
  },
  {
    "id": 322,
    "cards": "4457789m1244p137s",
    "answer": "1p",
    "tips": "金三银七臭二八，保留7条，如果来68条，可以优化成两面搭。打一饼也没有丢张进来3饼依然有用，手上还有5搭牌。"
  },
  {
    "id": 323,
    "cards": "11122234566788s",
    "answer": "8s",
    "tips": "打6条胡258条共12-6=6张胡牌机会，打8条胡1234679条共28-10=18张胡牌机会"
  },
  {
    "id": 324,
    "cards": "11122335677899p",
    "answer": "9p",
    "tips": "这手牌打1筒能听69筒，/但是打掉9筒可以听1234筒所以打掉9筒最佳"
  },
  {
    "id": 325,
    "cards": "1234567m2223444s",
    "answer": "1m",
    "tips": "很多人会选打出3条，胡147万。共12-3=9张胡牌机会但打1万，胡12345条，20-7=13张胡牌机会。而且3个2条和4条对13饼形成了封闭效果。故打1万为正确答案。"
  },
  {
    "id": 326,
    "cards": "1124889m3445689p",
    "answer": "9p",
    "tips": "先拆边搭9筒，边张搭子不具备改良空间"
  },
  {
    "id": 327,
    "cards": "56689m12778p2334s",
    "answer": "9m",
    "tips": "根据丢张最少，进张最多原则，打出9万不丢7万的进张。可进牌有369饼，12345条，467条"
  },
  {
    "id": 328,
    "cards": "2334578m22678p34s",
    "answer": "8m",
    "tips": "一对定将，2饼不能拆。打3万进69万或是25条可以听牌，共16张进张听牌机会。打8万进146万或是25条可以听牌，共20-1=19 张进张听牌机会。比打3条多了3张听牌机会"
  },
  {
    "id": 329,
    "cards": "23778m333p245667s",
    "answer": "8m",
    "tips": "这副手牌很多朋友会选择打掉2条，根据麻将口诀在手牌处于一进听的情况下要一对先定将，应该打八万，这样就会有三条，五条，八条，一万和四万的进张后直接听牌"
  },
  {
    "id": 330,
    "cards": "123888m57889p468s",
    "answer": "8p",
    "tips": "这手牌应该选择打掉8条，因为打8条后整手牌会变成无将一上听，摸进5筒可以听牌，保留三连砍摸进4578条也可以听牌。"
  },
  {
    "id": 331,
    "cards": "11124789p112489s",
    "answer": "4s",
    "tips": "打出4条，进3饼和7条都可以听牌。如果打出4饼，:进了37条可以听牌。听牌机会相同，但是打了4饼，来了3饼相当要拆出一个1饼来做成牌， 丢了杠出机会所以建议打出4条"
  },
  {
    "id": 332,
    "cards": "1233367m668p1156s",
    "answer": "1m",
    "tips": "在这幅手牌中56条与67万都是双面搭，摸进47条，58万就能听牌了，打出8筒，这牌依然是6搭牌，并且会丢失7筒的进张。这副 牌当中，3万就可以组成一副成牌，所以12万的价值是最低的，我们直接打掉因此可以拆掉12万，根据选项则选择打掉一万"
  },
  {
    "id": 333,
    "cards": "345557m34456778s",
    "answer": "7s",
    "tips": "这手牌是大多数新手容易犯错的一个牌型，选择打掉7万，可以进25万，245679条总共8门32张，减去手牌11张， 一共有21张听牌的机会，但是这手牌我们来看看打掉7条之后的进张，可以进234569条，256789万总共12门48张，减去手牌9张，还有39 张进牌机会比打7万效率更高，所以根据进张最多原则·应该选打掉7条。"
  },
  {
    "id": 334,
    "cards": "2345m2234p335667s",
    "answer": "2p",
    "tips": "很多麻友会打掉6条，这种就是典型的凭感觉在打觉得6条没有用，夹在一个顺子里面看不顺眼，但是打了6条就丢了45678条的进张，手牌缺一个搭子就能听牌，要去打2筒，2234是一个边度牌型，它的靠搭能力较弱"
  },
  {
    "id": 335,
    "cards": "1245667m2455568p",
    "answer": "2p",
    "tips": "正确的手牌分解能力是处理这手牌的关键，很多麻友去折12万就是不会分解手牌，分解完发现手牌是一进听，5搭牌已经产了，2筒和8筒是两张孤张，所以可以打掉。"
  },
  {
    "id": 336,
    "cards": "1234m1345679p999s",
    "answer": "1m",
    "tips": "打一万和四万，进张机会为1到9饼均可以听牌。进19饼听258饼，进2饼听147饼，进8饼听369饼。进3饼听卡8饼，进7饼听卡2饼，进4饼打9饼听卡2饼，进6饼打1饼听卡8饼，进5饼打1饼或9饼钓9饼或1饼。进张机会为4*9-7=29张。"
  },
  {
    "id": 337,
    "cards": "22235788p123456s",
    "answer": "7p",
    "tips": "注意手牌的后期改良，打掉7筒，后期如果碰8筒就可以优化成14筒带3筒的三门听口"
  },
  {
    "id": 338,
    "cards": "6679m123789p1334s",
    "answer": "1s",
    "tips": "这手牌有两副成牌，一个对子，三个搭子，打出1条不丢2条进张。但打出9万，表面上没有丢8万进张，但是来8万，6678万，6万的将对破坏了。相当于打了9万，7万也废了，只能进25条听牌。而打出1条，手牌打成两对半，胜率高半。有5门牌进张，进235条，68万都可以听牌"
  },
  {
    "id": 339,
    "cards": "357999m46778p999s",
    "answer": "4p",
    "tips": "打4饼不丢张，进7饼，34678万可以听牌。摸进5689饼，打出3万优化成更好的4人抬轿。摸进7饼打出3万听6万。 摸进4万打7饼听78万。摸进8万打7饼听4万。摸进6万打7饼单钓3万。"
  },
  {
    "id": 340,
    "cards": "13789m3466p34579s",
    "answer": "1m",
    "tips": "分解手牌，一共有6个搭子(分解顺序1成牌=>2对子=>3搭子,成牌:345条，789万,6筒对子 ，34筒，79条，13万)，6搭拆搭，拆13万还是79条?因为7条来了6条可以形成5连型，来了2条可以形成579条的三连坎，优化空间比13万大。所以拆13万，正确答案打出1万"
  },
  {
    "id": 341,
    "cards": "11123456788999s",
    "answer": "1s",
    "tips": "还要打吗···再打不听牌啦··这个牌最正确的选择是倒牌··天胡·谢谢"
  },
  {
    "id": 342,
    "cards": "234599m2334p3334s",
    "answer": "4s",
    "tips": "手牌分解后·三幅陈牌·一对三单··注意搭子的传递功能·3筒大 肚牌型靠搭能力很强·进12345饼，而且1245饼上手都是双面听，万字25万靠搭1234567万都可以听牌，4条靠搭23456条·但是只有3条和5条能形成双面搭··三条手上已经3张··所以打掉靠搭能力最弱的4条最合理，"
  },
  {
    "id": 343,
    "cards": "12336778m788999p",
    "answer": "7p",
    "tips": "打出7饼，8饼做将，进8饼123456789万都可听牌进张机会为40-8-2=30张，进245689万都可以形成双面好听。打3万，进56789万56789饼可听牌，进张机会为40-4-6=30张，进68万才可以形成双面好听，所以打7饼，听口 质量有可能会好一些。打7万和打3万概率相同"
  },
  {
    "id": 344,
    "cards": "3578m3599p234567s",
    "answer": "5m",
    "tips": "6搭拆搭，拆35饼还是35万?35饼来26饼可以优化成两面好搭，35万来2万是两面好搭，来6万和78万组成成牌，所 以6万是重复进张，所以建议拆35万。是打3万还是5万?因为3万进2万是两面好听，5万进6万和78万进张是重复的，所以建议打出5万。"
  },
  {
    "id": 345,
    "cards": "2355999m23778p23s",
    "answer": "2m",
    "tips": "听牌只需要5搭牌，现在 有6搭牌，没有孤张和爆张需要拆一搭。拆2万，只丢失1万的进张。丢张最少进张最多"
  },
  {
    "id": 346,
    "cards": "37m236678p223499s",
    "answer": "2s",
    "tips": "分解手牌，先找出手牌的病症。一共只有4个搭子(分解顺序1成牌=>2对子=>3搭子,成牌:234条，678筒,9条对子，23简,剩下4个单张:37万,2条.6筒)，这手牌的毛病是缺搭子。4个单张(37万,2条,6筒)组搭能力最弱的是2条(金三银七臭二八)，所以打出2条为本局正解。"
  },
  {
    "id": 347,
    "cards": "12378999m224478p",
    "answer": "4p",
    "tips": "六搭牌型，两幅成牌带三对·外加一个双面搭·拆掉4筒·只丢两张4筒·牌型推进成5搭·来三筒24筒可以靠搭·打掉4筒丢张最少·只丢两张4筒，二筒边张对子好碰牌·"
  },
  {
    "id": 348,
    "cards": "112888999p25677s",
    "answer": "2p",
    "tips": "分解手牌·567一副成牌·手牌1对一饼先定将，也可以看成一对三单·我们找出2条7条2 饼中靠搭能力最差的牌处理掉·打2饼后，进123456789条1饼可以听牌机会为40-7=33张。打2条后，摸进1234饼456789条能听牌。机会有36-8=28张机会。打7条后，摸进1234饼1234条可听牌，机会为32-4=28张。对比应该打2饼，摸进来368条，都能形成2面好听。"
  },
  {
    "id": 349,
    "cards": "2333456p2345678s",
    "answer": "2s",
    "tips": "abbbcde这种可以形成单钓三面听 。打258条，听1247饼。有4x4-2=14张进张胡牌机会。而打出2饼听258条有3*4-3=9张进张胡牌机会。所以打258条，进张胡牌机会多了5张。"
  },
  {
    "id": 350,
    "cards": "346799m34899p333s",
    "answer": "6m",
    "tips": "六搭拆搭的牌型打 掉6万不掉张，来258万7筒25筒都是可以优化的"
  },
  {
    "id": 351,
    "cards": "112334p11236999s",
    "answer": "1s",
    "tips": "靠张一上听的牌型，打掉靠张能力最弱的1条"
  },
  {
    "id": 352,
    "cards": "224578m11145899p",
    "answer": "5m",
    "tips": "这手牌最佳打掉5万。如果打掉8筒，这牌依然是六搭牌，并且会丢掉7筒的进张，而打掉5万不会丢张，进来3万可以组成234万，进来6万跟78万可以组成一副成牌，并且打掉5万剩下的4万可以和2万重新组搭，这手牌就改良成五搭牌了，所以应该打掉5万"
  },
  {
    "id": 353,
    "cards": "1112247m2345567s",
    "answer": "4m",
    "tips": "这手牌是一个一对三单的牌型，很明显2345条四连牌型可以进1234567条是不能动的，能选的就是打掉47万其中的一张，打4万进56789万，打7万进23456万，由于自己手上已经有2张二万，所以正确打法应该是打4万。"
  },
  {
    "id": 354,
    "cards": "111357m345p23346s",
    "answer": "6s",
    "tips": "打出26条都可以形成一进听牌型。打2条，进5条46万可以听牌，进张机会为12，都是听卡张。打6条，进张机会为3条23467万可以听牌，进张机会为24-4=20张进张机会。摸进6万可以听23万。并且打6条，保留了大肚牌型的手牌优化能力，摸1245条，打出7万形成四人抬轿，进张机会更多。"
  },
  {
    "id": 355,
    "cards": "113478m333p23667s",
    "answer": "4m",
    "tips": "打掉4万只丢5万的进张，拆其他任何搭子都丢两门的进张。"
  },
  {
    "id": 356,
    "cards": "2356778m22888p22s",
    "answer": "2m",
    "tips": "六搭拆搭，以不丢张少丢张为原则，打掉2万会丢掉1万的进张，如果打掉78万，会丢失69万的进张，损失更大所以这手牌应该打掉2万"
  },
  {
    "id": 357,
    "cards": "33389m223p345699s",
    "answer": "9m",
    "tips": "牌局前期·36条一打··打成一进听·但是听牌大概率会边7万·所以前 期我们要选择拆89万·手牌3456条4连牌型改良空间很大·我们摸来2547条都可以预留双面听的改良·如果牌局中后期我们才会优先选择 打掉36条·保证最大的听牌率"
  },
  {
    "id": 358,
    "cards": "22m2356778p22888s",
    "answer": "2p",
    "tips": "根据5搭牌原理的6搭拆搭原则以及2对拆搭原则，不打2万和2条，所以在23饼和78饼做选择。打78饼会丢69饼进张，打2饼只丢1饼进张。根据丢张最少进张最多原则，所以打出2饼为最佳答案"
  },
  {
    "id": 359,
    "cards": "23378m2478p22899s",
    "answer": "2p",
    "tips": "搭子多了，必须拆掉一搭，只有拆24筒卡张搭子，先打边张，保留中心张。"
  },
  {
    "id": 360,
    "cards": "46788m111p345689s",
    "answer": "4m",
    "tips": "打掉4万最高效·这个牌4万的作用是靠搭5万·9条的作用是靠搭7条·打4万不丢5万·打9条也不丢7条·但是如果我们打掉4万保留9条·摸来7条之后打出8万·我们可以得到369条的 三面听·打掉9条保留4万摸来5万·还是要去打掉47万·"
  },
  {
    "id": 361,
    "cards": "12344467m113557p",
    "answer": "7p",
    "tips": "两对拆搭。因为二对拆对的话，损失了两个碰牌机会。打出7饼，进1245饼，58万都可以听牌。进张机 会为20张，而且进1245饼，都能形成两面好听口。打5饼，进46饼，58万都可以听牌，进张机会为16张。"
  },
  {
    "id": 362,
    "cards": "334779p12366789s",
    "answer": "3p",
    "tips": "这手牌应该打掉3筒。此牌是典型的三对牌型，三个对子两幅成牌，所以根据三对拆一对原则 ，拆掉好成牌的对子，留下不好成牌的对子去碰牌，组牌，所以拆掉3筒有较大概率可能胡25筒的口子，如果拆掉7筒就会胡到卡8筒的口 子上，所以这牌应该打掉3筒"
  },
  {
    "id": 363,
    "cards": "13445667m466678p",
    "answer": "4p",
    "tips": "打出4饼，进2458万(进2万打6万，胡4万和69饼，进5万打1万，形成258的好叫口)，进69饼都可以听牌，进张听牌机 会为6*4-8=16张，而且增加了4万的碰出机会"
  },
  {
    "id": 364,
    "cards": "6777m455679p2388s",
    "answer": "6m",
    "tips": "判断搭子价值，打掉6万保留的搭子进张都能听牌"
  },
  {
    "id": 365,
    "cards": "24567m67889p3578s",
    "answer": "3s",
    "tips": "这手牌也是6搭 牌。缺对子。67889饼是肯定不能打的。因为可进张为5到9万。所以我们能打的是在35条，24万中间选择一张。由于4万可以和567万形成4连牌型，所以只能打35条。打3条还是5条，5是78条的衍牌，缺对和缺搭子不打衍牌(本局是缺对)。所以只能打3条。"
  },
  {
    "id": 366,
    "cards": "4467m1235688p789s",
    "answer": "7m",
    "tips": "7万和5筒中做选择· 我们要注意手牌后期的优化·打掉7万·如果摸来3万·可以得到34万和56饼的两 个双面搭·但是打掉5筒· 我们摸来9饼·是一张无效牌·因为8饼的边张对子改良空间很差·所以打掉7万更合理"
  },
  {
    "id": 367,
    "cards": "223m23567p245667s",
    "answer": "3m",
    "tips": "一对定将· 打掉3万"
  },
  {
    "id": 368,
    "cards": "4567m3345p246678s",
    "answer": "3p",
    "tips": "打掉3饼·手牌打成无将一上听·"
  },
  {
    "id": 369,
    "cards": "4456m344588p3456s",
    "answer": "4m",
    "tips": "根据麻将口决，有将拆大肚，无将拆边度，直接打掉四饼，我们的正确打法是打掉4万，这手牌，我们有对子，缺的是好的搭子，如果我们打掉4饼，我们只能进3万5万才能形成双面搭子听牌，最后我们很大根率会听在3条6条的单掉将牌上面，留下4饼我们可以进25饼，36饼四门牌，而且听口质量都不错。"
  },
  {
    "id": 370,
    "cards": "1234789m3446p455s",
    "answer": "4s",
    "tips": "虽然打掉6饼，我们不丢5饼的进章，但是打掉6饼，我们就失去了一进听牌的机会，留下6饼我们才能保证手牌五搭牌的完整性，我们要先把牌定型再去做改良，所以六饼不能打，14万也不能打，留下14万，我们可以123456万6门牌，去做优化改娘，摸进123456万任意一张再打6饼，如果我们留下4条，摸来36 条也听不了牌。五搭牌只有一个对子且一进听牌的时候，果断先定将。所以正确打法是打掉4条。"
  },
  {
    "id": 371,
    "cards": "134577m36667889s",
    "answer": "8s",
    "tips": "典型的一对三单，一万位数边有345万，考虑到搭子的传递功 能，一万的靠张有，1236万，共四门牌。3条，在1万，3条，8条里面靠张能办是最强的，所以这手牌的正确打法是打掉8条，8条的靠张是6789条，我们有三个六条，八条最好的靠搭是摸7条，听69条，其它的都是胡卡张，而69条我们手上已经就4张，所以我们正确打法是打掉8条，"
  },
  {
    "id": 372,
    "cards": "55667m45p2377789s",
    "answer": "4p",
    "tips": "77789条这种牌，如果我们有其它的对子，我们考虑拆掉89条，但这手牌，55667万，我们要看成567跟56万二门牌，也就是说，7条开了杠我们没有其它的对子，影响了手牌的推进，那么这手牌，77条就是一对定将，55667这种牌型进张非常多，56万不能打，我们能拆的就是45饼遗照 23条，早拆中间，晚拆边，在麻将前期我们打掉45饼，在麻将后期看桌面的张再决定拆，23条或45饼 。大家要灵活运用。"
  },
  {
    "id": 373,
    "cards": "2257789m1244p379s",
    "answer": "1p",
    "tips": "6搭拆搭，打掉3条，我们还是6拆牌，而且3条后续优化成力非常强，所以3条不能打，这手牌正确打法是打掉1饼，打1饼不丢3饼。并且预 留了好的进张空间。"
  },
  {
    "id": 374,
    "cards": "113445667p45678s",
    "answer": "6p",
    "tips": "正确打法是打掉6饼，我们会形成14饼的二对半牌型，比留下14饼的二对 半，更大机会碰出或进张。"
  },
  {
    "id": 375,
    "cards": "5688m345779p4478s",
    "answer": "4s",
    "tips": "根据六搭拆搭，很多朋友会选择打掉5万，但是这手牌如果打掉5万，我们很大概率会听在卡七万卡8筒或二对倒的叫口上，9饼也不 能打，打9筒，我们不仅还是6搭牌，还会丢掉4张8筒的进张机会，如果碰了四条，或碰了7饼，或碰了8万，我们还是要拆一个对子，打9 饼我们没有把牌打成进一步，是把牌打成了退二步，所以9饼不能打，我们的正确打法是打掉4条，打4条我们只丢二张4条的进张，8万边 张牌型，比四条要容易碰出，所以我们留下八万的对子，这手牌的正确打法是打掉4条，朋友们，如果有得选择，我们一定要把牌听成好 的叫口，这样我们才能更容易胡牌。"
  },
  {
    "id": 376,
    "cards": "12337m112378p245s",
    "answer": "7m",
    "tips": "这手牌我们不缺搭子，缺的是对子，所以我们打留下摸对能力，找将能力强的牌，打掉1筒，我们会丢掉二张一筒，四张4 筒一共六张牌，2条也不能打，我们进2条有2条的对子加45条的一个搭子，进5条我们有5条的对子，还有24条的搭子，进3条我们能形成2345条的四连牌型，麻将口决缺将缺搭留四连，四连牌形找将摸搭能力是极强的，所以二条也不能打，3万也不能打，摸3万，3万一个对子 加一个123万一副成牌，摸2万摸1万，都可以形成二对牌牌形，二对半的牌形进张数量非常多，麻将口廖，无将牌形打闲不打琏，所以这 手牌我们打掉7万是正确的。"
  },
  {
    "id": 377,
    "cards": "3457788m2334566s",
    "answer": "7m",
    "tips": "这手牌很多朋友会打掉36条，我们的有效进张是147条碰3碰6条，共5门15张进张数量，但打掉36条，我们只有碰出7万或者8八共4 张牌，我们的听口才能听在147条上面，所以打掉36条我们90%的机会进来147条然后听在七万八万的对倒胡上，所以这手牌我们的正确打 法是打掉7万，我们有6门牌的进张听在双面掿，我们可以摸69万听14条，摸14条听69万，碰8万碰6条都可以听14条，所以打7万我们100% 的概率听在双面搭上，打掉36条我们90%的概率会听在对倒胡上，所以我们的正确打法是打掉7万"
  },
  {
    "id": 378,
    "cards": "678m2337p3336778s",
    "answer": "2p",
    "tips": "一对三单，上张一上听的牌，打掉靠张能力弱的牌，6778条，大肚牌型 ，进5689条都可以形成二面搭，所以七条，不能打，金三银七臭二八，也符合一对定将，这手牌的正确打法，打掉2筒"
  },
  {
    "id": 379,
    "cards": "223489m12233478p",
    "answer": "9m",
    "tips": "打二万组成四人抬桥，但打掉2万，90%概率会胡在单吊89万或卡7万的叫口上，而我们打掉9万，100%的机会会形成双面听的叫口。进258万，胡69饼，进69饼胡二五万。所以正确打法是打掉9万"
  },
  {
    "id": 380,
    "cards": "2244489m4567p223s",
    "answer": "9m",
    "tips": "8圈之前打掉89万，二进听牌，能形成好的叫口，在牌局后期打掉47饼，强行一进下叫，我们讲的是 起手拿到这样一手牌，所以正确打法是打掉9万。"
  },
  {
    "id": 381,
    "cards": "2245m1112357p899s",
    "answer": "2p",
    "tips": "打8条不仅丢掉7条进章，牌也还是六搭牌，没有把牌打进一步，打五万会丢掉六万的进张，打七筒会丢掉6筒 进章，打掉2筒，不丢14筒，把手牌打成了五搭牌，所以正确打法是打掉2筒"
  },
  {
    "id": 382,
    "cards": "23667888m344568s",
    "answer": "7m",
    "tips": "在我们一进可以听牌的时候，我们一对先定将，正确打法是打掉 7万，可以进14万，257条，形成双面搭叫口。"
  },
  {
    "id": 383,
    "cards": "12378m222p113557s",
    "answer": "7s",
    "tips": "打三条丢24条，打一条丢了一五条的碰巧出，找五条也是同样丢15条的碰出，打掉7条我们只丢掉6条的进张。正确打法是打掉7条 ，把手牌形成超级二对半。麻将口诀，打成二对半，胜率高一半。"
  },
  {
    "id": 384,
    "cards": "11123m5779p23456s",
    "answer": "5p",
    "tips": "打五筒丢6筒，打9筒丢8筒，所以我们正确打法是打掉5筒，我们有23456的五连牌形，不需要留5筒做改良，5筒的中章牌比9筒安全，而且779筒形成半封闭牌形，卡8筒比卡6筒要容易胡牌，五七卡六神仙难救。"
  },
  {
    "id": 385,
    "cards": "335678m23555667s",
    "answer": "5m",
    "tips": "这手牌打掉五八万可以形成二对半牌形一进听牌，这手牌我们不需要改良牌形，所以正确打法是打掉五万中章牌。对手不容易碰出，8万边张牌别人比较容易碰出。所以直接打掉5万。"
  },
  {
    "id": 386,
    "cards": "2389m1115689p246s",
    "answer": "9m",
    "tips": "这手牌是六搭牌形，缺对子不确搭子，所以我们要留下靠对能力强的搭子，所以正确打法是打掉9万。56，89筒虽然有重复进张7筒，但如果我们摸进来7筒可以形成56789筒摸对能力最强的五连牌型，摸进5689四张牌任意一张都形成一个对子加一个成牌。所以9饼是肯定不能打的，打二万都比打9饼强，所以打9万是丢张最少的。"
  },
  {
    "id": 387,
    "cards": "3478m22678p24456s",
    "answer": "4s",
    "tips": "我们优先打掉4条，可以预留3条的进章，形成一个三面搭子。就算没有摸进来3条，我们进了25万，69万，再打2条。高手打麻将的思维，走一步，看三步，朋友们打麻将我们要灵活运用。"
  },
  {
    "id": 388,
    "cards": "2334566m3457788p",
    "answer": "7p",
    "tips": "打3六万可以进147万，碰3万或碰6万，5门15张牌听牌在78筒对倒胡的叫口，打三六万，我们只有碰78筒4张牌，才可以听到147万的叫口，所以打36万，我们80%的概率会湖对倒胡，这就是我们经常听牌很早但胡不了牌的原因，如果我 们打掉7筒，我们可以进69筒，碰八筒，碰6万，听14万，进14万，碰6万，听69筒，也就是掉我们打掉7筒，100%的概率我们可以听到双面搭的叫口。所以正确打法是打掉7筒，"
  },
  {
    "id": 389,
    "cards": "3334579m2246999s",
    "answer": "6s",
    "tips": "9万肯定不能打，打9万我们会丢失超级二对半的牌形，打4万不仅会丢掉2条3万的碰出，我们的终听口会落在卡5条，卡6 万，卡8万的叫口上。我们打掉6条，可以进2条，3条，进3六万，进8万一共五门牌的进张，打六条，如果摸来8万，我们可以听2条，36万，三面听，所以正确打法是打掉6条。"
  },
  {
    "id": 390,
    "cards": "4567m455699p5567s",
    "answer": "5s",
    "tips": "有将打边肚，无将拆大肚，我们的 正确打法是打掉5条。"
  },
  {
    "id": 391,
    "cards": "113557m12378p333s",
    "answer": "7m",
    "tips": "一对定将，二对拆搭，打五万的朋友一定是想着一对先定将。但我们这手牌是二对，所以我们要拆搭，这手牌，直接打掉7万是正确的。11355万形成超级二对半，可以进12345万五门牌， 听69饼的双面搭。所以正确打法是打掉7万"
  },
  {
    "id": 392,
    "cards": "236778m4567p5677s",
    "answer": "7m",
    "tips": "有将拆边肚，无将打大肚，我们直接打掉7万就可以了。"
  },
  {
    "id": 393,
    "cards": "333789m3356p5688s",
    "answer": "6p",
    "tips": "这手牌，只能在五条跟6筒之间去打掉一张，打五条，丢四条，打6筒丢7筒。为什 么打6筒是正确的。因为打6筒我们摸进来2筒，可以改良成14万，还打5条，我们摸进来9条没有改良的空间。所以正确打法是打掉6筒"
  },
  {
    "id": 394,
    "cards": "4567m2255589p223s",
    "answer": "9p",
    "tips": "虽然打掉47万， 我们可以一进听牌，但我们很大概率会听边7饼的叫口，所以在麻将的前期，我们要拆掉这个89筒，保留更好听口的机会，但如果在麻将的后期， 也就是8圈之后我们一定是打掉47筒，先强行听牌才就可能胡牌。我们讲的是起手拿到这样一手牌，我们应该是打掉98筒是正确的。"
  },
  {
    "id": 395,
    "cards": "3456m3456999p999s",
    "answer": "3p",
    "tips": "打3筒我们摸进来7筒，傍边的9筒可以承接，可以胡47筒卡8筒。多胡四张8筒的机会。"
  },
  {
    "id": 396,
    "cards": "22457p123368999s",
    "answer": "7p",
    "tips": "策略打法:6、8条可以叫牌不 能打如果保留7同会有6同的有效牌重复问题，所以打掉7同。技巧:两面搭子会降低周边单张牌的改良能力，通常考虑打掉。"
  },
  {
    "id": 397,
    "cards": "3444789m2333778p",
    "answer": "7p",
    "tips": "这首牌如果打八筒，丢69筒的两门8张牌 进张，而且听牌听口质量大概率不好，应该打掉这张7同更合理，打七同只丢两张7同，进张百分百会是双面听，莫来六9同还是三面听。"
  },
  {
    "id": 398,
    "cards": "677m13888p222334s",
    "answer": "6m",
    "tips": "三二一牌型可进张数太多了，可以进12345条，形成两搭 成牌。保持一进听牌。我们不能去拆掉。所以这手牌的正确打法是打打出6万，可以进7万，2饼，12345条，共7门20张进牌机会。打13饼 会变成两进听。打7万就是23条必须做将，损失了三二一牌型进12345条的进张机会。打4条，进张机会是58万2饼，3门12张进牌机会。比 打6万少了8张进张要会。所以正确打法是打掉6万"
  },
  {
    "id": 399,
    "cards": "1135m22257799p13s",
    "answer": "5m",
    "tips": "这手版的正确打法是打掉5万，6搭拆搭，打出5万，变成5搭牌，只丢4万的进张，打其它的任何牌，我们 还是6搭牌。"
  },
  {
    "id": 400,
    "cards": "233556779m45788s",
    "answer": "7s",
    "tips": "这手版的正确打 法是打掉7条，23万做一搭，567万做一搭，剩下3579万4连坎，全手牌只剩一对将。根据麻将口诀一对先定将，所以打出7条。"
  },
  {
    "id": 401,
    "cards": "46m11145688p3578s",
    "answer": "5s",
    "tips": "六搭拆搭的牌型，需要拆掉一搭 形成5搭牌，78条不能拆，我们能拆的是46万和35条。46万进37条可以改良成双面好搭，35条进26条可以改良成双面好搭，6条跟78条有重复的进张，因此拆35条。打出5条，摸2条，可以形成23条双面好搭，摸6条我们78条能接。所以正确的打法是打掉5条"
  },
  {
    "id": 402,
    "cards": "2245678m2356778s",
    "answer": "2s",
    "tips": "这手牌，我们不缺对，也不缺好搭，听牌 只需5搭牌，现在是6搭牌，需要拆一搭，拆任何搭子都会丢张。但是拆23条，打出2条，只丢1条进张。来4条我们可以456条，778条，形 成两对半牌型，还拆78条，我们会丢69条的进张，所以这手牌我们打掉23条是正确的。丢张最少，进张最多。"
  },
  {
    "id": 403,
    "cards": "35688m6789p11677s",
    "answer": "9p",
    "tips": "这手牌的正确打法是打掉69筒，有朋友打3万，刚好5搭，但如果我们保留3万，来了4万可以345万组成成牌，688万组成搭子，打出7条，手牌变成两对半(打成两对半听牌效率高一半)，对手牌起到了优化作用。而如果打3万保留69饼，进来了569饼，对手牌也并没有改进作用(已经不缺两搭，也不缺将对)"
  },
  {
    "id": 404,
    "cards": "455567m13445667s",
    "answer": "4m",
    "tips": "这手牌的正确打法是打掉4万，虽然1条好 像完全没什么作用，但是我们反向思维一下，如果打出1条，那么5万是不是必须做将，于是4万就是一张废牌，既然是废牌，所以干脆打 出4万，保留1条还可以进12条。因此打出4万为正确答案。"
  },
  {
    "id": 405,
    "cards": "678m22466p246999s",
    "answer": "2s",
    "tips": "这手牌的正确打法是打掉2条，首先4饼不能打，打4饼会丢35饼2门进张。打26条只丢失1门进张。打出2条，摸近来37条可以优化成两面搭，所以打2条是最正确的打法。"
  },
  {
    "id": 406,
    "cards": "3334m6667p234778s",
    "answer": "7s",
    "tips": "根据丢张最少，进张最多原则，打出七条，进张为5678饼，2345万，69条，可进张数为40-8=32张，打7条是最正确的打法。"
  },
  {
    "id": 407,
    "cards": "345689p11146778s",
    "answer": "4s",
    "tips": "这手牌的正确打 法是打掉4条，这手牌我们缺对子，也缺搭子。表面上看9饼没有什么，但保留9饼，摸进来369饼都可以组成对子还有一副成牌，我们缺搭子，所以要留下6778这个大肚牌型，可以进568条，都可以形成好的搭子，所以这手牌打掉4条就可以了。"
  },
  {
    "id": 408,
    "cards": "788m234p22234677s",
    "answer": "7s",
    "tips": "这手牌的正确答案 是打掉7条，这手牌我们有两副成牌，3个对子。三对拆对，拆掉带好搭子的对子，我们拆打8万或7条的对子都可以形成好的搭子，相对来说，8万碰出机会比7条更大一点，所以这手牌我们打掉7条就可以了。进689万258条都可以听牌，且听口质量都不错"
  },
  {
    "id": 409,
    "cards": "789m24556p124567s",
    "answer": "2p",
    "tips": "这手牌的正确答案是打掉2饼，这手牌呢是 典型的无将一上听牌型。有朋友们们可能在想打1条不丢3条，但如果打掉1条，我们进47条不能一进听牌的。所以在25饼中间选。打2饼不丢3饼进张，打5饼丢567饼进张。这手牌我们需要理解成：无将1上听，打闲不打连(1条是24567条相连的牌)，我们缺将缺搭不打衍（ying)牌(1条是24条的衍牌)"
  },
  {
    "id": 410,
    "cards": "2446m3557p123788s",
    "answer": "2m",
    "tips": "这手牌的正确打法是打掉两万，这手牌主要考虑后续优化。一个成牌(123条)，3个对子(4万，5饼，8条)，缺一个搭子，如果把对子拆开比如35饼一搭，57饼一搭，刚好5搭牌。打26万，37饼都是有丢张。2万周边的牌是13万，摸进来1万是个边张搭。其他牌摸进来周边牌都 是两面好搭，所以建议打出2万。(金三银七臭二八)"
  },
  {
    "id": 411,
    "cards": "3788m1226p135889s",
    "answer": "9s",
    "tips": "这手牌的正确打法是打掉9条，手牌只有4个搭子。缺搭子保留组搭能力最强的中张牌，所以6饼3万不能打，只能在1饼和9条之间选。表面上好像1饼和9条是一样的，但考虑打出9条，摸进7条可以和5条组成卡6条的搭子，勉强可以算作5搭牌(打1 饼摸进3饼，还是4搭牌)所以考虑后续进张可能性，这手牌应该打出9条。"
  },
  {
    "id": 412,
    "cards": "444555m579p12235s",
    "answer": "2s",
    "tips": "这手牌的正确打法是打掉2条，这手牌我们缺对子，579饼为连坎牌型我们不打。1223条为大肚牌型。5条为孤张。我们用2条来靠搭子，可进张机会为1234条，4门12张，而且只有3条摸进来才能行成两面搭子。留5条可进张 机会为34567条，5门18张，摸 46条都可形成两面搭。多6张进张机会和多5张两面听的机会。所以打2条是这手牌的正确打法。"
  },
  {
    "id": 413,
    "cards": "1367999m3334789s",
    "answer": "3m",
    "tips": "这手牌呢我们打掉13万，进245条，一万或者3万，58万都可以形成双面好听，共6门24张减去手上2张还剩下22张。打4条的话，虽然也是4人抬轿，进张机会为1235678万，共7门28张进张机会减去手上4张还剩24张。但是只有进123万，才能形成双面搭的听口。所以这手牌，我们打掉13万的进牌数量与听口质量比打掉4条要好太多，我们要知道我们能不能听牌不是取决于听牌的早不早，要取决于听牌的质量好不好，所以这手牌拆掉13万就可以了。"
  },
  {
    "id": 414,
    "cards": "3445889m3447p114s",
    "answer": "7p",
    "tips": "这手牌3445万分解为34万和45万，变成两搭。889万为一搭，344饼为一搭，11条为一搭，这样刚好组成5搭。剩下7饼和4条两个孤打7饼还是4条呢?假如留7饼，我们的344饼进的5饼跟7饼有重复进张。而留下4条，不会 产生重复进张问题。所以这手牌打掉7饼效率最高。"
  },
  {
    "id": 415,
    "cards": "46778m111p345689s",
    "answer": "4m",
    "tips": "首先这手牌9条不能打，因为这手牌我们摸来9条的对子也可以听牌，来了7条，可以优化成369条三面听。所以在4万和7万中间选择。有朋友说，无将拆大 肚(6778万为大肚牌型)确实留下4万比7万多一张进张机会，但是为了考虑后续优化改良，打出4万有利于后续手牌的优化。打出4万比打7 万少一门进张，但我们进5689万可以优化手牌。让听口质量更好。所以这手牌我们打四万最正确。"
  },
  {
    "id": 416,
    "cards": "2334578m2244467p",
    "answer": "8m",
    "tips": "六搭拆 搭，我们要拆一个搭子。拆23万丢14万，拆67饼丢58饼，拆78万只丢9万进张，根据丢张最少，进张最多原则，所以打出8万为最优秀的打法。而且打掉8万，能摸来3万，我们还可以把手牌改变成二对半，多了一个2筒的碰出，所以正确打法是打掉8万。"
  },
  {
    "id": 417,
    "cards": "2245889p1112357s",
    "answer": "2s",
    "tips": "六搭拆搭，打出2条，我们把手牌推进成了5 搭牌，我们也没有丢14条的进张，来了1条可以杠，来4条我们35条能接，不要舍不得打，我们打牌的最终目的是为了听牌也胡牌，不是为了牌形好看。这手牌打掉2条，就是我们最高效的打法。"
  },
  {
    "id": 418,
    "cards": "56689m12778p2334s",
    "answer": "9m",
    "tips": "这手牌是一个西巴烂的牌，缺好的搭子 ，那么这个2334条大肚牌型肯定不能去打掉，根据丢张最少，这进张最多原则，打出9万，不丢7万的进张。可进牌有369饼，12345条，467万。看起来的烂牌我们也不要放弃，这手牌我们打掉9万，如果能摸进来3饼或者7万，牌就不差了，进12345条，进69饼，都是好牌，看 起来的西巴烂的牌，我们只要能进一个好章，我们的牌就好了。由期我们湖南，广东，打红中飞的麻将，再怎么样的烂牌我们也不要乱打，不要把心态打乱了，心态好了，牌自然就顺了。"
  },
  {
    "id": 419,
    "cards": "567999m12333445s",
    "answer": "9m",
    "tips": "打9万胡25条，胡牌机会为6张。打5条胡34条，胡牌机会为3张。打14条胡36条，胡牌机会为5张，打3条，胡14条，胡牌机会为8-3=5。所以这手牌，我们打掉9万胡6张牌，是这手牌的最正确打法。"
  },
  {
    "id": 420,
    "cards": "34555m78999p3378s",
    "answer": "3s",
    "tips": "这手牌可以看成是6搭牌的三对拆一对。打出3条只损失3条 碰出机会。打5万会损失25万，打9饼会损失69饼。所以这手牌的正确打法是打掉三条。我们打出3条，进25万69条69饼均可以听牌。进张 数量为4门24张-6=18张的进张机会"
  },
  {
    "id": 421,
    "cards": "3457m2456p234778s",
    "answer": "8s",
    "tips": "应该打掉8条，保留7万和2筒，因为7万可以进256789万听牌，2筒可以进12347筒听牌，留8条会降低效率，所以正确打法应该打八条。"
  },
  {
    "id": 422,
    "cards": "2348m25p33344456s",
    "answer": "2p",
    "tips": "这手牌是一个一对三单的牌型，要注意重复进张，如果打8万的话，保留25筒来做靠张一上听，3筒和4筒是重复进张，所以这样的话效率会降低很多，所以像这种一对3单靠张一上听的牌，就不要保留同一门花色的，特别是有重复进张的，所以应该打掉2筒，因为5筒的进张能力是比2筒要更强的。"
  },
  {
    "id": 423,
    "cards": "22m234678p445588s",
    "answer": "5s",
    "tips": "这手牌应该保留8条对子，因为靠边的对子比较容易牌，同时要尽量保留45条的搭子作为后续的听牌牌型，所以应该拆掉45条的 对子，正确打法应该打掉5条，因为5条比4条有更大的概率，消耗对方更多的中心牌，可以从最中心的序数牌部位，破坏别人手牌的关联 能力，从而降低别人创造多连顺,多门进牌的机会"
  },
  {
    "id": 424,
    "cards": "45m3444567p34567s",
    "answer": "3p",
    "tips": "如果打3筒，进2345678条，3456万都可以听牌，总共11门。如果打4万进5万，258条，2358筒都可以听牌总计8门。因此这手牌打3筒才是最佳打法。"
  },
  {
    "id": 425,
    "cards": "22268m677888p556s",
    "answer": "6s",
    "tips": "这 手牌应该直接打掉6条，保留321复合牌型，这样就有进张5条，7万和56789筒，都可以听，进口数量最多"
  },
  {
    "id": 426,
    "cards": "566m56999p233457s",
    "answer": "5m",
    "tips": "在我们一进可以听牌的时候，我们一定是一对先定将，所以这手牌应该打掉5万。可以进47筒，146条，一共5门牌。都可以一进听牌。"
  },
  {
    "id": 427,
    "cards": "22488999m335678s",
    "answer": "4m",
    "tips": "这手牌坎搭的进牌效率不如对子，28万都是属于边张牌型，容易碰出，所以这手牌要留对子，那么就要拆坎搭中的4万，5条和8条，但是58万是四连順中的一部分，后续有比较大的优化机会，所以这手牌应该打4万。"
  },
  {
    "id": 428,
    "cards": "2346m3567p111556s",
    "answer": "6s",
    "tips": "应该打掉6条，保留6万和3筒，因为6万可以进145678听牌，3筒也是同样的效率，可以进123458筒听牌，留6条会降低效率 ，所以正确打法应该打6条。"
  },
  {
    "id": 429,
    "cards": "123789m579p33577s",
    "answer": "9p",
    "tips": "这手牌的正确打法，应该把它打成-个两对半的牌型，直接打掉五筒或 者九筒，可以保留条子这边的跳对3连坎可碰3条，可进4条，可碰7条，可进卡6筒或者卡8筒，共是5门20张，所以正确打法是打掉9筒，留下五筒，后续可以优化改良"
  },
  {
    "id": 430,
    "cards": "22456m556p344555s",
    "answer": "5p",
    "tips": "大部分人可能会选择打掉3条，但是如果打3条的话，进张是457筒，4条和2万，总共5门20张，减去手牌6张，还有14张进牌机会。如 果打掉4条的话进张数也差不多。所以这里正确的打法是打掉5筒，保留条子的321复合型牌型进张是2万，47筒，23456条，总共是8门32张， 减去手牌8张，还有24张进牌"
  },
  {
    "id": 431,
    "cards": "113445667m34567p",
    "answer": "6m",
    "tips": "首先这手牌是一进听的状态，打掉4万和6万都可以一进听胡，但是打4万的话，对手打出1万的概率就会比较小，但是打6万的话，就不存在这种情况无论是碰1万还是碰4万，都可以直接听牌，所以正确打法应该是打6万。"
  },
  {
    "id": 432,
    "cards": "11134899m113467s",
    "answer": "4s",
    "tips": "这手牌是一个标准的6搭牌，不丢张或者丢张最少的把手牌处理成5搭牌，正确打法应该打4条，因为打4条不会损失25条的进张，而打其他牌，都会损失进张。"
  },
  {
    "id": 433,
    "cards": "22278m344568p344s",
    "answer": "3s",
    "tips": "根据麻将口诀，一对先定将，正确打法应该先打掉3条，可以进69万和257筒听牌"
  },
  {
    "id": 434,
    "cards": "1123468m1113579p",
    "answer": "9p",
    "tips": "这手牌如果打掉8万的话，只能进48筒，如果打掉9筒的话，可以进7万，46筒，所以正确打法应该是先打掉9筒把手牌先打成三连坎，然后再调整机会看看1万能不能碰出，如果碰出的话，打掉7筒，就可以把手牌打成一个超级四人抬轿，可以进678万，2345筒听牌，所以应该打9筒。"
  },
  {
    "id": 435,
    "cards": "34m3456667p45678s",
    "answer": "7p",
    "tips": "如果打7筒，可以变成一个超级四人抬轿，进3456789条，2345万都可以听牌，总共11门。如果打4万进3万，369条，2578筒都可以听牌总计8门。因此这手牌打7筒才是最佳打法。"
  },
  {
    "id": 436,
    "cards": "246788p23555777s",
    "answer": "8p",
    "tips": "如果打8筒,形成一个4人抬轿牌型，可以进234筒，1234条总共7门牌，如果打2筒，可以进458筒，14条，总共5门牌，所以这手牌正确打法应该打掉8筒。"
  },
  {
    "id": 437,
    "cards": "5556777p2345678s",
    "answer": "5s",
    "tips": "如果打掉6筒，选听258条的话，总共是3门12张，减去3张重复，一共有9张牌的一个胡 牌机会，正确打法应该是打掉258条其中一张，可以听45678筒五门牌，五门20张减去手上的7张，一共有13张的进张机会，比打6筒听258条进张要多"
  },
  {
    "id": 438,
    "cards": "36667889m335679s",
    "answer": "8m",
    "tips": "这副牌我们应该打掉8万。此牌是典型的四搭牌,一对三单，缺搭子，我们需要靠张能力强的单牌重新去组搭子，这手牌3万肯定不能打，金三银七臭28，这手牌在8万和9条中间去选择，8万可以摸6789万，9条可以摸4789条，但是我们手上已经有7张6789万了，所以这手牌直接打掉这个8万就行"
  },
  {
    "id": 439,
    "cards": "1226899p1245667s",
    "answer": "1s",
    "tips": "可能很多人会选择打掉6筒，不仅变成5搭牌，而且进7筒也不丢张，但是这样打就会剩下一对8万做将，有效进张就只有358条了。所以更优秀的打法应该是打1条，后面不论是进3条还是进58条，都可以把牌型打成两对半的牌型，胜率会比打6筒更高，所以正确打法应该是打1条"
  },
  {
    "id": 440,
    "cards": "2467899m1113579p",
    "answer": "9p",
    "tips": "这手牌如果打掉2万的话，只能进48筒，如果打掉9筒的话，可以进3万，46筒，所以正确打法应 该是先打掉9筒把手牌先打成三连坎，然后再调整机会看看九万能不能碰出，如果碰出的话，打掉7筒，就可以把手牌打成一个超级四人抬 轿，可以进234万，2345筒听牌，所以应该打9筒。"
  },
  {
    "id": 441,
    "cards": "23m2345568p22788s",
    "answer": "8p",
    "tips": "可以看到这手牌是一个6搭牌，如果打掉8条的话，会丢失8条的碰张，而且整手牌依然有6搭牌，如果打7条的话会丢失69条的进张。正确的打法应该是打掉8筒，因为打掉8筒后，没有丢失7筒的进张依旧有234筒和556筒可以保留7筒的进张，并且将手牌调整为了5搭牌。"
  },
  {
    "id": 442,
    "cards": "223677p22356789s",
    "answer": "3s",
    "tips": "根据麻将口诀，三对拆一对是在有两副成牌的情况下，才去做三对拆一对没有两幅成牌3对也可以不拆对，应该打掉一个搭子，这手牌如果打3筒的话，会丢失14筒的进张，打掉6 筒会丢失58筒的进张，打掉三条只会丢失一个一条的进张，所以应该打三条。"
  },
  {
    "id": 443,
    "cards": "1226899p3445689s",
    "answer": "9s",
    "tips": "这手牌很多朋友选择打掉6筒，打掉6筒，不仅变成5搭牌，而且进7筒也不丢张，但是这样打的话，就会剩下一对2筒做将，有效进张就只有257条了。所以更优秀的打法应该是打打9条，打掉9条之后，不论是进7 条，还是进25条，都可以把牌型打成两对半的牌型，打掉9条，胜率会比打更高，所以正确打法应该是打9条。"
  },
  {
    "id": 444,
    "cards": "445588m44p234567s",
    "answer": "5m",
    "tips": "这手牌应该保留8万对子，因为靠边的对子比较容易碰牌，同时要尽量保留45万的搭子作为后续的听牌牌型，所以应该拆掉45万的对子，正确打法应该打掉5万，因为5万是中心牌，比4 万有更大的概率消耗对方更多的中心牌，破坏别人手牌的关联能力，从而降低别人创造多连顺，多门进牌的机会，为什么不打4筒，首 先，打掉4筒我们丢了4筒的碰出，如果我们能进35筒，是不是还要打掉5万？所以这手牌的正确打法是打掉5万。我们不影响进36万的进 张，还多了4筒的碰出，也预留了进35筒听25筒和36筒的机会。"
  },
  {
    "id": 445,
    "cards": "123788p22566789s",
    "answer": "9s",
    "tips": "这是一个三对拆一对的牌型，2条肯定不能去拆，我们有788筒，566条二个好的对子加搭子，如果拆2条，我们就失去了把牌打成2对半的机会，打掉2条，我们是把牌打倒退2步，所以这手牌我们应该在788筒 和566条之间进行拆对，如果打掉6条，可以进247条689筒，总共6门24张减去手上5张牌还剩19张，如果打8筒呢，可以进2467条，69筒，总共也是6门19张牌， 考虑到8筒对子比6条对子更好碰出，所以应该拆566条的搭子，由于手牌有566条可以和789条连起来，在实战中呢，我们要看海里面有什 么牌，如果海里有6条我们就打6条，有9条我们就打9条"
  },
  {
    "id": 446,
    "cards": "33567m778p555667s",
    "answer": "7p",
    "tips": "三对拆对牌型，应该打7筒，只是会失去碰7筒的机会，但是换来的是进3万，69筒，45678条一共八门牌，一进就可以听牌，打7筒效率最高"
  },
  {
    "id": 447,
    "cards": "34456m5666p23456s",
    "answer": "5p",
    "tips": "这手牌的正确打法应该是打掉5筒，可以让手牌成为一个超级四人抬轿的牌型，可以进234567万，1234567条，一共13门52张牌，减去手上的10张，一共有42张进牌就听牌的机会"
  },
  {
    "id": 448,
    "cards": "12345788m778p334s",
    "answer": "7m",
    "tips": "这是一个三对牌型，有朋友想着三对拆一对，但是三对拆一对是在有二副成牌的情况下才是三对拆一对，这手牌的正确打法应该打掉7万，因为打掉7万并不会损失6万的进张 ，但是打三条或者七筒，都会损失较多的进张，所以应该打7万"
  },
  {
    "id": 449,
    "cards": "1223478m1122367s",
    "answer": "1m",
    "tips": "分解手牌，看成两幅成牌123条，234万，剩下4个搭子，12条，67条，12万，78万中间拆一个，那肯定从12条或者12万之间拆掉一搭，所以正确打法应该是打掉1万，后续无将时，留12条还可以碰一对，留一对做将。"
  },
  {
    "id": 450,
    "cards": "3445689m1226899p",
    "answer": "9m",
    "tips": "可能很多人会选择打掉6筒，不仅变成5搭牌，而且进7筒 也不丢张，但是这样打就会剩下一对2筒做将，有效进张就只有257万了。所以更优秀的打法应该是打9万，后面不论是进7万还是进25万，都可以把牌型打成两对半的牌型，胜率会比打6筒更高，所以正确打法应该是打9万。"
  },
  {
    "id": 451,
    "cards": "34567m45567p3444s",
    "answer": "3s",
    "tips": "这手牌是一个典型的4人抬轿牌型，正确打法应该是打掉3条形成4人抬轿，可以进345678筒2345678万，一共13门52张牌，减去手上的10张，共有42张进牌就听牌的机会。"
  },
  {
    "id": 452,
    "cards": "3567m334999p2346s",
    "answer": "4p",
    "tips": "应该打掉4筒，保留6条和3万，因为6条可以进145678条听牌，3万也是同样的效率，可以进123458万听牌，留4筒会降低效率，所以正确打法应该打4筒。"
  },
  {
    "id": 453,
    "cards": "123m345699p34466s",
    "answer": "4s",
    "tips": "正确打法应该是打掉4条，可以进256条，24579筒一共8门，并且下叫听牌的质量也是比较高的，但是如果打36筒的话，后期很有可能会听在9筒和6条的对倒胡上。"
  },
  {
    "id": 454,
    "cards": "11334678m233456p",
    "answer": "3p",
    "tips": "根据麻将口诀，这手牌属于三对拆一对牌型 ，如果打掉3万，那么碰出1万或者碰出3筒的情况下，只能打掉2筒听在25万上面，但是如果打掉3筒的话，无论是碰出13万还是进张25万 ，都可听在147筒上面，胡牌的几率会更大，所以正确打法应该是打掉3筒。"
  },
  {
    "id": 455,
    "cards": "22889m2478p34467s",
    "answer": "2p",
    "tips": "根据麻将口诀，六搭拆搭小技巧就是将手牌不丢张或者丢张最少处理成5搭牌，由于这手牌没有满足3对拆对条件，所以这手牌正确打法应该是打2筒，打掉2筒丢张最少，并且手牌处理成了5搭牌。"
  },
  {
    "id": 456,
    "cards": "11134899p346799s",
    "answer": "6s",
    "tips": "一手非常典型的6搭拆搭牌型，正确打法应该打6条，因为打6条不会损失58条的进张，并且将手牌处理成了5搭牌，而打其他牌，都会损失进张。"
  },
  {
    "id": 457,
    "cards": "889m1223378p2223s",
    "answer": "3s",
    "tips": "这手牌保留3条是没有价值的，因为3条的能力是摸进14条，但是这手牌摸进1条，也得把1条打掉，因为它搭子的价值，不如二三筒和78筒，摸进4条也得把它打掉，所以说这手牌保留3条在手上没有任何的能力，所以打掉3条，有机会勾出2条开杠，并且保留九万的话，摸进七万打八万，可以改良成一个加强带碰的4人抬轿。"
  },
  {
    "id": 458,
    "cards": "12234445m456679s",
    "answer": "2m",
    "tips": "这手牌应该打掉2万，可以摸进58条，摸369条，356万都能听牌，有8门32张减去手上的6张一共有26张的听牌机会，比打掉9条多了7张，提升了40%左右的听牌速度"
  },
  {
    "id": 459,
    "cards": "67m24488p2377789s",
    "answer": "9s",
    "tips": "这手牌保留89条的搭子是没有任何作用的，正确打法应该是打掉9条，如果打掉2筒的话不仅会损失3筒的进张，而且仍然有6搭牌，还是需要拆掉搭子。所以应该打掉9条。"
  },
  {
    "id": 460,
    "cards": "345778m11p355567s",
    "answer": "7m",
    "tips": "根据麻将口诀，三对拆一对的情况，正确打法应该是打掉七万，如果打3条的话，可以进1筒679万，58条，总共6门24张，减掉手上的7张，还有17张牌的进牌机会，同时也丢失了4条的进张，打7万的话，可以进1筒69万，458条总共也是6门24张，减掉手上的5张，还有19张的进牌机会，比打掉3条多了2张，并且七万是一个中张牌而且手上有一对，被别人碰出的概率并不高，所以应该打掉七万。"
  },
  {
    "id": 461,
    "cards": "4457m334999p4557s",
    "answer": "7s",
    "tips": "这手牌应该优先打掉重复进张面的牌，需要在7万和7条之间做一个选择，需要注意的是后续如果碰了4万那57万依然可以组成一个搭子，但是如果碰了5条剩下的47条就会变成散牌，所以正确打法应该打掉7条。"
  },
  {
    "id": 462,
    "cards": "6667m677899p5567s",
    "answer": "7p",
    "tips": "这手牌的正确打法应该是打7筒,打5条可以进56789筒56789万，一共10门，打7万可以进345678条，56789筒，一共11门，打7筒可以进345678条，56789万还有9筒一共12门"
  },
  {
    "id": 463,
    "cards": "12367799m234556p",
    "answer": "5p",
    "tips": "根据麻将口诀，这手牌属于三对拆一对牌型，如果打掉7万，那 么碰出9万或者碰出5筒的情况下，只能打掉6筒听在58万上面，但是如果打掉5筒的话，无论是碰出79万还是进张58万，都可听在147筒上 面，胡牌的几率会更大，所以正确打法应该是打掉5筒。"
  },
  {
    "id": 464,
    "cards": "34m222468p334777s",
    "answer": "4s",
    "tips": "根据麻将口诀，一对先定将，因此正确打法应该是打掉4条，专心优化筒子和万字的搭子"
  },
  {
    "id": 465,
    "cards": "45m23555p2345678s",
    "answer": "2s",
    "tips": "这手牌应该打掉258条其中一张，打出去后就成了无将一上听四人抬轿牌型，四人抬轿就是保留3副成 牌，外加两个两面搭，这时候两个搭子的周边，摸进3456万，1234筒都可以听牌，总共8门32张，减去手牌的4张，还有28张的一进听牌机会。"
  },
  {
    "id": 466,
    "cards": "246788m34666999p",
    "answer": "8m",
    "tips": "这手牌也是一个四人抬轿的牌型，很简单，只要打成四人抬轿就是最大进张数量，直接打掉这个8万形成四人抬轿牌型"
  },
  {
    "id": 467,
    "cards": "345m2225667p3778s",
    "answer": "8s",
    "tips": "一对三单，靠张一上听的牌，打掉二万就可 以了，5667筒这个大肚牌型，大肚牌型靠搭能力很强，可以进4578筒，都可以型成双面搭，金三银七臭二八，且8条傍边有一对7条的将牌，所以这手牌，我们最高效率的打法，就是打掉这个8条，"
  },
  {
    "id": 468,
    "cards": "355799p22345789s",
    "answer": "5p",
    "tips": "正确打法应该是打掉5筒，进2条，4689筒总共5门20张，减掉手上的4张，一共16张的进牌机会可以听牌，比打3筒多了两张，并且保留了两对三连坎牌型，是最优打法。"
  },
  {
    "id": 469,
    "cards": "22357888m234678p",
    "answer": "3m",
    "tips": "这手牌打掉一张后直接听牌，考虑到后续改良可能性，正确打法应该打掉3万，如果后续再进2万，就可以改良成7888万，听3门的牌型."
  },
  {
    "id": 470,
    "cards": "124588m368p45688s",
    "answer": "1m",
    "tips": "这手牌正确打法 应该先打1万，不影响3万的进张，并且可以创造优化手牌的机会，因为有两个进单张的边搭和坎搭，其中边搭是所有搭子里最不容易进张的搭子，会拖慢手牌进牌效率，所以应该打1万。"
  },
  {
    "id": 471,
    "cards": "112456668p35777s",
    "answer": "2p",
    "tips": "这手牌的正确打法应该是打2筒，因为打8筒会丢失7筒的进张，打2筒并不会丢失3筒的进张，并且可以进4条，367筒听牌。"
  },
  {
    "id": 472,
    "cards": "1245667m1226899p",
    "answer": "1m",
    "tips": "可能很多人会选择打掉6筒，不仅变成5搭牌，而且进7筒也不丢张，但是这样打就会剩下一对2筒做将，有效进张就只有358万了。所以更优秀的打法应该是打1万， 后面不论是进3万还是进58万，都可以把牌型打成两对半的牌型，胜率会比打6筒更高，所以正确打法应该是打1万。"
  },
  {
    "id": 473,
    "cards": "345699m123p44667s",
    "answer": "6s",
    "tips": "正确打法应该是打掉6条，可以进458条，23679万一共8门，并且下叫听牌的质量也是比较高的，但是如果打36万的话，后期很有可能会听在4条和9万的对倒胡上。"
  },
  {
    "id": 474,
    "cards": "677m23477p555667s",
    "answer": "7m",
    "tips": "三对拆对牌型，应该打7万，只是会失去碰7万的机会，但是换来的是进7筒，58万，45678条就可以听牌的牌型。一共是最高效率的八门牌进张效率"
  },
  {
    "id": 475,
    "cards": "1234567m23666p78s",
    "answer": "1m",
    "tips": "这手牌应该打成无将一上听，也就是打掉147万其中的一张，条子可以进6789条，筒子可以进1234筒，总共8门32张， 减去手上4张，还有28张进牌机会，像这种手上没有将，打掉手里的孤章，保留双搭做四人抬轿是最大几率打法。"
  },
  {
    "id": 476,
    "cards": "456677p23334567s",
    "answer": "7p",
    "tips": "正常情况下都会打47筒，虽然同样是听58筒，但建议打7筒，首先保持出牌安全性，因为7筒有一对，4筒只是单张，这样打7筒相对不容易被碰，其次保持序数牌延伸优势，打7筒后，后续如果来3筒或者8筒，再打出6筒，手牌就可以优化成34567或者45678的五连顺听三门，这叫做时刻要保持优化自己的进口质量"
  },
  {
    "id": 477,
    "cards": "234678m22357888s",
    "answer": "3s",
    "tips": "这手牌打掉一张后直接听牌，考虑到后续改良可能性，正确打法应该打掉3条，如果后续再进2条，就可以改良成7888条，听3门的牌型。"
  },
  {
    "id": 478,
    "cards": "1223467p3478899s",
    "answer": "1p",
    "tips": "分解手牌，看成两幅成牌789条，234筒，剩下4个搭子，34条，89条，12筒，67筒中间拆一个，那肯定从89条或者12筒之间拆掉一搭，所以正确打法 应该是打掉1筒，后续无将时，留89条还可以碰一对，留一对做将。"
  },
  {
    "id": 479,
    "cards": "22257799m13p1135s",
    "answer": "5s",
    "tips": "打掉5条的话，我们可以进56789万，12条，2筒，共8门牌，可以把手牌打成一进听，打掉5条，只会丢掉一个4条的进 张，可以保留113条跟577万，两对半的牌型，两对半牌型的价值，比这个4人抬轿，比321复合牌型的价值都要高，我们还可以保留一个做大户的机会，3个对子带一个杠的牌型，我们有一个做龙7对的机会"
  },
  {
    "id": 480,
    "cards": "67m34777p3456789s",
    "answer": "3s",
    "tips": "这手牌是一个四人抬轿牌型，打掉369条哪一张都能打成一个四人抬轿，这个时候可以根据牌池中出现的什么牌就跟打，如果牌局的早期就打掉9条，中后期如果还没出来9条就可以打掉36条，防守一下9条"
  },
  {
    "id": 481,
    "cards": "3444m225667p3456s",
    "answer": "3m",
    "tips": "这个牌型不缺对子，缺的是搭子，很明显36条不能打，所以只能在3万和6筒之间选择，5667是一个大肚子的复合型牌型，可以4578筒都可以形成很好的双面搭，但是3万只能摸来24万形成双面搭，并且手上还有3个4万，所以进口质量不如6筒，直接打掉3万就行了"
  },
  {
    "id": 482,
    "cards": "11245999p235688s",
    "answer": "5s",
    "tips": "这首牌是六搭牌型，且有二个对子，打掉5条 没有丢失147条的进张，打掉25筒没有做到六搭拆搭，正确打法是打掉5条。把整手牌打成了五搭牌，也没有丢失7条的进张。"
  },
  {
    "id": 483,
    "cards": "789m355799p11345s",
    "answer": "5p",
    "tips": "正确打法应该是打掉5筒，进1条，4689筒总共5门20张，减掉手上的4张，一共16张的进牌机会可以听牌，比打3筒多了两张，并且保留了两对三连坎牌型，是最优打法。"
  },
  {
    "id": 484,
    "cards": "44688m579p234678s",
    "answer": "9p",
    "tips": "这手牌的正确打法，应该把它打成一个两对半的牌型，直接打掉五筒或者九筒，可以保留万子这边的跳对3连坎可碰4万，可进57万，可碰8万，可进夹6筒或者夹8筒，共是5门20张，减去手上4张，还有16张进张机会，由于9筒是属于边张牌型，改良几率较低，所以应该保留57筒进行改良，打掉9筒。"
  },
  {
    "id": 485,
    "cards": "233444678p33488s",
    "answer": "3s",
    "tips": "这里正确的打法是打掉3条，保留筒子的三连坎牌型 ，进张是258条，12345筒，总共是8门32张，减去手牌8张，还有24张进牌。"
  },
  {
    "id": 486,
    "cards": "234556m23677899s",
    "answer": "7s",
    "tips": "根据麻将口诀，两对拆搭，正确打法应该直接打掉7条，把手牌打成一个两对半的 牌型，打掉7条后，进张可以是14条，碰9条，进147万，碰5万，比打掉五万多了两门牌的进张效果。"
  },
  {
    "id": 487,
    "cards": "34578p233456778s",
    "answer": "3s",
    "tips": "这手牌的正确打法应该是打掉37条，可以进12456789条6789条，一共12门48张牌，减去手牌9张还有39张进牌机会，比打掉28条多了20张的进张机会。并且只有打掉37条才能打成一个超级四人抬轿的牌型"
  },
  {
    "id": 488,
    "cards": "3477889m2223889p",
    "answer": "3p",
    "tips": "这手牌能打的只有39筒，并且效果都是一样的，可以进2569万听牌，既然效果是一样的，那么就要去考虑后续的改良空间，如果打掉9筒的话，摸进134筒对整手牌都没有任何的改良，都需要拆搭，所以这手牌正确打法应该是打掉3筒，摸进78筒，可以把手牌改成四人抬轿牌型。"
  },
  {
    "id": 489,
    "cards": "22257799m13p1135s",
    "answer": "5s",
    "tips": "根据麻将口诀，六搭拆搭应该优先打五条，因为如果打一筒的话，首先会丢失二筒的进张，并且如果摸进二条的话，整手牌会非常难处理，所以应该打五条"
  },
  {
    "id": 490,
    "cards": "556m23466p333445s",
    "answer": "5m",
    "tips": "三对拆对牌型，应该打5万，保留321的复合型牌型，打掉5万只是会失去碰5万的机会，但是换来的是进6筒，47万，23456条就可以听牌的牌型。一共是最高效率的八门牌进张效率"
  },
  {
    "id": 491,
    "cards": "33778m2345568p45s",
    "answer": "8p",
    "tips": "可以看到这手牌是一个6搭牌，如果打掉78万的话，会丢失69万或者7万的碰张，而且整手牌依然 有6搭牌，正确的打法应该是打掉8筒，因为打掉8筒后，没有丢失7筒的进张，依旧有234筒和556筒可以保留7筒的进张。"
  },
  {
    "id": 492,
    "cards": "3778m3445999p345s",
    "answer": "8m",
    "tips": "这手牌是一个典型的一对3单的牌型，哪张牌靠搭能力差，直接打掉对应的牌即可，这手牌的正确打法应该是打掉8万，金三银七臭二八，这个8万属于边张牌型，直接打掉就行了"
  },
  {
    "id": 493,
    "cards": "33m2356778p34999s",
    "answer": "2p",
    "tips": "这手牌6搭拆搭不丢张或者丢张最少，这手牌正确打法应该打掉2筒，因为打掉2筒后只会丢失一门1筒的进张，不会丢失4筒的进张，而打掉其他的牌， 最少丢失2门进张"
  },
  {
    "id": 494,
    "cards": "234556m23677899s",
    "answer": "7s",
    "tips": "根据麻将口诀，两对拆搭，正 确打法应该直接打掉7条，把手牌打成一个两对半的牌型，打掉7条后，进张可以是14条，碰9条，进147万，碰5万，比打掉五万多了两门 牌的进张效果。"
  },
  {
    "id": 495,
    "cards": "788m234p22566789s",
    "answer": "9s",
    "tips": "这手 牌应该在788万和566条之间进行拆对，如果打掉8万，可以进2467条，69万，总共6门牌19张牌，如果打6条，进张也是6门19张牌:考虑到8万对子比6条对子更好碰出，所以应该拆566条搭子，但是由于手牌有789条可以和566条连起来，所以打掉9条，才是最正确最安全的打法。"
  },
  {
    "id": 496,
    "cards": "22256899m346799s",
    "answer": "6s",
    "tips": " 正确打法应该打6条，因为打6条不会损失58条的进张，而打其他牌，都会损失进张。"
  },
  {
    "id": 497,
    "cards": "2457m444678p3445s",
    "answer": "4s",
    "tips": "根据麻将口诀，有将打边肚，无将打大肚，这手牌确将牌，我们留下2457万，进234567万任意一张，一进听牌。所以这手 牌的正确打法是打掉这张4条。"
  },
  {
    "id": 498,
    "cards": "67m245667p455888s",
    "answer": "4s",
    "tips": "根据麻将口诀，一对先定将，正确打法应该先打掉4条，可以进58万和358筒听牌。"
  },
  {
    "id": 499,
    "cards": "23555888p223468s",
    "answer": "2s",
    "tips": "这手牌最高效的打法就是打成一个四人抬轿的牌型，打掉2条就形成了4人抬轿，打掉2条最为高效"
  },
  {
    "id": 500,
    "cards": "223677m12345788s",
    "answer": "7s",
    "tips": "根据麻将口诀，三对拆一对是在有两副成牌的情况下，才去做三对拆一对，没有两幅成牌3对也可以不拆对，应该打掉一个搭子，让这手牌三个对子保持更高的变通性，这手牌如果打3万的话，会丢失14万的进张，打掉6万会丢失58万的进张，打掉7条只会丢失一个9条的进张，所以应该打7条。"
  },
  {
    "id": 501,
    "cards": "12345699p113557s",
    "answer": "5s",
    "tips": "这手牌如果打掉7条，有效进张是5门20张减去手牌6张，还有14张牌的进张机会 ，同时也保留了3对在手上这明显是不对的:这手牌我们有两幅成牌，根据麻将口诀，三对拆一对，正确打法应该是打掉5条，保留了条子 的四连坎，可进246条，碰9筒和1条，一共是5门20张，减去手牌4张，一共有16张牌的进张机会"
  },
  {
    "id": 502,
    "cards": "124588m368p45688s",
    "answer": "1m",
    "tips": "这手牌正确打法应该先打1万，不影响3万的进张，并且可以创造优化手牌的机会，因为有两个进单张的边搭和坎搭，其中边搭是所有搭子里最不容易进张的搭子，会拖慢手牌进牌效率，所以应该打1万 。"
  },
  {
    "id": 503,
    "cards": "122m3477889p2223s",
    "answer": "3s",
    "tips": "正确打法应该是打掉3条，如果23万进牌，牌型就变成了一进听牌的牌型，同时也是四人抬轿牌型，如果没有进23万，也可以进2568筒也可以快速听胡。"
  },
  {
    "id": 504,
    "cards": "1225788m1245667s",
    "answer": "1s",
    "tips": "可能很多人会选择打掉5万，不仅变成5搭牌，而且进6万也不丢张，但是这样打就会剩下一对2万做将，有效进张就只有358条了。所以更优秀的打法应该是打1条 ，后面不论是进3条还是进58条，都可以把牌型打成两对半的牌型，胜率会比打5万更高，所以正确打法应该是打1条。"
  },
  {
    "id": 505,
    "cards": "245667m999p23778s",
    "answer": "8s",
    "tips": "根据麻将口诀一对先定将，应该打八条，这样就会有三万，五万，八万，一条和四条的进张后直接听牌"
  },
  {
    "id": 506,
    "cards": "4678m233777p3457s",
    "answer": "2p",
    "tips": "应该打掉2筒，保留4万和7条，因为4万可以进234569万听牌，7条也是同样的效率，可以进256789条听牌，留2筒会降低效率，所以正确打法应该打2筒。"
  },
  {
    "id": 507,
    "cards": "4568m455789p3567s",
    "answer": "4p",
    "tips": "分析牌型后， 这手牌是一对三单的牌型，要注意单张的靠张能力以及改良能力，4筒的进张是23456筒，4568万的进张是36789万，但是如果摸来7万是可以听到一个3面听，有较好的改良空间，所以这手牌打掉4筒。"
  },
  {
    "id": 508,
    "cards": "235688m345p45889s",
    "answer": "5m",
    "tips": "根据麻将口诀，六搭拆搭，无论打8条还是9条之 后手上还是6搭牌，所以需要把牌型尽快打成5搭牌型正确打法是应该打掉5万，因为5万是一个眼牌，688万可以进7万，23万可以进4万，所 以这张5万是没有多大作用的，应该直接打掉。"
  },
  {
    "id": 509,
    "cards": "11134778m346799p",
    "answer": "6p",
    "tips": "正确打法应该打6筒，因为打6筒不会损失58筒的进张，而打其他牌，都会损失进张。"
  },
  {
    "id": 510,
    "cards": "11345m244688p678s",
    "answer": "4p",
    "tips": "正确打法应该是打掉4筒，进1万，3578筒总共5门20张，减掉手上的4张，一共16张的进牌机会可以听牌，比打2筒多了两张，并且保留了两对三连坎牌型，是最优打法。"
  },
  {
    "id": 511,
    "cards": "1223367m889p4445s",
    "answer": "5s",
    "tips": "正确打法应该是打掉5条，如果进牌78筒，牌型就变成了一进听牌的牌型，同时也是四人抬轿牌型，如果没有进78筒，也可以进1458万也可以快速听胡。"
  },
  {
    "id": 512,
    "cards": "135m22466p234678s",
    "answer": "1m",
    "tips": "这手牌的正确打法，应该把它打成一个两对半的牌型，直接打掉1万或者5万，可以保留筒子这边的跳对3连坎可碰2筒，可进35筒，可碰6筒，可进夹2万或者夹4万，共是5门20张，减去手上4张，还有16张进张机会，打掉一万可以保留手上35万进行改良搭子，所以这手牌直接打掉1万。"
  },
  {
    "id": 513,
    "cards": "233444678p33488s",
    "answer": "3s",
    "tips": "这里正确的打法是打掉3条，保留筒子的三连坎牌型，进张是258条，12345筒，总共是8门32张，减去手牌8张，还有24张进牌。"
  },
  {
    "id": 514,
    "cards": "234556m23677899s",
    "answer": "7s",
    "tips": "根据麻将口诀，两对拆搭，正确打法应该直接打掉7条，把手牌打成一个两对半的牌型，打掉7条后，进张可以是14条，碰9条， 进147万，碰5万，比打掉五万多了两门牌的进张效果。"
  },
  {
    "id": 515,
    "cards": "233456778m23567p",
    "answer": "3m",
    "tips": "这手牌的正确打法应该是打掉37万，都可以打成一个超级四人抬轿的牌型，可以进12456789万1234筒或者12345689万和1234筒，一共12门48张牌，减去手牌9张还有39张 进牌机会，比打掉28万多了20张的进张机会。"
  },
  {
    "id": 516,
    "cards": "1344789m1367p246s",
    "answer": "1m",
    "tips": "这副牌是典 型的六搭拆搭牌型，因此可以打掉1万，剩下一张3万可以上靠4万，并重新组成一副五搭牌牌型。"
  },
  {
    "id": 517,
    "cards": "56667889p134456s",
    "answer": "8p",
    "tips": "这手牌应该打掉8筒，可以摸进25条听457筒，摸进147条听牌，摸进457筒听牌，有8门32张减去手上 的6张，一共有26张的听牌机会，比打掉1条多了7张，提升了40%左右的听牌速度。"
  },
  {
    "id": 518,
    "cards": "2337m1115667p234s",
    "answer": "2m",
    "tips": "这是手一对三单的牌型，首先六简是绝对不能打的，因为6筒这边567简属于一个大肚子牌型，它的靠张能力非常强,摸进四五筒，或者七八简都能把它变成一个好搭子，所以这手牌论单张的进张能力，二万肯定不如七万，因为根据麻将口诀金三银七，所以这手牌的正确打法应该是打掉二万，保留六筒和七万，去做一个靠张一上听， 摸进45678筒以及碰出三万，摸进56789万，都可以听胡 ，所以应该打二万。"
  },
  {
    "id": 519,
    "cards": "78m23666p1234567s",
    "answer": "1s",
    "tips": "这手牌应该打掉147条其中一张，打出去后就成了无将一上听四人抬轿牌型，四人抬轿就是保留3副成牌，外加两个两面搭，这时候两个搭子的周边，摸进6789万，1234筒都可以 听牌，总共8门32张，减去手牌的4张，还有28张的一进听牌机会。"
  },
  {
    "id": 520,
    "cards": "78899m3399p13678s",
    "answer": "8m",
    "tips": "这手牌优先考虑拆掉89万，留下13条，因为89万进3张，13条进4张，而且89万周边的关联牌，已经占用了3张，相对而言，别人手里就少了一些需要进89万的搭子或者对子，所以应该选打掉八万。"
  },
  {
    "id": 521,
    "cards": "2334789p1114778s",
    "answer": "8s",
    "tips": "这副手牌打8条最佳。这是典型的四搭牌，缺搭子，所以我们需要靠张能力强的单牌重新去组搭子，然后再用到我们经常说到的口诀， 有将打边肚，无将打大肚，8条相对于4条和3筒的靠搭能力最弱，所以这手牌需要打掉8条。"
  },
  {
    "id": 522,
    "cards": "2334m234888p3568s",
    "answer": "3m",
    "tips": "这手牌的正确答案是打掉3万，我们可以把手牌打成无將一上听，4人抬轿的牌型，条子进345678条，六门牌任何一张都可以听牌"
  },
  {
    "id": 523,
    "cards": "3334889m1223367s",
    "answer": "4m",
    "tips": "这副牌最优是打掉4万。因为打9万，留下4万，来了25万，3万就 要成对子了，但这副牌不缺对子，所以来了25万也是废牌，并且我们打掉9万会丢失7万的进张，打4万，摸进78万，67条，34万就形成4人抬轿。或者进1458条也可以下叫去听牌，所以这副牌应该打掉4万。"
  },
  {
    "id": 524,
    "cards": "2457789p2226778s",
    "answer": "7s",
    "tips": "根据麻将口决，无将拆大肚，把大肚子牌型7条打掉就可以了。"
  },
  {
    "id": 525,
    "cards": "2255578p2245667s",
    "answer": "2s",
    "tips": "这手牌要拆掉两个搭子和两个对子，在听牌时，搭子的效率要比对子高，所以应该在2条和2筒之间做选择，打2筒的话，可以进69筒，58条总共4门牌，打2条的花，可以进69筒，358条总共5门牌，所以这手牌打 掉2条是最佳打法，多进一门3条"
  },
  {
    "id": 526,
    "cards": "1244789m1367p246s",
    "answer": "1p",
    "tips": "首选，26条不能打好，打掉2六条牌不能更进一步我们根据6搭拆一拆的原理，我们要拆掉丢张 最少进张最多的拆子，13筒的搭子跟67筒的搭子有重复的进张，所以进确的打法是打掉 1或3 筒。"
  },
  {
    "id": 527,
    "cards": "1234789m3446p455s",
    "answer": "4s",
    "tips": "虽然打掉6饼，我们不丢5饼的进章，但是打掉6饼，我们就失去了一进听牌的机会，留下6饼我们才能保证手牌五搭牌的完整性，我们要先把牌定型再去做改良，所以六饼不能打，14万也不能打，留下14万，我们可以123456万6门牌，去做优化改娘，摸进123456万任意一张再打6饼，如果我们留下4条，摸来36 条也听不了牌。五搭牌只有一个对子且一进听牌的时候，果断先定将。所以正确打法是打掉4条"
  },
  {
    "id": 528,
    "cards": "23355789m114567p",
    "answer": "3m",
    "tips": "正确打法应该是打掉3万，可以进145万，13568筒一共8门，并且下叫听牌的质量也是比较高的，但是如果打47筒的话，后期很有可能会听在1筒和5万的对倒胡上"
  },
  {
    "id": 529,
    "cards": "23566788m445667s",
    "answer": "6m",
    "tips": "打掉8万的话，6条他就成了一张废牌，4条要做将牌，23万跟这边的56万他有重复进张，所以这个牌型我们打掉6万呢，会更加高效"
  },
  {
    "id": 530,
    "cards": "112m2245p1112357s",
    "answer": "2s",
    "tips": "根据六搭拆搭原理，拆搭的原则就是拆掉丢张少或者说不丢张的牌，首先这里打掉2万肯 定是不明智的,因为打掉2万，手里还是6搭牌，打掉7条之后，我们会丢6条的进张，打掉5筒，虽然说手牌可以被打成5搭，但是丢了6筒的进张，所以正确打法应该是打掉2条，保留2条的作用是进14条，打掉后，也不会丢失14条的进张。"
  },
  {
    "id": 531,
    "cards": "222388m11145889p",
    "answer": "3m",
    "tips": "这手牌很简单，直接打掉3万就可以了，留下3万来14万会多出二张二万，还要三对拆一对，没有必要9筒也不能打会丢掉7筒的进张，很简单的牌型"
  },
  {
    "id": 532,
    "cards": "2333m3456p116778s",
    "answer": "2m",
    "tips": "打7条，进14万乘二对牌，不能一进听牌，36筒更加不能打，3456筒的四连牌型，可以进12345678再筒，进56789条都可以听牌，所以正确打法是打掉2万，二万的有效进张只有14万，进了14万你牌型变成2对，不能一进听牌，进其它的张还是要打掉2万。所以正确打法是打掉2万。"
  },
  {
    "id": 533,
    "cards": "2337m1115667p234s",
    "answer": "2m",
    "tips": "根据麻将口诀，应该一对先定将，这手牌的正确打法应该是打掉2万，因为打掉7万的话，可以进1234万，45678筒，总共9门36张，减去手牌7张，还有29张的进牌机会;打掉6筒的话，可以进123456789万，总共9门36张，减去手牌4张，还有32张进牌机会。但是打2万的话，可以进45678筒，356789万总共1144张，减掉手牌7张，还有37张进牌的机会"
  },
  {
    "id": 534,
    "cards": "12344588m345788s",
    "answer": "1m",
    "tips": "这手牌应该在788条和445万之间进行拆对，如果打掉万，可以进368万，689条，总共6门牌19张牌，如果打8条，可以进3468万，69条，总共也是6门19张牌，考虑到8条对子比4万对子更好碰出，所以应该拆445搭，但是由于手牌有123万可以和445万连起来所以打掉1万，才是最正确最安全的打法"
  },
  {
    "id": 535,
    "cards": "11344789m344567p",
    "answer": "4p",
    "tips": "手上有两副成牌时.三对拆对，拆掉带最好搭子的对筒子可进张为258筒，万子可以进子。这里打出4筒，12345万，8门32-6=26张进牌机会。摸258筒听25万。摸12345万听258筒"
  },
  {
    "id": 536,
    "cards": "2345567m1122247s",
    "answer": "4s",
    "tips": "这手牌是一个一对三单的牌型，很明显2345万四连牌型，可以进1234567万，所以万字不能动，能打掉的就是打掉47条其中的一张，7条进56789条，4条进23456条，由于自己手上已经有3张2条，所以正确打法应该是打4条"
  },
  {
    "id": 537,
    "cards": "33389m223p345699s",
    "answer": "9m",
    "tips": "牌局前期·36条一打·打成一进听·但是听牌大概率会边7万·所以前 期我们要选择拆89万·手牌3456条的4连牌型改良空间很大·我们摸来2547条都可以预留双面听的改良·如果牌局中后期我们才会优先选择 打掉36条·保证最大的听牌率"
  },
  {
    "id": 538,
    "cards": "334779p12366789s",
    "answer": "3p",
    "tips": "这手牌应该打掉3筒。此牌是典型的三对牌型，三个对子两幅成牌，所以根据三对拆一对原则，拆掉好成牌的对子，留下不好成牌的对子去碰牌，组牌，所以拆掉3筒有较大概率可能胡25筒的口子，如果拆掉7筒就会胡到卡8筒的口 子上，所以这牌应该打掉3筒"
  },
  {
    "id": 539,
    "cards": "11567m334p455666s",
    "answer": "3p",
    "tips": "这手牌有二副成牌，所以我们是三对拆对牌型，这手牌应该打3筒，打3筒我们只失去碰3筒的机会，但是换来的是进1万，25筒，34567条，一共8门牌的任何一张，一进就可以听牌"
  },
  {
    "id": 540,
    "cards": "2333456p2345678s",
    "answer": "2s",
    "tips": "abbbcde这种可以形成单钓三面听。打258条，听1247饼。有4x4-2=14张进张胡牌机会。而打出2饼听258条有3*4-3=9张进张胡牌机会。所以打258条，进张胡牌机会多了5张。"
  },
  {
    "id": 541,
    "cards": "5556777p2345678s",
    "answer": "2s",
    "tips": "如果打掉6筒,选听258条的话，总共是3门12张，减去3张重复，一共有9张牌的一个胡 牌机会，正确打法应该是打掉258条其中一张，可以听45678筒五门牌，五门20张减去手上的7张，一共有13张的进张机会，比打6筒听258条进张要多"
  },
  {
    "id": 542,
    "cards": "4467m1235688p789s",
    "answer": "7m",
    "tips": "7万和5筒中做选择:我们要注意手牌后期的优化·打掉7万·如果摸来3万·可以得到34万和56饼的两 个双面搭·但是打掉5筒·我们摸来9饼·是一张无效牌·因为8饼的边张对子改良空间很差·所以打掉7万更合理"
  },
  {
    "id": 543,
    "cards": "134577m36667889s",
    "answer": "8s",
    "tips": "典型的一对三单，一万位数边有345万，考虑到搭子的传递功 能，一万的靠张有，1236万，共四门牌。3条，在1万，3条，8条里面靠张能办是最强的，所以这手牌的正确打法是打掉8条，8条的靠张是6789条，我们有三个六条，八条最好的靠搭是摸7条，听69条，其它的都是胡卡张，而69条我们手上已经就4张，所以我们正确打法是打掉8条"
  },
  {
    "id": 544,
    "cards": "55667m45p2377789s",
    "answer": "2s",
    "tips": "77789条这种牌，如果我们有其它的对子，我们考虑拆掉89条，但这手牌，55667万，我们要看成567跟56万二门牌，也就是说，7条开了杠我们没有其它的对子，影响了手牌的推进，那么这手牌，77条就是对定将，55667这种牌型进张非常多，56万不能打，我们能拆的就是45饼遗照 23条，早拆中间，晚拆边，在麻将前期我们打掉45饼，在麻将后期看桌面的张再决定拆，23条或45饼 。大家要灵活运用"
  },
  {
    "id": 545,
    "cards": "336778m2234p2345s",
    "answer": "2p",
    "tips": "这是一个典型的四搭牌型 ，确少搭子，2筒是一个边肚子的牌型，只有摸进来25筒才可有用，6778万的进张能力是456789万，2345条的进张能力是 1234567条，所以打2筒是最优的打法。"
  },
  {
    "id": 546,
    "cards": "2244489m4567p223s",
    "answer": "9m",
    "tips": "8圈之前打掉89万，二进听牌，能形成好的叫口，在牌局后期打掉47饼，强行一进下叫，我们讲的是起手拿到这样一手牌，所以正确打法是打掉9万。"
  },
  {
    "id": 547,
    "cards": "111357m345p23346s",
    "answer": "6s",
    "tips": "打出26条都可以形成一进听牌型。打2条，进5条46万可以听牌，进张机会为12，都是听卡张。打6条，进张机会为3条23467万可以听牌，进张机会为244=20张进张机会。摸进6万可以听23万。并且打6条，保留了大肚牌型的手牌优化能力，摸1245条:打出7万形成四人抬轿，进张机会更多，"
  },
  {
    "id": 548,
    "cards": "235799m11124678p",
    "answer": "5m",
    "tips": "如果打2饼，摸来8万，我们会有4饼，5万，7万，三个单张。打4饼，我来了5饼，我们会丢掉45678饼五连的效果，所以这手牌正确打法是打掉5万，打五万来了8万，直接打掉9万，23万跟24饼形成一个四人抬轿。四人抬轿我们可以进7门牌。就算不来8万，9万边张也比较好碰，来14万，打掉4饼，我们可以吊2饼，边三万。来3饼，我们可以打掉四饼，胡14万。也就是掉因为三个1饼，我们的四人抬轿进七门牌，我们都可以胡另外两门牌，打麻将我们要打-步看三步。一定要先预想好我们的听口会是什么。"
  },
  {
    "id": 549,
    "cards": "22268m677888p556s",
    "answer": "6s",
    "tips": "这手牌应该直接打掉6条，保留321复合牌型，这样就有进张5条，7万和56789条，都可以听，进口数量最多。"
  },
  {
    "id": 550,
    "cards": "34666778m224567s",
    "answer": "7s",
    "tips": "如果打掉8万的话可以进257万，23条，一共5门。23条一共6门。如果打掉7万的话，可以进2569万，一共7门。如果打掉47条，可以进256789万，23条，所以正确答案是打7条。"
  },
  {
    "id": 551,
    "cards": "4567m2255589p223s",
    "answer": "9p",
    "tips": "虽然打掉47万，我们可以一进听牌，但我们很大概率会听边7饼的叫口，所以在麻将的前期，我们要拆掉这个89筒，保留更好听口的机会，但如果在麻将的后期，也就是8圈之后我们一定是打掉47筒，先强行听牌才就可能胡牌。我们讲的是起手拿到这样一手牌，我们应该是打掉98筒是正确的。"
  },
  {
    "id": 552,
    "cards": "78899m3399p13678s",
    "answer": "9m",
    "tips": "这手牌优先考虑拆掉89万，留下13条的门子，因为89万进只有七进万才有用，进89万，只能组成一个789万一副成牌加八万或者九万的搭子，我们本来就有3饼，9饼的二个对子了，所以我们的正 确打法是打掉这个89万的搭子。"
  },
  {
    "id": 553,
    "cards": "13556m123334678p",
    "answer": "4p",
    "tips": "这手牌还没有那么快听牌，考虑打掉哪张不容易损失更多的进张机会，如果打1万，损失两万一门的机会，如果打1筒，损失2筒和5筒两门的机会，如果打3筒，只会损失3筒1门一张的进张机会，但是无法形成2对半的牌型，只能进25筒和2万听牌，所以说这手牌要从6万和4筒之间去做选择，打掉6万的进235筒25万听牌，一共有14张有效进张，打掉4筒有2457万3筒有效进张，一共有15张，所以这手牌打掉4筒最为高效。"
  },
  {
    "id": 554,
    "cards": "244789m2456p4568s",
    "answer": "2m",
    "tips": "分析牌型后，这手牌是一对三单的牌型，要注意单张的靠张能力，正确打法应该是打掉二万，因为2万保留的话，它的进张能力是1234万，保留 八条的话，进张能力是36789条，二筒的进张能力是12347筒，对比下来只有2万的靠张能力最差，所以应该打掉2万。"
  },
  {
    "id": 555,
    "cards": "12333678m124588p",
    "answer": "2p",
    "tips": "把123万当成一搭一对3万当成一搭，有6搭牌。6搭拆搭。根据丢张最少进张最多原则，打12筒不丢3筒进张。所以打12筒。"
  },
  {
    "id": 556,
    "cards": "124567m3678p2334s",
    "answer": "3p",
    "tips": "这手牌很多朋友第一反映是打掉1万(打1万不丢3万)，但是分解手牌可以发现，本局是缺将也缺搭子。打出1万，进347万还是缺一搭。不打1万，进147万都可以形成带将牌的5搭牌。那是打3条还是3筒呢?有麻友说打3条，无将搭大肚(2334条为大肚牌型)，但本手牌不只缺将，也缺搭子。2334条是大肚牌型，进张能力是很强的，进来12345条都可以形成两个搭子。所以打出3筒"
  },
  {
    "id": 557,
    "cards": "22346779m223499p",
    "answer": "2m",
    "tips": "两个边肚，一个大肚，这手牌不缺对子，有将拆边肚，正确打法是打掉2万，因为34万跟67万有重复的进张五万，留下2筒，我们会多一门进张，所以正确打法是打掉2万。"
  },
  {
    "id": 558,
    "cards": "45677m44p2388999s",
    "answer": "4p",
    "tips": "三对拆一对的牌型，如果打 七万，摸来3万8万变成五连顺，或者上手56万形成双面搭，我们还是打去拆4筒的对子，这样拆的话，完美错过两对半的牌型。变成了8条一对定将，二对半牌型在现实中是效率最高的牌型，所以正确打法是打掉4筒。打四筒，摸来3568万，我们可以有4567四联坎，同时也保 留了二对半牌型。来8条或者7万都可以听14条。"
  },
  {
    "id": 559,
    "cards": "3334789p1267999s",
    "answer": "1s",
    "tips": "打四筒，3筒可以开杠，13条，67条可以形成四人抬桥 ，但打掉四筒，摸来5678条四门牌，只能单吊一条或2条，要么边3条，所以打掉4筒80%的概率只能湖一张牌，打掉1条，摸35678条，245 筒，都可以听双面搭，或三面搭，所以正确打法是打掉1条。"
  },
  {
    "id": 560,
    "cards": "1237m7789p336778s",
    "answer": "7p",
    "tips": "这手牌可以看成是1对三单，我们要考虑三个单张的靠张能力，首先7条是肯定不能打 。因为我们进56789五门牌，我们都能形成双面搭。为什么打7筒是正确的。因为7筒傍边有789筒的重复进章，也就是他的竟急损耗，所以我们的正确打法是打掉7筒。"
  },
  {
    "id": 561,
    "cards": "57889m246p123777s",
    "answer": "8m",
    "tips": "这手牌应该选择打掉8万，因为打8万后整手牌会变成无将一上听，摸进5万可以听牌，保留三连砍摸进2356筒也可以听牌。"
  },
  {
    "id": 562,
    "cards": "44456779m456p456s",
    "answer": "7m",
    "tips": "打4万，胡卡8万，打9万胡47万，手上有5张47万张，只剩3张胡牌机会。所以这手牌的正确打法是打掉7万，打7万可胡89万，有7张胡牌机会"
  },
  {
    "id": 563,
    "cards": "34579m233378p456s",
    "answer": "9m",
    "tips": "正确答案是打掉9万，这手牌我们缺对子。如果打出2筒，手牌变成4人抬轿，进789万6789筒都可听牌，进张数为7门24张;但只有进789万，才能听69筒的双面听。打出9万，进7万，124，69筒都可以听牌，可进张数为6门22张。进6789筒，7万，都为三面听(听124筒)，进124筒，7万，听69筒，也是双面好听。当进张数大于20时，主要需要考虑后续的听口质量。所以打出9万为最正确的打法。"
  },
  {
    "id": 564,
    "cards": "12256999m222377p",
    "answer": "3p",
    "tips": "这手版的正确打法是打出3筒，如果不打3筒，二三筒组成搭子的话，这手牌就是6搭牌。我们没有把牌往前推进，把牌打倒退了，根据5搭牌原理，打出3筒。我们还可以形成两对半牌型。"
  },
  {
    "id": 565,
    "cards": "113678p13668999s",
    "answer": "8s",
    "tips": "这手牌的正确答案是打掉8条，这手牌比较简单，主要考虑后续牌型的优化。可以看出已经是两对半，碰6条和1筒都是听卡2条。所以我们能打的牌只有在8条和3筒之间选择。因为13条为卡张搭子，需要 优化，而8条优化空间有限，而保留3筒摸来4筒可以优化成两面好搭。所以选择打出8条。而如果把1条换成2条，这手牌则应该打出3筒， 因为搭子不需要优化，6条碰出机会比1条小，留8条可以辅助6条对子，我们摸进来7条也可听牌。所以这手牌我们最优秀的打法是打掉8条。"
  },
  {
    "id": 566,
    "cards": "4699m123999p3578s",
    "answer": "5s",
    "tips": "根据六搭拆搭不丢张或者丢张最少的原则，这手牌的正确答案打掉5条。首先来看一下这手牌为什么不能打掉4万？4万一打。第一丢掉了5万的进张，其次你丢掉了3万来形成25万的双面搭的几率；6万一打丢掉了5万，还丢掉了7万；打掉3条，既丢掉了4条，还丢掉了2条；这手牌打掉5条，只会丢失一门4条的进张，5条打掉，摸来了6条，78条接得住，因为5条跟78条之间有一个重复进张的6条。打掉5条只会丢失4条的进张，而并不丢6条的进张。78条就不用拆了，为什么呢？全手只有一个69条的双面搭，把8条拆掉了，听口质量就差了，所以说打掉5条是更为高效的。"
  },
  {
    "id": 567,
    "cards": "234779m2377p2245s",
    "answer": "7p",
    "tips": "这手牌的正确答案打掉7筒，首先我们排除掉9万，打掉9万还是六搭牌，并没有对手牌起到推进的作用，其次5条也不能打，我们要保留好的进口质量，全手两个双面搭，打掉后进口质量就差了，所以在7筒和2条之间做选择，金3银7臭28，2条比7筒好碰出，所以保留2条，打掉7筒。"
  },
  {
    "id": 568,
    "cards": "111777m5688p4467s",
    "answer": "7s",
    "tips": "这手牌的正确答案打掉7条，打掉7条，摸来了3条，可以打掉6条改良成25条的双面搭。手牌往前推进一步，如果这手牌打掉5筒，摸来了9筒，不能改良成双面搭，所以说这手牌打掉7条比打掉5筒要高效的多，8筒是属于边张牌型，它不具备靠搭能力，而这个4条是属于中间的牌型，它具备靠搭能力。所以说打掉7条才是最正确的打法。"
  },
  {
    "id": 569,
    "cards": "11123778m222677p",
    "answer": "7m",
    "tips": "这手牌打掉7筒跟打掉7万，是不是理论上来讲都可以，但是正确答案是打掉7万，举个例子，把7筒一打，摸来了147万，是不是100%会打掉这个8万？因为你要打掉8万，听58筒的双面听。这个8万它本身就是属于边缘牌型，边缘牌型被别人碰出的概率永远比中张牌型要高。把8万打掉，如果摸来了9万，是不是又要去打这张9万？那这个9万是不是又有可能给别人杠，又有可能给别人碰呢？也就是说打掉8万的麻友，既没有防守住9万，也没有防守住8万。相当于两张边张牌型你都没有防守住。那现在退一步讲，打7万来试一下，如果打掉7万的话，这手牌摸来了14万、碰7筒、摸58筒，都可以选择打掉6筒或者是打掉7筒，而这个67筒都是属于中间的牌型，被别人碰出跟杠出的概率本身就不高，所以说，这手牌的正确答案，打掉7万，叫做攻守兼备，既懂得进攻，你还要懂得防守。"
  },
  {
    "id": 570,
    "cards": "3444567m34567p34s",
    "answer": "3m",
    "tips": "这手牌如果打3万，进2345678筒、2345条都可以听牌，总共11门。如果打4条进3条、258筒、2358万都可以听牌总计8门。因此这手牌打3万才是最佳打法。"
  },
  {
    "id": 571,
    "cards": "23555667p335678s",
    "answer": "5s",
    "tips": "这手牌是321的复合牌型，特点是进张数量特别多，这手牌摸来了45678筒，其中的任何一张牌你都可以听牌。所以说这手牌67筒一定不能打，那这手牌打掉58条取决于牌局的分段。如果这手牌在牌局的早期，建议大家打掉这个8条，因为打掉8条叫做拆回头牌。如果摸来了4条的话，你可以改良成258条的3面搭。这个时候再去选择打67筒，不影响你杠5筒、碰6筒也不影响你进258条、碰3条、摸14筒。如果摸来了14筒，你还可以听到258条的三面听。如果这手牌到了牌局的中后期，这个8条都还没有出来，那你肯定就要打掉5条。你打掉5条过后，如果摸来了9条，你可以打掉6条。既可以防守住8条，还能保护这个9条，所以牌局的中后期一定要选择打掉这个5条。"
  },
  {
    "id": 572,
    "cards": "2337m3336778p678s",
    "answer": "2m",
    "tips": "这手牌就是非常典型的一对3单的牌型，它有一个特点，2万、7万、7筒3个单张，对不对？其他的都是成牌，都是对子，所以说这样的牌型叫做一对3单的牌型。一对3单的牌型有一个特点，你只需要找到哪一张牌的靠搭子的能力最差，你就打掉哪一张牌。那么2万、7万、7筒，哪一张牌的靠搭能力最差呢？那很明显是这个2万吗？金3银7臭28吗？所以说这手牌闭着眼睛打掉2万。"
  },
  {
    "id": 573,
    "cards": "34456679m455p789s",
    "answer": "4p",
    "tips": "这手牌是一个一对定将的牌型，一对定将指的是当我们的手牌处于一进听且只有一个对子的情况下，我们直接打掉对子旁边所关联的牌型，保留下这个对子作为将牌，这叫做一对定将，这手牌，一定要打掉4筒，而不能打掉9万。很多朋友一来，啪，把9万打掉了。打掉9万的麻友，你打麻将肯定是经常点杠，经常点炮，想都不用想。为什么不能打掉9万？首先9万是属于边张牌型，打出去容易被别人碰，容易被别人杠，这是第一。第二，打掉9万过后，你只能摸2万、听58万；摸5万、听258万；摸8万来、听到25万。打掉9万的麻友，只能摸来258万3门牌12张牌的进张，如果这手牌打掉4筒，摸来了258万可以听牌；还可以碰5筒、碰6万来听牌，所以说打掉4筒比打掉9万多了两门8张牌的进张。正确答案打掉4筒。"
  },
  {
    "id": 574,
    "cards": "11355999m345579p",
    "answer": "9p",
    "tips": "这手牌我们就一定要注意了，前面给大家讲过的，一对定将，两对拆搭，三对拆对，四对必碰牌，五对摸七对。那这手牌分解手牌只有两对，两对我们要拆掉搭子，所以说这手牌只能在5筒跟9筒之间做选择，答案很明显，是打9筒。那为什么不能打掉5筒呢？有3个原因，这手牌可以做七对的，摸来了3筒、4筒、3万、7筒就变成了五对牌了，这是第一。你把5筒一打，是不是丢掉了唯一做七对的机会？这是第二。第三，打掉9筒，就算摸不来七对，摸来了4筒，还可以改良成25筒的双面搭，所以打掉9筒是正确选择。"
  },
  {
    "id": 575,
    "cards": "446688p23555678s",
    "answer": "6p",
    "tips": "这手牌正确打法应该是拆468筒的对子，打8筒的话，可以进467筒3门牌；打4筒的话，可以进568筒3门牌；打6筒的话，可以进4578筒4门牌。因此，这手牌打掉6筒是正确打法。"
  },
  {
    "id": 576,
    "cards": "245m12337p112378s",
    "answer": "7p",
    "tips": "这手牌叫做无将的牌型，缺对子就一定要保留靠对能力比较强的牌型，只需要找到哪一张牌的靠对能力比较强，你就保留下哪一张牌就行了，对吧？这手牌首先1条排除掉不能打，因为摸14条能形成一个对子和1副成牌。那答案也就在7筒和2万中选择，这手牌一定要打掉7筒，麻将口诀“无将一上听，打闲不打连”，当我们手上缺对子的时候，打短留长，这个7筒不就是一张废牌吗？2万摸来了3万，可以形成2345万的四连牌型，缺降缺搭留四连，四连牌型是所有牌型里面它的利用价值非常高的一种牌型，这是第一。第二，2万不打，摸来了2万，45万可以形成一个双面搭，摸来了5万，24万可以形成一个卡张搭子。而这个7筒唯一的作用就是摸来7筒，摸来搭子意义不大，所以正确答案打掉7筒。"
  },
  {
    "id": 577,
    "cards": "1135m2225799p113s",
    "answer": "5m",
    "tips": "这手牌根据麻将口诀“六搭拆搭”，虽然35万、57筒是中张牌，13条是边张牌，但是拆掉13条，我们没有把牌型打成进一步，所以正确打法应该是打掉5万或者5筒，虽然打5万丢4万，打5筒丢6筒，但我们会把手牌推进成五搭牌，当我们手牌是六搭牌的时候，我们一定是先把牌推进成五搭牌。另外根据筋线牌理论，258筒一条线，打5筒会影响2筒的杠出，所以正确答案打掉5万。"
  },
  {
    "id": 578,
    "cards": "4445666p2345678s",
    "answer": "8s",
    "tips": "这手牌如果打掉5筒，选听258条的话，总共是3门12张，减去3张重复牌，一共有9张牌的一个胡牌机会，正确打法应该是打掉258条其中一张，可以听34567筒5门牌，5门20张减去手上的7张，一共有13张的进张机会，比打5筒听9张牌要多。所以正确选项打掉8条。"
  },
  {
    "id": 579,
    "cards": "11123m23456p5779s",
    "answer": "5s",
    "tips": "这手牌是一个非常典型的两对牌型。“一对定将，两对拆搭”也就是说这手牌只能打掉5条跟9条，千万不要拆7条跟1万来打，更不能去打掉23万。那么这手牌能打的只有这个5条和9条，如果这手牌把9条一打，保留5条的意义是什么呢？就算摸来一个4条，是不是还要打掉4条啊？因为并不能改良成36条的双面搭，对不对？既然打掉9条，保留下5条，并不能改良成36条的双面搭，也就是说这手牌5条存在的价值只能摸一张卡6条的进张，而9条存在的价值，它不仅可以摸卡8条，它还可以摸9条的进张。打掉9条，摸来了5条怎么打？是不是不打5条就打7条。打掉5条，既可以摸8条，还可以摸9条。因为一对9条肯定比一对7条好碰，另外一对7条加一个9条叫做半封闭半包围的牌型，因为一对7条加一个9条对8条形成了半封闭，8条靠上7条的概率降低了，那么7条靠上8条的概率它不就提高了吗？所以说卡8条的进张效率，它是永远高于这个卡6条的。那么这手牌的正确答案是打掉5条。"
  },
  {
    "id": 580,
    "cards": "3568m2334p234888s",
    "answer": "3p",
    "tips": "这手牌的正确答案是打掉3筒，我们可以把手牌打成无將—上听，万子进345678万，6门牌任何一张都可以听牌。"
  },
  {
    "id": 581,
    "cards": "224567p22488999s",
    "answer": "4s",
    "tips": "这手牌听牌前坎搭的进牌效率不如对子，所以这手牌要留对子，那么就要拆坎搭中的4条，4筒和7筒属于四连牌型，后续有比较大的优化改良机会，所以这手牌应该打4条。"
  },
  {
    "id": 582,
    "cards": "3334m234778p6667s",
    "answer": "7p",
    "tips": "这手牌我们可以把67条跟34万分开来看，我们看成是三对的牌型，当然我们也可以把它看成是两对的牌型，那么这手牌一对6条，一对3万可以作为将牌，67条跟34万可以看成是两个双面搭。也就是说这手牌给我们得到的信息是什么呢？永远不可能缺对子，这手牌闭着眼睛打，永远不可能单吊嘛，既然这手牌不可能缺对子，那就打掉7筒，因为就算摸来了69筒，还要打7筒，而打掉7筒的话，只丢两张7筒的进张。最差你都可以听到69筒的双面听。甚至是听到三面听。这手牌打掉8筒的麻友，打麻将绝对是经常输的，第一，你打掉8筒，你丢掉了4张6筒、4张9筒，丢掉了8张牌，第二，28筒是属于边缘牌，打出去被别人碰出跟杠出的概率比较高。如果别人把这个8筒碰了或者是杠了，你的手上还有一个隐形的炸弹，9筒，对吧？你把8筒一打，如果你反手摸来了一个9筒，那这个9筒你必打无疑。打掉8筒的麻友，不知道什么叫做进攻？什么叫做防守？打掉7筒既保护了8筒，还防守了9筒，同时还保留了69筒的进张。而且的进张效率是最高的，所以说这手牌一定要选择打掉7筒，而不能去打掉8筒。正确答案打掉7筒。"
  },
  {
    "id": 583,
    "cards": "677888m11179p334s",
    "answer": "4s",
    "tips": "这手牌如果打7万的话，进牌有8筒、235条、58万，总共是6门24张，减去手里的5张，还有19张牌的进牌机会，正确打法应该打掉4条，进牌有8筒、3条、56789万，总共是7门28张，减去手里的8张，还有20张牌的进牌机会，所以打4条才是最大几率打法。"
  },
  {
    "id": 584,
    "cards": "22356m33367p4467s",
    "answer": "7s",
    "tips": "这手牌相对来说就比较简单了，因为这手牌是一个六搭牌，六搭拆搭不丢张或者是丢张最少，把我们手上的牌处理成五搭牌，这是所有打麻将的朋友你们必须要知道的一件事情。所以说这手牌只能打掉7条。打掉7条过后，你虽然丢掉了4张8条的进张，但是你保留了卡5条，所以说打掉7条的麻友，你只丢1门8条的进张，那如果这手牌你打掉7筒，打掉6筒，你肯定丢掉了58筒两门牌呀。打万子同理，所以正确答案打掉7条。"
  },
  {
    "id": 585,
    "cards": "1134579p1233479s",
    "answer": "9s",
    "tips": "这手牌我们把579筒看成是一个3连卡，79条看成是一个卡8条的搭子，79条的利用价值是不是远远没有579筒的利用价值高，那么既然79条没有579筒的利用价值高，那你就打9条啊，这是打掉9条的第一个原因。第2个原因我们用逆向思维来打一下这手牌，如果把9筒一打，摸来了6条，是不是还要打掉9条？或者摸来了6筒过后，是不是还要拆掉79条？或者是要拆掉34条，这手牌是不是在原地踏步？也就是说这个9条早打晚打都得打，那如果提前打9条，摸来了6筒，可以选择打7条，这个9筒就不用打了，这叫做打扣张，把这个9筒一定要扣在手里。因为9筒是属于危险张，连牌都没有听，为什么要打掉9筒呢？如果打掉7条，摸来25条，这个时候你已经听牌258筒了，这个时候再去选择打9筒，因为这个时候打9筒叫做打冲张，这个时候打9筒是为了骗8筒，因为你已经听牌258筒了，再去打掉9筒过后，如果9筒被别人碰了，他手上有8筒，他这个8筒是必打无疑的。所以说打麻将扣牌跟冲牌是很重要的。为什么麻将高手打麻将总是能接住别人的杠上炮呢？为什么你跟麻将高手打麻将的时候，你会发现他的这种生死张永远是在他听牌的时候才打，他没有听牌的时候他永远不会打，所以说你一定要去注意，一定要学会去判断有没有可能给他点杠上炮，所以这手牌的正确答案是打掉9条。"
  },
  {
    "id": 586,
    "cards": "113445667m23456s",
    "answer": "6m",
    "tips": "首先这手牌是一进听的状态，打掉4万和6万都可以一进听，但是打4万的话，对手打出1万的概率就会比较小。但是打6万的话，就不存在这种情况。无论是碰1万还是碰4万，都可以直接听牌，所以正确打法应该是打6万。"
  },
  {
    "id": 587,
    "cards": "1245667m1124889p",
    "answer": "1m",
    "tips": "这手牌可能很多人会选择打掉4筒，不仅变成五搭牌，而且进3筒也不丢张，但是这样打就会剩下一对8筒做将，有效进张就只有358万了。所以更优秀的打法应该是打1万，后面不论是进3万还是进58万，都可以把牌型打成两对半的牌型，胜率会比打4筒更高，所以正确打法应该是打1万。"
  },
  {
    "id": 588,
    "cards": "1238m25p44455567s",
    "answer": "2p",
    "tips": "这手牌是一个一对3单的牌型，要注意重复进张，如果打8万的话，保留25筒来做靠张一上听，3筒和4筒是重复进张，所以这样的话效率会降低很多，所以像这种一对3单靠张一上听的牌，就不要保留筒子一门花色的，特别是有重复进张的，所以应该打掉2筒，因为5筒的进张能力是比2筒要更强的。"
  },
  {
    "id": 589,
    "cards": "224578m11468999s",
    "answer": "5m",
    "tips": "根据六搭拆搭原理，以不丢张或者少丢张为原则，所以这副手牌应该打掉5万，因为打掉5万，不会丢36万的进张。"
  },
  {
    "id": 590,
    "cards": "224688p23456799s",
    "answer": "2p",
    "tips": "这手牌有3个对子，一定要学会拆搭子的原则，一对定将，两对拆搭，三对拆对。三对拆对它有一个前提条件，三对拆对的前提条件是你的手上必须拥有两副完整的成牌，也就是说你的手牌得处于一进听的时候，你才能三对拆一对。这手牌234567条刚好两副完整的成牌，符合三对拆对的原则。那既然三对拆对，拆掉2筒还是8筒呢？打掉2筒你可以摸3筒、摸5筒、摸7筒、碰8筒、碰9条，一共是5门牌20张牌的进张。打掉8筒，你可以摸3筒、摸5筒、摸7筒、碰2筒、碰9条，你也是5门牌20张牌的进张，所以说这手牌的正确答案2筒或8筒。"
  },
  {
    "id": 591,
    "cards": "12233478m346789s",
    "answer": "3s",
    "tips": "这手牌是四人抬轿的牌型，四人抬轿的牌型指的是当我们的手上有3副完整的成牌，再加上两副没有完成的成牌，这两副没有完成的成牌组合在一起就叫做四人抬轿的牌型。四人抬轿的牌型它有一个特点，它的特点是进张数量特别的多。也就是说这手牌无论你是打掉369条任何一张都可以打成一个四人抬轿的牌型。都是进8门牌32张的进张，打3条进4569条、6789万听牌；打69条进2345条、6789万听牌，但是有一个问题，打掉69条只能摸来34条、78万一共4门牌16张能听双面听，减去手上的4张，还剩下12张听双面听，打掉3条可以摸469条、69万听双面听，一共20张，减去手上3张，还有17张，所以这手牌正确答案打掉3条。"
  },
  {
    "id": 592,
    "cards": "12234447p115679s",
    "answer": "2p",
    "tips": "这手牌是一对3单的牌型，只需要找到哪一张牌的靠搭能力最差，就打掉哪一张牌，去保留下靠搭能力最强的那一张牌就可以了。那么9条、2筒、7筒之间，首先排除掉7筒，7筒的靠答能力是最强的，金3银7臭28，这个麻将口诀大家天天都在背，所以说这手牌7筒他一定不能打；那这个2筒最多摸1234筒；这个9条呢？最多摸789条带4条吗？他们都只有4门牌16张牌的进张，而这个7筒可以有5门牌20张牌的进张。那么正确答案打掉这个2筒就可以了。打掉2筒叫做最大几率打法。因为2筒周边只有1234筒，我们手上已经有7张1234筒了，而9条靠搭的手上只有2张，打掉2筒可以摸来有用牌概率更大，麻将它本身就是一个概率性的数字游戏，只有让你的进张数量变得越多，那摸来有用牌的概率就会越大，摸来有用牌的概率越大，那么你听牌胡牌的概率才会越大，这就叫做麻将的最大几率打法。"
  },
  {
    "id": 593,
    "cards": "123m345667p11334s",
    "answer": "6p",
    "tips": "首先我们来看一下这个牌型，这个牌型它是一个一进听的牌型，同时是有3个对子，是不是这手牌要不打掉6筒，要不打掉3条呢？但是这手牌告诉了我们一个知识点，叫做预留好你的听口质量，很多朋友打3条，你把3条打掉，碰1条、碰6筒，你只能听25条；如果打掉6筒，碰1条、3条、摸25条，可以听258筒，这就叫做预留好你的听口质量。既然你想听258筒，那你就提前打掉6筒，防止6筒碰到过后你听不了258筒。"
  },
  {
    "id": 594,
    "cards": "2456m4568p123778s",
    "answer": "8s",
    "tips": "这手牌应该打掉8条，保留8筒和2万，因为8筒可以进36789筒听牌，2万也是同样的效率，可以进12347万听牌，留8条会降低效率，所以正确打法应该打8条。"
  },
  {
    "id": 595,
    "cards": "456888m35799p777s",
    "answer": "3p",
    "tips": "这手牌正好五搭牌，如果打7筒只能听夹4筒，但是打3筒时后续有更好的优化机会，除了听夹6筒之外，当来8筒或者9筒时，就可以继续优化手牌，打出5筒，可以听69筒或者单吊8筒，所以正确打法应该是打3筒。"
  },
  {
    "id": 596,
    "cards": "1134678m2334578p",
    "answer": "8p",
    "tips": "首先这手牌是一个非常典型的六搭牌，那么六搭牌我们一定要学会一件事情，六搭拆搭不丢张，或者是丢张最少，把我们手上的牌处理成五搭牌。这是所有打麻将的朋友必须要知道的一件事情，因为五搭牌原理是优于一切麻将打法的，只要你打的是全国的13张麻将，你听牌、胡牌一定只需要5个搭子。那你多一个搭子，少一个搭子，你既不能听牌，你也不能胡牌，所以说这手牌你一定要学会去判断你手牌的价值。这手牌我们一定要打掉这个8筒，千万不要去打掉34万、23筒，很多朋友不理解为什么要打掉8筒？因为打掉8筒丢张最少，打掉8筒，虽然丢掉了9筒的进张，但是保留了6筒。那如果这手牌打掉23筒，是不是丢掉了14筒两门牌？要是打掉34万的话，是不是丢掉了25万两门牌？所以说这手牌的正确答案一定要打掉8筒，因为打掉8筒才能丢张少，丢张少进张就多了。"
  },
  {
    "id": 597,
    "cards": "11788m13p2345568s",
    "answer": "8s",
    "tips": "可以看到这手牌是一个六搭牌，如果打掉8万的话，会丢失8万的碰张，而且整手牌依然有六搭牌，如果打1筒的话会丢失2筒的进张。正确的打法应该是打掉8条，因为打掉8条后，没有丢失7条的进张，依旧有556条保留7条的进张。"
  },
  {
    "id": 598,
    "cards": "12345667m133799s",
    "answer": "7s",
    "tips": "这手牌正确答案是打掉7条，原因很简单，首先第一个原因，因为一对9条它肯定比一对3条好碰，是吧？所以说既然一对9条比一对3条好碰，那就让一对9条去碰。既然这个3条不好碰，那就去把这个1条留住，让1条帮一下这个3条，防止这个3条碰不到听不了牌。第2个打掉7条的原因，打掉7条叫做打勾张，因为打掉7条过后，是有可能骗到9条的碰出的，而你打掉1条永远骗不出这个3条。第3个原因打掉7条保留半封闭牌型，133条叫做半封闭半包围的牌型，叫做关门打狗的牌型，133条对2条形成了半封闭，2条靠上3条的概率降低了50%，3条靠上2条的概率就提高了50%。也就是说，这手牌卡2条永远比卡8条好胡，所以正确答案打掉7条。"
  },
  {
    "id": 599,
    "cards": "3334m234599p2334s",
    "answer": "4m",
    "tips": "这手牌有3个重要的麻将牌型。大肚牌型和四连牌型很容易摸成顺子带两面搭子。打出4万，进12345条、1234569筒都可以听牌，而且保留了3万的杠出机会，进张机会为12门38张；如果打出3条，进张机会为245条、1234569筒可以听牌，进张机会为10门29张；我们打出25筒，进张机会为12345条、245万、9筒，进张机会为9门29张，所以这手牌我们打掉4万进38张牌是最优秀的打法。"
  },
  {
    "id": 600,
    "cards": "11344678m344567p",
    "answer": "4p",
    "tips": "根据麻将口诀，这手牌属于三对拆一对牌型，如果打掉4万，那么碰出1万或者碰出4筒的情况下，只能打掉3筒听在25万上面，但是如果打掉4筒的话，无论是碰出14万还是进张25万，都可听在258筒上面，胡牌的几率会更大，所以正确打法应该是打掉4筒。"
  },
  {
    "id": 601,
    "cards": "3799m2234p236678s",
    "answer": "2p",
    "tips": "那这手牌是不是似曾相识?一对3单跟一对4单的牌型感觉区别没有什么区别，对不对?那么这首牌型叫做一对4单，那么一对4单跟一对3单其实原则上是一样的，因为都缺搭子，你只需要找到哪一个牌的靠单能力比较弱，你就打掉它，金3银7臭28，所以说打掉2筒。"
  },
  {
    "id": 602,
    "cards": "1223478m1122378s",
    "answer": "1m",
    "tips": "分解手牌，看成两幅成牌234万，123条，剩下4个搭子，12万，89万，12条78条中间拆一个，那肯定从12万或者12条之间拆掉1搭，所以正确打法应该是打掉1万，后续无将时，留12条还可以碰一对，留一对做将。"
  },
  {
    "id": 603,
    "cards": "445m13888p566777s",
    "answer": "5m",
    "tips": "根据麻将口诀，两对拆搭，所以正确打法应该是打掉5万，保留条子的321牌型，打掉5万后，可以进2筒，4万45678条一共7门28张，减去手牌8张，还有20张进牌机会。"
  },
  {
    "id": 604,
    "cards": "123m344567p11334s",
    "answer": "4p",
    "tips": "三对拆一对，如果打掉3条后碰牌，我们大概率只能听25条的叫口，打掉4筒只要我们碰牌，就可以听258筒的叫口，所以正确打法就是打掉4筒。"
  },
  {
    "id": 605,
    "cards": "244456m11234778p",
    "answer": "7p",
    "tips": "根据麻将口诀，三对拆一对的情况，正确打法应该是打掉7筒，如果打2万的话，可以进1679筒，47万，总共6门24张，减掉手上的7张，还有17张牌的进牌机会，条时也丢失了3万的进张；打7筒的话，可以进169筒，347万，总共也是6门24张，减掉手上的5张，还有19张的进牌机会，比打掉2万多了2张，并且7筒是一个中张牌，并不好碰，所以应该打掉7筒。"
  },
  {
    "id": 606,
    "cards": "13678m78899p3399s",
    "answer": "8p",
    "tips": "这手牌优先考虑拆掉89筒，留下13万的门子，因为89筒进只有7进筒才有用，进89筒，只能组成一个789筒一副成牌加8筒或者9筒的搭子，我们本来就有3条，9条的2个对子了，所以我们的正确打法是打掉这个8筒的搭子。"
  },
  {
    "id": 607,
    "cards": "112334m23p244567s",
    "answer": "2s",
    "tips": "这手牌是复合型牌搭，112334万，成牌可以固定成123万，也可以固定成234万，当123万时，进张就是25万，当234万时，进张就是12万。因此像这手牌，在优先留住两对子的情况下，拆搭就不能拆万子，正确打法应该是打2条。"
  },
  {
    "id": 608,
    "cards": "34m222468p334888s",
    "answer": "4s",
    "tips": "根据麻将口诀，一对先定将，因此正确打法应该是打掉4条，专心优化万子和筒字的搭子。"
  },
  {
    "id": 609,
    "cards": "233457m566999p56s",
    "answer": "5p",
    "tips": "根据麻将口诀，一对先定将，所以这手牌应该打掉5筒。可以进47条，146万，一共5门牌。"
  },
  {
    "id": 610,
    "cards": "445588m22p234678s",
    "answer": "4m",
    "tips": "这手牌应该保留8万对子,因为靠边的对子比较容易牌,同时要尽量保留45万的搭子作为后续的听牌牌型,所以应该拆掉45万的对子,正确打法应该打掉4万,因为打5万的话，会影响8万的一个碰出,对家手里是5678万优化的话,如果打出5万,对家会跟臭拆5万保留8万。"
  },
  {
    "id": 611,
    "cards": "22245899m113467s",
    "answer": "4s",
    "tips": "这手牌是六搭拆搭的牌型，第一步是在不丢张或者少丢张的情况下，把六搭牌推进成五搭牌，所以正确打法应该打4条，打4条把牌打成了五搭牌，条子也不会损失25条的进张，而打其他的任何一张牌，都会损失进张。"
  },
  {
    "id": 612,
    "cards": "12345788m334778p",
    "answer": "7m",
    "tips": "三对拆一对，是在有2副成牌的情况下，我们三对拆一对，这手牌的正确打法应该打掉7万，打7万我们只丢失9万的进张，打其它的任何一张都至少丢失了2门的进张，打4筒丢25筒、打8筒丢69筒。打掉7万过后，进368万、进235679筒，9门牌的任何一张都可以把牌打成两对半。"
  },
  {
    "id": 613,
    "cards": "33577m123789p579s",
    "answer": "9s",
    "tips": "这手牌的正确打法，应该把它打成一个两对半的牌型，直接打掉5条或者9条，可以保留万子这边的跳对3连坎，可以碰37万、可以进46万、卡6条或者卡8条，共是5门20张，减去手上4张，还有16张进张机会，所以这手牌的正确答案是打掉9条，留下5条的话，我们可以预留进4条做一个优化改良的机会。"
  },
  {
    "id": 614,
    "cards": "246m1344789p1367s",
    "answer": "1p",
    "tips": "这副牌是典型的六搭拆搭牌型，因此可以打掉1筒，剩下一张3筒可以靠上4筒，并重新组成一副五搭牌牌型。"
  },
  {
    "id": 615,
    "cards": "1114778m2334789s",
    "answer": "8m",
    "tips": "这手牌打8万最佳。这是典型的四搭牌，缺搭子，所以我们需要靠张能力强的单牌重新去组搭子，然后再用到我们经常说到的口诀，有将拆边肚，无将打大肚，8万相对于4万和3条的靠搭能力最弱，所以这手牌应该打掉8万。"
  },
  {
    "id": 616,
    "cards": "1223367m3334889p",
    "answer": "4p",
    "tips": "这副牌最优是打掉4筒。因为打9筒，留下4筒，来了25筒，3筒就要成对子了，但这副牌不缺对子，所以来了25筒也是废牌，并且我们打掉9筒会丢失7筒的进张；打4筒，摸进78筒、67万、34筒就形成了四人抬轿。或者进1458万也可以下叫去听牌，所以这副牌应该打掉4筒。"
  },
  {
    "id": 617,
    "cards": "2678m1234789p388s",
    "answer": "2m",
    "tips": "这手牌从单张而言，关联性强弱依次是4筒=3条>2万>1筒，因此很多人会打1筒，但此牌建议打2万，虽然打2万会比打1筒稍微危险些，但留住四连牌型中的1筒，关联能力却强很多，所以从攻防综合效益来说，进牌效益远超防守效益，所以答案是打2万。"
  },
  {
    "id": 618,
    "cards": "111m224578p45899s",
    "answer": "5p",
    "tips": "这手牌最佳打掉5筒。如果打掉8条，这牌依然是六搭牌，并且会丢掉7条的进张。而打掉5筒不会丢张，进来3筒可以组成234筒、进来6筒可以组成678筒，并且打掉5筒剩下的4筒可以和2筒重新组搭，这手牌就改良成五搭牌了，所以应该打掉5筒。"
  },
  {
    "id": 619,
    "cards": "224567m34478p557s",
    "answer": "4p",
    "tips": "这手牌是典型的三对牌型，3个对子两副成牌，所以利用三对拆一对原则，拆掉好成牌的4筒对子，留下不好成牌的2万、5条对子去碰牌，组牌，所以这牌最优打法是打掉4筒。"
  },
  {
    "id": 620,
    "cards": "2237m1227p135889s",
    "answer": "2m",
    "tips": "这副手牌中7万和7筒是单张，不过是四搭牌，要靠搭成五搭牌，像7万和7筒这种中张牌就不适合去打，135条属于是3连坎，这时候的价值更低一些，打2万，拆好的对子带搭子，把碰牌机会留给较差的对子带搭子，因此这副手牌最优打法则是打掉2万。"
  },
  {
    "id": 621,
    "cards": "3444566p1112278s",
    "answer": "6p",
    "tips": "这副手牌打掉6筒，可以形成两对半牌型，碰到那一对都可以两面听，3456筒形成四连牌型，进25筒打4筒胡69条，摸7筒打3筒，4筒等杠。因此这副牌最优打法则是打掉6筒。"
  },
  {
    "id": 622,
    "cards": "23345667m236789p",
    "answer": "9p",
    "tips": "这手牌的正确打法应该是打掉69筒其中一张，因为打掉69筒后，可以进14筒、134568万总共8门32张，减去手牌6张，还有26张进牌机会。所以打9筒最优。"
  },
  {
    "id": 623,
    "cards": "44567899p345677s",
    "answer": "7s",
    "tips": "根据三对拆一对原理,4筒、7条并不好碰出,所以我们可以打掉,但考虑到胡牌效果,我们这时候应该是打掉7条,因为打掉7条之后,我们可以锁定258条的进张,去掉手牌的1张还有11张。打掉4筒,可以把听口定在369筒的三面听，去掉手里的3张还有9张，所以正确答案打掉7条。"
  },
  {
    "id": 624,
    "cards": "45m23347789p4567s",
    "answer": "7p",
    "tips": "如果想组成四搭牌,缺将牌,所以我们需要将牌,把靠对能力强的留下来,无将打大肚,根据靠对能力来看,四连牌型﹥边肚牌型﹥大肚牌型,我们可以看出来3筒和7筒都可以打,但7筒是最佳选择,因为234筒靠上15筒能组成四连牌型,所以这手牌应该打掉7筒。"
  },
  {
    "id": 625,
    "cards": "2223468p2467999s",
    "answer": "2s",
    "tips": "这副牌打掉2条,进467条、2468筒,可以成对,进58条257筒,可以成为成牌一共是41张进张。打掉8筒,进346筒、2467条可成对,进358条、25筒,可以成为成牌,也是41张进张,因此这副牌就需要根据有缘张来打,来3条打8筒,来7筒打2条,选项中只有2条,所以正确答案打掉2条。"
  },
  {
    "id": 626,
    "cards": "1234567m78p34666s",
    "answer": "1m",
    "tips": "这副牌可以选择打掉147万里的任意一张,可以做一个超级四人抬轿,进来2345条,6789筒都能实现听牌,选项中只有1万,因此选择打掉1万。"
  },
  {
    "id": 627,
    "cards": "2456m4568p123778s",
    "answer": "8s",
    "tips": "这手牌是一对三单的经典牌型,根据麻将口诀,一对先定将原则,优先打掉8条,一对7条做将，打8条只丢9条的进张。8筒和2万是衍牌，衍牌在成牌旁边靠搭能力强，所以不能打。正确答案打掉8条。"
  },
  {
    "id": 628,
    "cards": "3334567m3467889s",
    "answer": "8s",
    "tips": "这手牌正确打法应该是打掉8条,只是丢失了78条两门的进牌,但是可以进24578万,2569条,属于最大几率打法。"
  },
  {
    "id": 629,
    "cards": "11124566m123789s",
    "answer": "6m",
    "tips": "这副牌打掉2万,可以胡36万,有6张进张。打掉6万,可以胡23万,有7张进张,而且根据筋线牌原则369一条线，打6万可以降低3万防备更快胡牌,所以这副牌的最优打法是打掉6万。"
  },
  {
    "id": 630,
    "cards": "446688p11145789s",
    "answer": "6p",
    "tips": "这手牌468筒这样的三连对,应该拆掉中间的一对牌,打6筒的话,可以碰出48筒或者进57筒,都可以实现听牌,如果打4筒的话会丢失7筒的进张,所以这副牌最优打法是打掉6筒。"
  },
  {
    "id": 631,
    "cards": "137m1244p4457789s",
    "answer": "1p",
    "tips": "这副牌搭子较多,边搭质量不高。留中张7万来68万能优化搭子,打1筒是因为1筒和2筒需要的是3筒。打出1筒,并不会损失3筒的进张。"
  },
  {
    "id": 632,
    "cards": "346799m112p57999s",
    "answer": "6m",
    "tips": "这副手牌应该打掉6万。根据六搭拆搭,不丢张或者少丢张原则,这手牌应该打掉6万,因为打掉6万,不会丢失58万的进张。"
  },
  {
    "id": 633,
    "cards": "445m12888p566777s",
    "answer": "5m",
    "tips": "根据麻将口诀,两对拆搭,所以正确打法应该是打掉5万,保留条子的321牌型,打掉5万后,可以进3筒、4万、45678条一共7门28张,减去手牌8张,还有20张进牌机会。"
  },
  {
    "id": 634,
    "cards": "234577789m24499s",
    "answer": "9m",
    "tips": "这手牌根据麻将口诀先拆边后拆卡,打掉89万不会丢掉7万的进张,可以直接拆掉89万,根据选项则是选择打掉9万。"
  },
  {
    "id": 635,
    "cards": "788m45999p344568s",
    "answer": "7m",
    "tips": "根据一对先定将原则,这副手牌应该打掉7万,如果打掉8条,则会丢失7条的进张。"
  },
  {
    "id": 636,
    "cards": "1126999m3457p111s",
    "answer": "2m",
    "tips": "这副牌型7筒肯定是不能打的,如果打出6万,万子有1234万进张。打出2万的话,万子能进45678万的进张,明显进张更多,因此这副牌最优打法则是打2万。"
  },
  {
    "id": 637,
    "cards": "23466999p224467s",
    "answer": "4s",
    "tips": "这手牌打7条看起来不丢5条的进张,但当我们对子较多时，就得留好的搭子去拆对子,这个时候打掉4条,虽然损失了4条的进张,但是多了3条的进张,并且2条比4条更容易碰出,因此这副牌应该打掉4条。"
  },
  {
    "id": 638,
    "cards": "1223467p3456777s",
    "answer": "2p",
    "tips": "这副手牌分解之后,以成牌为主,123筒一个成牌，24筒一个卡搭,所以需要拆掉24筒,打掉2筒进14筒也可以做将牌,这样的话7条可以做成牌,打掉4筒,则会丢失14筒的进张,因此打掉2筒是最优打法。"
  },
  {
    "id": 639,
    "cards": "333788m456788p78s",
    "answer": "7m",
    "tips": "这手牌在听牌前,两对子的进张能力,比双面搭子强,所以两个对子8万和8筒都不能拆,所以就要考虑打4筒或者7万了,由于4筒是五连顺中的一张,打4筒会丢369筒,打7万会丢69万的机会,根据丢张最少原则，正确打法是打7万。"
  },
  {
    "id": 640,
    "cards": "111236688m23789p",
    "answer": "8m",
    "tips": "这手牌可能很多人会选择打掉3万,碰68万,进14筒听牌,选择打3万的，一定是把3个1万看做一副成牌,但是正确打法应该是把123万看成一副成牌,然后根据麻将口诀,三对拆一对,三对拆对不拆搭,打8万,可以进67万、14筒、14万听牌。"
  },
  {
    "id": 641,
    "cards": "122667m555p34678s",
    "answer": "1m",
    "tips": "这副牌是典型的两对拆搭,打成两对半,直接打出7万的话,会丢失58万的进张,但如果直接打1万,只会丢失3万的进张,因此这副牌的最优打法是1万。"
  },
  {
    "id": 642,
    "cards": "11123344567789p",
    "answer": "7p",
    "tips": "这手牌最佳应该打掉7筒。比较听牌张数，打1筒有258，3门12张减去手牌3张有9张；打2筒有34筒两门减去手牌有4张；打3筒有147筒3门减去手牌有5张；打4筒有2358筒4门减去手牌有11张；打7筒有25369筒5门减手牌有14张。所以根据最大几率打法这手牌打7筒最佳。"
  },
  {
    "id": 643,
    "cards": "234777m111357p46s",
    "answer": "7p",
    "tips": "这手牌只能从357筒,46条这两搭牌中拆掉一张,首先排除5筒,357筒是三连坎,作为中间牌5筒肯定不能拆;刻子带单张有利于增加进张面,因此3筒也不能打,那么这手牌比较合理的打法只能从7筒、4条、6条当中选一张。正确打法应该是打掉7筒,因为打6条的话,进234567筒、4条,总共6门,打7筒可以进2345筒、456条,总共7门,所以正确打法应该打7筒。"
  },
  {
    "id": 644,
    "cards": "11288m2368p34667s",
    "answer": "8p",
    "tips": "根据麻将口诀,六搭拆搭,小技巧就是优先拆搭,而不是三对拆一对,所以这手牌正确打法应该是打8筒,因为其他3个选项打出去后,手里还是六搭牌。"
  },
  {
    "id": 645,
    "cards": "888999m44568999s",
    "answer": "4s",
    "tips": "这副牌打8条听4、7条,打掉4条可以听7、8条,根据147筋线牌原理,打掉4条可以降低7条防备,并且手牌有3个9条,8条也会快速打出,因此这副牌最优打法则是打掉4条。"
  },
  {
    "id": 646,
    "cards": "236799m111p34467s",
    "answer": "6m",
    "tips": "这手牌应该拆搭不拆对,所以要在3条和6万当中进行选择,当拆牌后影响进牌几率相差不大时,就要考虑后续手牌的优化,因为这手牌留下3条,还有一个摸进5条形成五连顺的几率,所以正确打法应该打掉6万。"
  },
  {
    "id": 647,
    "cards": "3477789m1123467s",
    "answer": "9m",
    "tips": "这副牌是典型的六搭牌,根据先拆边后拆卡原则,打掉89万并不会丢掉7万的进张,所以可以直接拆89万,因此选择打掉9万。"
  },
  {
    "id": 648,
    "cards": "2456m4568p123778s",
    "answer": "8s",
    "tips": "这手牌应该打掉8条,保留8筒和2万,因为8筒可以进36789筒听牌,2万也是同样的效率,可以进12347万听牌,留8条会降低效率,所以正确打法应该打8条。"
  },
  {
    "id": 649,
    "cards": "36789m1345p15558s",
    "answer": "1s",
    "tips": "这手牌闲张、孤张比较多,应该优先打掉靠张组搭能力最弱的牌,应该从1条和1筒中选择一张,由于1筒有345筒顺子的存在,变相增强了1筒的靠搭能力,比如后续如果进6筒,13筒就可以组成搭子,所以这手牌的正确打法应该打掉1条。"
  },
  {
    "id": 650,
    "cards": "11167m13666p2345s",
    "answer": "5s",
    "tips": "这副牌最优打法是打掉5条,做无将一上听,四人抬轿,如果这时摸进123筒、5678万都能听牌,因此这副牌需要打掉5条。"
  },
  {
    "id": 651,
    "cards": "23478m233456778s",
    "answer": "3s",
    "tips": "这手牌的正确打法应该是打掉3条,可以进12456789条、6789万，一共12门48张牌,减去手牌9张还有39张进牌机会,比打掉2、8条多了20张的进张机会。"
  },
  {
    "id": 652,
    "cards": "1124m22378p68999s",
    "answer": "4m",
    "tips": "这手牌不缺对子,不缺搭子,只缺成牌。打6条跟4万丢张是一样的,所以考虑的就是成牌效率,打掉2筒，摸来14筒是六搭牌,打6条，来7条也是六搭牌。打掉4万，来3万打1万。不来3万,1万边张也好碰牌,然后再来14筒或者7条就可以形成四人抬轿牌型,所以这手牌应该打掉4万。"
  },
  {
    "id": 653,
    "cards": "4556799p1156789s",
    "answer": "5p",
    "tips": "这手牌是六搭牌,有两个对子,两个双面搭子的时候,运用麻将口诀“早拆中间晚拆边”,可以打掉5筒,7筒可以靠上9筒,从而变成五搭牌,因此这副牌最优打法是打掉5筒。"
  },
  {
    "id": 654,
    "cards": "23778m245667p999s",
    "answer": "8m",
    "tips": "根据麻将口诀一对先定将，应该打8万，这样就会有3筒、5筒、8筒、14万的进张后直接听牌。"
  },
  {
    "id": 655,
    "cards": "222566m56p233457s",
    "answer": "5m",
    "tips": "这手牌根据麻将口诀,一对先定将,所以这手牌应该打掉5万。可以进47筒,146条,一共5门牌。"
  },
  {
    "id": 656,
    "cards": "12234447p335679s",
    "answer": "2p",
    "tips": "这副牌我们应该打掉2筒。这手牌是典型的四搭牌，缺搭子，我们需要靠张能力强的单牌重新去组搭子，然后再用到我们经常说到的口诀，有将打边肚，无将打大肚，打掉大肚牌型中的2筒就可以了。"
  },
  {
    "id": 657,
    "cards": "566777m445p13888s",
    "answer": "5p",
    "tips": "根据麻将口诀,两对拆搭,所以正确打法应该是打掉5筒,保留万子的321牌型,打掉5筒后,可以进2条、4筒、45678万一共七门28张,减去手牌的8张,还有20张进牌机会。"
  },
  {
    "id": 658,
    "cards": "44455567m1238p25s",
    "answer": "2s",
    "tips": "这手牌是一个一对三单的牌型,要注意重复进张,如果打8筒的话,保留25条来做靠张一上听,3条和4条是重复进张,所以这样的话效率会降低很多,所以像这种一对三单靠张一上听的牌,就不要保留条子一门花色的,特别是有重复进张的,所以应该打掉2条,因为5条的进张能力是比2条要更强的。"
  },
  {
    "id": 659,
    "cards": "11334m123p344567s",
    "answer": "4s",
    "tips": "这手牌根据口诀三对拆一对,如果打掉3万后碰牌,我们大概率只能听25万的叫口,打掉4条只要我们碰牌,就可以听258条的叫口,所以正确打法就是打掉4条。"
  },
  {
    "id": 660,
    "cards": "677888m44479p334s",
    "answer": "4s",
    "tips": "这手牌如果打7万的话,进牌有8筒、235条、58万,总共是6门24张,减去手里的5张,还有19张牌的进牌机会,正确打法应该打掉4条,进牌有8筒、3条、56789万,总共是7门28张,减去手里的8张,还有20张牌的听牌机会,所以打4条才是最大几率打法。"
  },
  {
    "id": 661,
    "cards": "35m11456p1135666s",
    "answer": "5s",
    "tips": "这手牌考虑拆对子还是拆搭子,由于听牌前,两对子的进牌效率是大于坎搭,因此这手牌只能考虑从35条和35万之间拆掉一张牌,如果拆35万,丢4万进张,如果拆35条,丢的是4条的进张,看似区别不大,但是值得注意的是,当前进牌几率相差不大时,就要考虑是否后续对优化有帮助。所以正确打法应该打5条,剩下的3条还可以和1条的对子组成进2条的搭子。"
  },
  {
    "id": 662,
    "cards": "3477789m1123457s",
    "answer": "7s",
    "tips": "这副牌是典型的六搭牌,正确打法是打掉7条,可以把牌打成两对半,进136条、进25万、进8万,共6门牌的进张。"
  },
  {
    "id": 663,
    "cards": "13556p123334678s",
    "answer": "1s",
    "tips": "这手牌打1条或4条,都是正确的打法,可以进247筒、3条、5筒,5门牌，一进听牌。"
  },
  {
    "id": 664,
    "cards": "111566m56p233457s",
    "answer": "5m",
    "tips": "根据麻将口诀,一对先定将,所以这手牌应该打掉5万。可以进47筒,146条,一共5门牌。"
  },
  {
    "id": 665,
    "cards": "34m3444567p34567s",
    "answer": "3p",
    "tips": "这手牌只能在3筒和4万里面做选择，如果打3筒,进2345678条、2345万都可以听牌,总共11门牌。如果打4万进3万、258条、2358筒都可以听牌，总计8门牌。因此这手牌打3筒才是最佳打法。"
  },
  {
    "id": 666,
    "cards": "4568m233789p2456s",
    "answer": "2p",
    "tips": "分析牌型后,这手牌是一对3单的牌型,要注意单张的靠张能力,正确打法应该是打掉2筒,因为2筒保留的话它的进张能力是1234筒,保留8万的话,进张能力是36789万,2条的进张能力是12347条,对比下来只有2筒的靠张能力最差,所以应该打掉2筒。"
  },
  {
    "id": 667,
    "cards": "11577m11123p5688s",
    "answer": "5s",
    "tips": "这手牌是典型的六搭牌,需要拆掉一搭，所以正确打法应该是打掉5条,因为后续如果摸上7条,也不会浪费,并且手牌变成了五搭牌。"
  },
  {
    "id": 668,
    "cards": "236789p23345667s",
    "answer": "9p",
    "tips": "这手牌打2条,3条做将牌,只能进58条、14筒,4门牌。打3条,可以进1469筒、6条,5门牌。打6条,也是一样的效果。打6筒,可以进14筒、1458条、36条,共8门牌进张,所以打掉69筒是正确的。"
  },
  {
    "id": 669,
    "cards": "45566m2377789p34s",
    "answer": "3s",
    "tips": "这手牌45566万,要拆分成456万一个成牌和56万的搭子,77789筒,要看成一个成牌跟一个对子,如果把777筒看成一副成牌,拆掉89筒的话,这手牌变成了两进听,56万双面搭要保留,如果牌面出6万或者7筒,碰牌后给手牌打成两对半,麻将口诀早拆中间晚拆边,这手牌前期拆34条搭子。所以正确答案出掉3条。"
  },
  {
    "id": 670,
    "cards": "3477789m78p11557s",
    "answer": "9m",
    "tips": "根据麻将口诀一对定将,两对拆搭。这手牌是典型的两对牌型,两个对子只能拆搭子,打掉89万是最好的选择,进1条,5条可以做将,进56条，1条可以做将，拆89万还有扛7万的机会。正确答案打掉9万。"
  },
  {
    "id": 671,
    "cards": "13m11157799p5779s",
    "answer": "5s",
    "tips": "这手牌根据六搭拆搭原理,779条看成一搭,打掉5条我们把牌打成了五搭牌,只丢失一个6条的进张。打57筒,拆13万,都不能让牌更进一步,还是六搭牌。所以正确打法是打掉5条。"
  },
  {
    "id": 672,
    "cards": "22367m11124p6899s",
    "answer": "6s",
    "tips": "根据麻将口决,六搭拆搭,正确打法是打掉6条。首先不能打4筒,因为摸来3筒,会多一个1筒的对子,整手牌变成了3个对子,最后很可能听到对倒胡上面。打6条不丢7条的进张，所以正确打法是打掉6条。"
  },
  {
    "id": 673,
    "cards": "13567m1388p23788s",
    "answer": "1p",
    "tips": "这手牌很简单,只有两个选择，拆13筒或者拆13万,正确打法拆掉13筒,因为摸来4万的话,万子可以改良成258万的进张,当然摸来2万更好。所以正确答案打掉1筒。"
  },
  {
    "id": 674,
    "cards": "11234566m234566p",
    "answer": "1m",
    "tips": "拿到这手牌先分解手牌，123万、456万、234筒或345筒，3个成牌加一个6筒的对子，一对三单的牌型。首先四连牌型肯定不打，打6筒,进147筒、147万、6万,共7门进张。打6万,进1234567筒,147万,共10门牌。打1万进1234567筒、345678万，共13门牌,所以正确打法是打掉1万。"
  },
  {
    "id": 675,
    "cards": "233m245667p67999s",
    "answer": "2m",
    "tips": "这手牌很简单,我们只能在2万跟2筒里面选择一张,打掉2筒会丢掉一个3筒的进张,只能进58筒、58条4门进张。打掉2万,我们可以进358筒、58条5门进张,所以打掉2万是正确的。"
  },
  {
    "id": 676,
    "cards": "3445789m116p2336s",
    "answer": "6s",
    "tips": "这手牌打4万,进25万,36万,都能形成一个双面搭,所以我们不能打掉这个大肚子的4万。因为我们手里还有6筒、6条的孤张,所以这手牌,我们只能在6筒跟6条里选,很明显6条跟3条有重复进张，所以这手牌我们打掉6条是正确的。"
  },
  {
    "id": 677,
    "cards": "1233367m3467899s",
    "answer": "1m",
    "tips": "这手牌,12333万,我们可以看成一个成牌123万加一个3万对子,这手牌不缺对子,所以我们要把好的机会给到好的搭子,所以我们要在34条、67万、12万，3个搭子之间拆掉一搭,正确打法是拆掉12万,把机会给到34条,67万这两个好的搭子,来了3万我们还能杠。所以正确答案打掉1万。"
  },
  {
    "id": 678,
    "cards": "246m1244789p1367s",
    "answer": "1s",
    "tips": "这手牌打掉1筒看起来不丢3筒,整个手牌推进成五搭,但是要注意手牌只有一对4筒。如果这个牌打掉1筒，摸来3筒整个牌型没有推进,还是需要再进两张牌才能听牌,打1条保留3条做靠搭改良,摸来24条改良，又要去拆12筒。如果先进张3筒,我们打掉3条。牌面出4筒的话，我们要选择碰牌,后期去做四人抬轿改良。所以正确答案打掉1条。"
  },
  {
    "id": 679,
    "cards": "11134778m344568s",
    "answer": "8m",
    "tips": "这手牌根据麻将口诀一对定将,打掉8万是最正确的,可以进257条、25万、共5门进张,一对定将的牌就是两进听牌的情况,如果打掉8条,摸来69万,我们不仅不能听牌,还没有了对子,所以正确打法是打掉8万。"
  },
  {
    "id": 680,
    "cards": "3688899m2345567p",
    "answer": "6m",
    "tips": "这手牌9万是将牌,那这手牌就是一个对子加3个单张,我们要考虑5筒、3万、6万，3个单张的靠张能力,6万进45678万,我们有3个8万,所以正确打法是打掉6万。"
  },
  {
    "id": 681,
    "cards": "22356789p344788s",
    "answer": "3p",
    "tips": "这手牌在3筒,3条,7条中打掉一张,因为23筒跟56筒有重复的进张4筒,所以打3筒丢张比打3、7条丢张要少，这手牌正确答案打掉3筒。"
  },
  {
    "id": 682,
    "cards": "2466788m2488p123s",
    "answer": "2m",
    "tips": "这是一个六搭牌型,把2468万看成一个四连。打掉2万,变成了五搭牌,可以摸57万,来6万可以碰,来了8万也可以碰8万,24筒不能打,打了24筒,还是六搭牌,所以打掉2万是正确的。"
  },
  {
    "id": 683,
    "cards": "1145599m2334568s",
    "answer": "8s",
    "tips": "这手牌打掉8条,可以保持手上四对牌型,再摸一对可以做小七对,摸来7条也不丢张,1万9万也容易碰出。所以这手牌打8条是正确的。"
  },
  {
    "id": 684,
    "cards": "13579p123444788s",
    "answer": "7s",
    "tips": "根据麻将口诀,一对先定将,正确打法应该先打掉7条,可以进2468筒听牌。"
  },
  {
    "id": 685,
    "cards": "445m13888p566777s",
    "answer": "5m",
    "tips": "这手牌像777665条这种321牌型我们不能打掉,它的进张有45678条,5门牌,但是我们的321牌型进5门牌,都只能组成2个搭子,没有对子,那么我们的4万就必须用来做将,打5万就可以了,留下5万我们只能进346万3门牌组成一个搭子,保留条子的321牌型,打掉5万后,我们可以进2筒、4万、45678条一共7门28张,减去手牌8张,还有20张进牌机会。打5万我们最高效。"
  },
  {
    "id": 686,
    "cards": "112456668m46999p",
    "answer": "2m",
    "tips": "这手牌的正确打法应该是打2万,因为打8万会丢失7万的进张,打2万并不会丢失3万的进张,并且可以进5筒,367万听牌。"
  },
  {
    "id": 687,
    "cards": "112334m5666p6678s",
    "answer": "3m",
    "tips": "这手牌是典型的一对三单牌型,万子成牌可以固定成234万,把整手牌看成234万、3个6筒、678条、一对1万，一对三单的牌型,我们在3万、6条、5筒当中选择靠搭能力最差的一张,要注意搭子的一个传递,合理的打法应该是打掉这张3万。"
  },
  {
    "id": 688,
    "cards": "2226678m1113489s",
    "answer": "6m",
    "tips": "这手牌正确的打法,应该是打掉6万,把手牌打成无将一上听,四人抬轿的牌型,可以进2345789条,总共7门28张,减去手牌4张,一共24张进张机会,比打掉9条和4条,多了7张牌的进张机会。"
  },
  {
    "id": 689,
    "cards": "3557m237899p3457s",
    "answer": "9p",
    "tips": "这手牌只有四搭牌，一对5万、345条、789筒、23筒。根据五搭牌原理少了一搭,就要想办法凑一搭牌,7条是衍牌，靠搭能力强，3、7万根据麻将口诀金三银七，靠搭能力也很强，很明显9筒凑搭子能力最弱。所以正确答案打掉9筒。"
  },
  {
    "id": 690,
    "cards": "22357888p234678s",
    "answer": "3p",
    "tips": "这手牌打掉一张后直接听牌,考虑到后续改良可能性,正确打法应该打掉3筒,如果后续再进2筒,就可以改良成7888筒,听3门的牌型。"
  },
  {
    "id": 691,
    "cards": "45579m2256p12257s",
    "answer": "9m",
    "tips": "这手牌手上三对牌,但是听牌还很远,所以不能拆对。优先考虑打掉卡张搭子,所以主要在9万和7条中选择,打7条,进6万成两面搭子,但是有45万在,6万出现有效牌重复,打9万,进48条成两面搭子。打9万进张比打7条进张更多，所以正确答案打9万。"
  },
  {
    "id": 692,
    "cards": "258m444p11145699s",
    "answer": "5m",
    "tips": "这手牌根据麻将口诀147打小,258打中,369打大，所以258牌型要打中。因为打掉2、8万。分别有67万、34万有效牌重复问题，少了4张听牌机会。打5万,进3万、7万都可以听两面牌,不存在丢失两面听情况。"
  },
  {
    "id": 693,
    "cards": "445667m23566788p",
    "answer": "6p",
    "tips": "打掉8筒的话,6万他就成了一张废牌,4万要做将牌,23筒跟这边的56筒他有重复进张,所以这个牌型我们打掉6筒呢,会更加高效。"
  },
  {
    "id": 694,
    "cards": "55m1124677p24699s",
    "answer": "4p",
    "tips": "根据麻将口诀六搭拆搭,咱们打掉这张4筒,是正确的。我们要去做减法拆搭子,这个7筒就不能打,而且会丢掉两个碰7筒的机会,你打掉这个6筒会丢5筒,打掉2筒会丢3筒,不打4筒,只能进来13578筒,打掉这张4筒,也是一样摸进13578筒,所以打4筒不丢张,可以把手牌打成五搭牌。"
  },
  {
    "id": 695,
    "cards": "11166789m223378s",
    "answer": "3s",
    "tips": "这个牌型,6万肯定是拿来做将的,打掉3条是正确的,3条打掉之后,碰了2条我们可以直接听69条,打掉3条越多,别人打掉12条的机会就更多,摸进来14条也可以听69条。"
  },
  {
    "id": 696,
    "cards": "3456999m78p12234s",
    "answer": "3m",
    "tips": "这手牌是一进听的牌型,打掉2条的话,我们只能进14条、69筒、36万，6门牌的进张可以听牌。打掉1条,可以进来36万、36筒、25条也是6门牌进张可以听牌,这个牌型我们打掉这张3万才是最高效的打法,为什么打掉这3万，不去打6万？因为麻将里面有一个筋线牌理论,筋线牌理论讲的是什么？369他是一条线,258是一条线,147是一条线,打掉6万，别人6789的牌型，就会跟你的臭张6万，吊出9万的机会就很小,所以正确打法是打掉3万,可以进来12345条、6789万9门牌的一个进张,这里是9门牌,比打12条6门牌多了3门牌的进张。"
  },
  {
    "id": 697,
    "cards": "222388p11145889s",
    "answer": "3p",
    "tips": "这手牌很简单,直接打掉3筒就可以了,留下3筒摸来14筒会多出两张2筒,还要三对拆一对,没有必要。打9条会丢掉7条的进张,所以正确答案打掉3筒。"
  },
  {
    "id": 698,
    "cards": "2356778m23789p33s",
    "answer": "2m",
    "tips": "这手牌根据丢张最少原则，打掉2万,只会丢一个1万的进张,保留469万3门牌的进张,也做到了六搭拆搭,如果打掉2筒的话，会丢14筒的进张,所以这手牌打掉2万。"
  },
  {
    "id": 699,
    "cards": "2245m33356p33467s",
    "answer": "5m",
    "tips": "根据六搭拆搭,打4条没有做到六搭拆搭,打掉5万只丢失了一个6万的进张,做到六搭拆搭,224万也是一搭牌,33467条,摸进来8条还有25条的进张,打掉5万是正确的。"
  },
  {
    "id": 700,
    "cards": "11267m258p234888s",
    "answer": "5p",
    "tips": "根据麻将口诀147打小,258打中,369打大,所以打掉5筒是正确的。2筒靠张1234筒,8筒靠张6789筒,打5筒只丢张了5筒的进张,打2筒丢12筒,打8筒丢89筒。2万不能打,会丢失3万的进张,打麻将要灵活运用,不能只记得一对先定将,这个牌型后期摸进来28筒、摸进来69万,都可以定将。"
  },
  {
    "id": 701,
    "cards": "45578m234788p445s",
    "answer": "4m",
    "tips": "这手牌是典型的五搭牌型,3个对子,但不能三对拆一对,三对拆一对的前提是能一进听或者二进听，这个牌型要三进才能听牌,所以不能三对拆一对,455万跟78万有一个重复的进张6万,打掉4万只丢失一个3万的进张,还有一个碰5万的机会能做到二进听牌,打麻将要灵活运用，所以这手牌正确答案打掉4万。"
  },
  {
    "id": 702,
    "cards": "111222m57889p335s",
    "answer": "8p",
    "tips": "这手牌是一对三单靠张一上听牌型，一对三条,5筒、8筒、5条，3张单牌靠张一上听,因为8筒的靠张能力最差,所以打掉8筒是正确的。"
  },
  {
    "id": 703,
    "cards": "2345m336778p2234s",
    "answer": "2s",
    "tips": "这是一个典型的四搭牌型,缺少搭子,2234条是边肚牌型,只有摸进来25条才有用,6778筒的进张能力是456789筒,2345万的进张能力是1234567万,所以打2条是最优的打法。"
  },
  {
    "id": 704,
    "cards": "556m4556p3445667s",
    "answer": "5p",
    "tips": "这手牌34条,67条是双面搭,所以这手牌不缺搭子,如果留下5筒，摸进来34567筒的任意一张,这手牌就变成了六搭牌,还要拆搭子,打掉5筒我们可以进258条一进听牌,如果摸来457万,我们可以把牌改良成一个四人抬轿,所以打掉5筒是正确的。"
  },
  {
    "id": 705,
    "cards": "12234447p335679s",
    "answer": "2p",
    "tips": "这是一个靠张一上听的牌型,打掉靠张能力最弱的牌,7筒是中间张，可以进56789筒听牌,所以不能打。9条在33567条的带动下可以进34789条,根据麻将口诀,金三银七臭二八,所以打掉2筒是最正确的。"
  },
  {
    "id": 706,
    "cards": "2488899p3588999s",
    "answer": "2p",
    "tips": "这手牌打掉2筒，因为24筒只能摸进来3筒才有用,35条可以进4条,进67条可以靠张8条。所以24筒的搭子后期改良能力不如35条。打掉2筒是正确的。"
  },
  {
    "id": 707,
    "cards": "2226778m2457789s",
    "answer": "7m",
    "tips": "这手牌根据麻将口决,无将打大肚,把大肚牌型里的7万打掉就可以了。"
  },
  {
    "id": 708,
    "cards": "13m11157799p5799s",
    "answer": "5s",
    "tips": "这手牌是六搭拆搭，打掉5条把六搭牌拆成五搭牌，799条形成一搭，还可以保留4个对子，后续摸来一个对子，还有做大牌的机会，打掉5条是正确的。"
  },
  {
    "id": 709,
    "cards": "1223467m3334889p",
    "answer": "4p",
    "tips": "这手牌正确打法应该是打掉4筒，如果进78筒，牌型就变成了一进听牌的牌型，同时也是四人抬轿牌型，如果没有进78筒，也可以进1458万快速听牌。"
  },
  {
    "id": 710,
    "cards": "12378m2244p78999s",
    "answer": "4p",
    "tips": "根据麻将口诀,三对拆对,最佳打法应该是24筒所以选D,打4筒后,可以碰出2筒或者摸进3筒都可以听牌69万,摸进69万后,也可以胡69条摸进69条,也可以胡69万,并且就算杠了9条还有一对2筒做将。"
  },
  {
    "id": 711,
    "cards": "113557p11234678s",
    "answer": "5p",
    "tips": "这手牌的正确打法应该是打掉5筒，进1条、1246筒总共5门20张，减掉手上的4张，一共16张的进牌机会可以听牌。比打7筒多了两张，并且保留了两对3连坎牌型，是最优打法。"
  },
  {
    "id": 712,
    "cards": "34999m222468p334s",
    "answer": "4s",
    "tips": "这手牌根据麻将口诀，一对先定将，因此正确打法应该是打掉4条，专心优化万子和筒字的搭子。"
  },
  {
    "id": 713,
    "cards": "234m2337p2225667s",
    "answer": "2p",
    "tips": "这手牌根据麻将口诀，“一对先定将”，如果打掉7筒的话，可以进1234筒、45678条，总共9门36张，减去手牌7张，还有29张的进牌机会。打掉6条的话，可以进123456789筒，总共9门36张，减去手牌4张，还有32张进牌机会。但是打2筒的话，可以进45678条、356789筒，总共11门44张减掉手牌7张，还有37张进牌的机会。所以正确答案打掉2筒。"
  },
  {
    "id": 714,
    "cards": "22m2356778p23777s",
    "answer": "2p",
    "tips": "这手牌正确打法应该打掉2筒，因为打掉2筒后可以进469筒听牌，而打掉其他的牌，进张只有2门。"
  },
  {
    "id": 715,
    "cards": "13556p122234778s",
    "answer": "1s",
    "tips": "这手牌还没有那么快听牌，考虑打掉哪张不容易损失更多的进张机会，如果打34条，损失2条和5条两门的机会，如果把手牌看成234条一副成牌，我们手牌的一副成牌加三对，要保证五搭牌的完整性，我们不应该去拆13筒，我们能打的只有在1条、6筒、8条中间做选择，合理的打法是打掉这张1条，打1条丢1门3条，但是打其他两张丢2门牌，打1条丢张最少。所以正确答案打掉1条。"
  },
  {
    "id": 716,
    "cards": "236799m555p34467s",
    "answer": "6m",
    "tips": "这手牌应该拆搭不拆对，所以要在3条和6万当中进行选择，当拆牌后影响进牌几率相差不大时，就要考虑后续手牌的优化，因为这手牌留下3条，还有一个摸进5条形成五连顺的几率，所以正确打法应该打掉6万。"
  },
  {
    "id": 717,
    "cards": "236899p11124788s",
    "answer": "6p",
    "tips": "这手牌手里有六搭牌，需要拆掉1搭，24条或者68筒，都是卡张，我们要考虑拆掉一张后，剩下的一张有没有丢失作用，打掉4条，进3条，还是六搭牌。如果打掉6筒，我们不丢张，进7筒可以打掉9筒。所以正确答案打掉6筒。"
  },
  {
    "id": 718,
    "cards": "34666888m223468s",
    "answer": "2s",
    "tips": "这手牌如果打2条，可以进678条、1234万，总共7门牌；如果打8条，可以进256条、25万，总共5门牌，所以这手牌正确打法应该打掉2条。"
  },
  {
    "id": 719,
    "cards": "4568m244789p2456s",
    "answer": "2p",
    "tips": "这手牌分析牌型后，手牌是一对3单的牌型，要注意单张的靠张能力，正确打法应该是打掉2筒，因为2筒保留的话，它的进张能力是1234筒；保留8万的话，进张能力是36789万；2条的进张能力是12347条，对比下来只有2筒的靠张能力最差，所以应该打掉2筒。"
  },
  {
    "id": 720,
    "cards": "5677888m123p5678s",
    "answer": "8s",
    "tips": "这手牌是标准的四面听牌型。考验的是怎么样听牌更宽？atccddd牌型，a不为1和d不为9，可以听4张牌，所以打5条或8条，听4769万。"
  },
  {
    "id": 721,
    "cards": "2345568m79p22399s",
    "answer": "8m",
    "tips": "这手牌根据麻将口诀“六搭拆搭”，打掉8万丢张最少，所以正确答案打掉8万。"
  },
  {
    "id": 722,
    "cards": "4556799p1156789s",
    "answer": "9p",
    "tips": "这手牌打5筒，进89筒、147条都可以听牌，其中进89筒和1条3门牌可以形成两面听。进张20-5=15张机会；打9筒，进368筒、47条可以听牌，进张数20-2=18张。而且进张就是形成两面听，所以打掉9筒是正确的。"
  },
  {
    "id": 723,
    "cards": "2477999m2467p111s",
    "answer": "2p",
    "tips": "这手牌根据六搭拆搭原则，为什么拆24筒而不是24万？因为拆24万的话，如果来了5筒，和67筒有重复进张；摸进来3筒，还要再拆24万。所以打掉2筒最佳。"
  },
  {
    "id": 724,
    "cards": "233444m11357p233s",
    "answer": "3s",
    "tips": "这手牌里的321牌型靠张能力是最强的，可以进12345万形成两副成牌，所以不能拆。321牌型成将的能力也是超强的。打3条只损失2张3条进张。打其他牌丢张至少都是4张。所以打出3条为正确答案。"
  },
  {
    "id": 725,
    "cards": "11134m344568p778s",
    "answer": "8s",
    "tips": "这手牌根据麻将口诀“一对先定将”。打出8条，进张机会为257筒、25万，20张-1=19张进牌机会。所以正确答案打掉8条。"
  },
  {
    "id": 726,
    "cards": "45666m2377p56777s",
    "answer": "7p",
    "tips": "这手牌先分解手牌，按照成对搭原则，456万1搭、567条1搭、一对6万、一对7条、一对7筒、一个23筒双面搭。然后根据麻将口诀“三对拆一对”。打出7筒只损失2张7筒碰出的机会。打其他牌损失进张数都大于2张。所以正确答案打掉7筒。"
  },
  {
    "id": 727,
    "cards": "4455m13456999p22s",
    "answer": "1p",
    "tips": "这是个进张一上听的牌型，进张概率最大的是36万8门牌。这就是利用连对牌型，进36万听36万，而不是拆掉45万来胡卡2筒。所以正确答案打掉1筒。"
  },
  {
    "id": 728,
    "cards": "2267m35567p45789s",
    "answer": "5p",
    "tips": "这手牌利用麻将口诀“六搭拆搭”，多搭了需要拆掉1搭，只能拆35筒卡张搭子，但是先要打5筒预防摸回4筒。正确答案打掉5筒。"
  },
  {
    "id": 729,
    "cards": "445m22779p234789s",
    "answer": "4m",
    "tips": "这手牌根据麻将口诀“三对拆一对”，2筒最容易碰出，所以不打2筒。保留质量最好的搭子做为听口，很明显最好的听口就是36万的双面听。所以正确答案打掉4万。"
  },
  {
    "id": 730,
    "cards": "2233478m1227778s",
    "answer": "8s",
    "tips": "这手牌根据五搭牌原理，如果8条和7条组成搭子，进689条都会变成六搭牌，对手牌没有帮助。打出8条，形成五搭牌；进1469万可以听牌；进3条打2条、进2条打1条，都能形成8门全开的四人抬轿。所以正确答案打掉8条。"
  },
  {
    "id": 731,
    "cards": "13m1135p22257799s",
    "answer": "5p",
    "tips": "这手牌根据麻将口诀\"六搭拆搭\"，打出5筒，丢张最少，3筒还可以靠搭1对1筒，把牌推进成5搭牌。所以正确答案打掉5筒。"
  },
  {
    "id": 732,
    "cards": "2233789p4556788s",
    "answer": "3p",
    "tips": "我们手牌处于一进听时要考虑有效进张，打掉5条只能进1234筒听口较好；打掉3筒可以进124筒、368条都可以得到双面听。所以正确答案打掉3筒。"
  },
  {
    "id": 733,
    "cards": "23788m1377p34579s",
    "answer": "1p",
    "tips": "这手牌是六搭牌，根据六搭牌原理“六搭拆搭”，拆掉79条或是13筒，而1和9的优化能力是最差的。所以先打1筒或是9条。"
  },
  {
    "id": 734,
    "cards": "46778m666p345679s",
    "answer": "4m",
    "tips": "这手牌是无将一上听的牌型，需要靠对，同时只有四搭牌，需要靠搭改良，所以打掉孤张4万。9条不能打，来了8条，再打掉7万，可以改变成369条的听口。正确答案打掉4万。"
  },
  {
    "id": 735,
    "cards": "33356m4467p22356s",
    "answer": "7p",
    "tips": "这手牌属于六搭牌，根据六搭牌的两对拆搭原理，需要拆一个搭子，打7筒只损失8筒4个进张，拆其他搭子会损失两门牌8个进张。所以正确答案打掉7筒。"
  },
  {
    "id": 736,
    "cards": "2466788m2488p123s",
    "answer": "2m",
    "tips": "这手牌首先将678万看成一副成牌，万子剩下2468万四连坎，如果我们拆24筒的话，我们只能摸来2万、7万两门牌一进听，但是打出2万，可以摸来57万、3筒3门牌听牌。打出8万，我们可以进张35万、3筒3门听牌，合理的打法是打掉28万其中一张。"
  },
  {
    "id": 737,
    "cards": "3566679m1245667p",
    "answer": "9m",
    "tips": "这是六搭拆搭的牌型，有朋友会去想打掉1筒，不丢3筒。摸来3筒，打6筒打成35万、79万的四人抬轿。但是朋友们要注意，我们这手牌是缺对子的，我们分解手牌应该567万一副成牌加一对6万，这么分解以后，打出9万，我们摸来3筒是直接听牌58筒的，金3银7臭28，打出9万，保留3万。所以正确答案打掉9万。"
  },
  {
    "id": 738,
    "cards": "137m4457789p1244s",
    "answer": "1s",
    "tips": "这手牌根据麻将口诀“金3银7臭28”，保留7万，如果来68万，可以优化成两面搭。打1条没有丢张，进来3条依然有用，手上还有五搭牌。所以正确答案打1条。"
  },
  {
    "id": 739,
    "cards": "56789m2366678p56s",
    "answer": "5s",
    "tips": "这手牌需要判断搭子的价值，进边缘牌的搭子价值高于进中心牌搭子的价值，所以优先拆掉56条。所以正确选项打掉5条。"
  },
  {
    "id": 740,
    "cards": "11122335677899s",
    "answer": "9s",
    "tips": "这手牌打1条能听69条，但是打掉9条可以听1234条。所以打掉9条最佳。"
  },
  {
    "id": 741,
    "cards": "2223444m1234567p",
    "answer": "1p",
    "tips": "这手牌很多人会打掉3万，胡147筒。共12-3=9张胡牌机会。但打1筒，胡12345万，20-7=13张胡牌机会。而且3个2万和3个4万对3万形成了封闭效果。故打1筒为正确答案。"
  },
  {
    "id": 742,
    "cards": "1124889p3445689s",
    "answer": "9s",
    "tips": "这手牌根据麻将口诀“先拆边后拆卡”，先拆边搭9条，边张搭子不具备改良空间。所以正确答案打掉9条。"
  },
  {
    "id": 743,
    "cards": "23m112334p344567s",
    "answer": "3p",
    "tips": "这手牌是复合型牌型，112334筒，成牌可以固定成123筒，也可以固定成234筒，这手牌打3筒丢25筒，注意牌型搭子的一个传递，打3条丢258条3门牌，根据丢张最少原则，合理的选择是打掉3筒。"
  },
  {
    "id": 744,
    "cards": "2334m56689p12778s",
    "answer": "9p",
    "tips": "这手牌根据丢张最少，进张最多原则，打出9筒不丢7筒的进张。可进牌有369条、12345万、467筒。所以正确答案打掉9筒。"
  },
  {
    "id": 745,
    "cards": "245667m23778p333s",
    "answer": "8p",
    "tips": "这副手牌很多朋友会选择打掉2万，但是根据麻将口诀在手牌处于一进听的情况下要一对先定将，应该打8筒，这样就会有358万、14筒的进张后直接听牌。正确答案打掉8筒。"
  },
  {
    "id": 746,
    "cards": "468m123888p57889s",
    "answer": "8s",
    "tips": "这手牌应该选择打掉8条，因为打8条后整手牌会变成无将一上听，摸进5条可以听牌，保留468万3连坎，摸进4578万也可以听牌。"
  },
  {
    "id": 747,
    "cards": "34456778m345557p",
    "answer": "7m",
    "tips": "这手牌是大多数新手容易犯错的一个牌型，选择打掉7筒，可以进25筒、245679万总共8门32张，减去手牌11张，一共有21张听牌的机会，但是这手牌我们来看看，打掉7万之后的进张，可以进256789筒、256789万总共12门48张，减去手牌9张，还有39张进牌机会，比打7筒效率更高，所以根据进张最多原则，应该选打掉7万。"
  },
  {
    "id": 748,
    "cards": "335667m2345p2234s",
    "answer": "2s",
    "tips": "这手牌很多麻友会打掉6万，这种就是典型的凭感觉在打，觉得6万没有用，夹在一个顺子里面看不顺眼，但是打了6万就丢了45678万的进张。这手牌缺一个搭子就能听牌，要去打2条，2234条是一个边肚牌型，它的靠搭能力较弱。所以正确答案打掉2条。"
  },
  {
    "id": 749,
    "cards": "999m1234p1345679s",
    "answer": "1p",
    "tips": "这手牌打1筒和4筒，进张机会为1到9条均可以听牌。进19条听258条、进2条听147条、进8条听369条、进3条听卡8条、进7条听卡2条、进4条打9条听卡2条、进6条打1条听卡8条、进5条打1条或9条单吊9条或1条。进张机会为4*9-7=29张。所以正确答案打掉1筒。"
  },
  {
    "id": 750,
    "cards": "123456m22235788s",
    "answer": "7s",
    "tips": "这手牌需要注意手牌的后期改良，打掉7条，后期如果碰8条就可以优化成14条带3条的3门听口。所以正确答案打掉7条。"
  },
  {
    "id": 751,
    "cards": "1334m6679p123789s",
    "answer": "1m",
    "tips": "这手牌有两副成牌，一个对子，3个搭子，打出1万不丢2万进张。但打出9筒，表面上没有丢8筒进张，但是来8筒，6678筒的6筒的将被破坏了。相当于打了9筒，7筒也废了，只能进25万听牌。而打出1万，手牌打成两对半，胜率比较高。有5门牌进张，进235万、68筒都可以听牌。所以正确答案打掉1万。"
  },
  {
    "id": 752,
    "cards": "345788p12344588s",
    "answer": "4s",
    "tips": "这手牌应该在788筒和445条之间进行拆对，如果打掉4条，可以进368条、689筒，总共6门牌19张牌；如果打8筒，可以进3468条、69筒，总共也是6门19张牌；考虑到8筒对子比4条对子更好碰出，所以应该拆445条的搭子直接打掉4条。"
  },
  {
    "id": 753,
    "cards": "34579m13789p3466s",
    "answer": "1p",
    "tips": "这手牌首先分解手牌，一共有6个搭子（分解顺序：成牌→对子→搭子，成牌345万、789筒，6条对子、34条，79万，13筒），六搭拆搭，拆13筒还是79万？因为7万来了6万可以形成五连牌型，来了2万可以形成579万的3连坎，优化空间比13筒大。所以拆13筒，正确答案打出1筒。"
  },
  {
    "id": 754,
    "cards": "11123456788999m",
    "answer": "1m",
    "tips": "还要打吗，再打不听牌啦！这个牌最正确的选择是倒牌，天胡，谢谢！"
  },
  {
    "id": 755,
    "cards": "234567m3578p3599s",
    "answer": "5p",
    "tips": "这手牌根据麻将口诀“六搭拆搭”，拆35条还是35筒？35条来26条可以优化成双面搭；35筒来2筒是双面搭，来6筒和78筒组成成牌，所以6筒是重复进张。所以建议拆35筒。是打3筒还是5筒？因为3筒进2筒是双面搭，5筒进6筒和78筒进张是重复的，所以正确答案打出5筒。"
  },
  {
    "id": 756,
    "cards": "223499m37p236678s",
    "answer": "2m",
    "tips": "拿到这手牌首先应该分解手牌，先找出手牌的病症。一共只有4个搭子（分解顺序成牌→对子→搭子，成牌:234万、678条，一对9万，23条，剩下4个单张。37筒、2万、6条），这手牌的病症是缺搭子。4个单张（37筒，2万，6条）组搭能力最弱的是2万（金3银7臭28），所以打出2万为本局正解。"
  },
  {
    "id": 757,
    "cards": "12378999p224478s",
    "answer": "4s",
    "tips": "这手牌是六搭牌型，两副成牌带三对，外加一个双面搭，拆掉4条只丢两张4条，牌型推进成五搭，来3条，24条可以靠搭，打掉4条丢张最少，只丢两张4条，2条边张对子好碰牌。所以正确答案打掉4条。"
  },
  {
    "id": 758,
    "cards": "25677m112888999s",
    "answer": "2s",
    "tips": "拿到一手牌，首先分解手牌，567万一副成牌，三个8条，3个9条，手牌一对1条，一对3单靠张上听，我们找出2万、7万、2条中靠搭能力最差的牌处理掉。2条靠搭1234条、7万靠搭56789万、2万靠搭1234万、2万和2条靠搭门数一样，但是2条旁边一对1条算两张重复进张，所以合理的选择是打掉2条。"
  },
  {
    "id": 759,
    "cards": "2345678m2333456s",
    "answer": "2m",
    "tips": "这种牌型可以形成单吊三面听。打258万，听1247条，有4x4-2=14张进张胡牌机会。而打出2条听258万，有3*4-3=9张进张胡牌机会。所以打258万，进张胡牌机会多了5张。正确选项打掉2万。"
  },
  {
    "id": 760,
    "cards": "333m346799p34899s",
    "answer": "6p",
    "tips": "这一手牌属于六搭拆搭的牌型。打掉6筒不丢张，来258筒、7条、25条都是可以优化的。正确答案打掉6筒。"
  },
  {
    "id": 761,
    "cards": "11236999m112334s",
    "answer": "1m",
    "tips": "这手牌属于靠张一上听的牌型，打掉靠张能力最弱的1万，其他牌都比1万靠张能力强。所以正确答案打掉1万。"
  },
  {
    "id": 762,
    "cards": "224578p11145899s",
    "answer": "5p",
    "tips": "这手牌应该打掉5筒。如果打掉8条，这牌依然是六搭牌，并且会丢掉7条的进张；而打掉5筒不会丢张，进来3筒可以组成234筒、进来6筒跟78筒可以组成一副成牌，并且打掉5筒剩下的4筒可以和2筒重新组搭，这手牌就改良成五搭牌了，所以应该打掉5筒。"
  },
  {
    "id": 763,
    "cards": "2345567m1112247p",
    "answer": "4p",
    "tips": "这手牌是一个一对3单的牌型，很明显2345万四连牌型可以进1234567万是不能动的，能选的就是打掉47筒其中的一张，打4筒不丢356筒的进张；打7筒会丢789筒的进张，所以正确答案打掉4筒。"
  },
  {
    "id": 764,
    "cards": "23346m111357p345s",
    "answer": "6m",
    "tips": "这手牌打出26万都可以形成一进听牌型。打2万，进5万、46筒可以听牌，进张机会为12，都是听卡张。打6万，进张机会为3万、246筒可以听牌，进张机会为16-2=14张进张机会。摸进6筒可以听23筒。并且打6万，保留了大肚牌型的手牌优化能力，摸1245万，打出7筒形成四人抬轿，进张机会更多。所以正确答案打掉6万。"
  },
  {
    "id": 765,
    "cards": "23667m113478p333s",
    "answer": "4p",
    "tips": "这手牌以不丢张丢少张为原则，打掉4筒只丢5筒的进张，拆其他任何搭子都丢两门的进张。所以正确答案打掉4筒。"
  },
  {
    "id": 766,
    "cards": "345699m33389p223s",
    "answer": "9p",
    "tips": "这手牌在牌局前期，36万一打，打成一进听，但是听牌大概率会在边7筒，所以前期我们要选择拆89筒，手牌3456万四连牌型改良空间很大，我们摸来2547万都可以预留双面听的改良，如果牌局中后期我们才会优先选择打掉36万保证最大的听牌率。所以正确答案打掉9筒。"
  },
  {
    "id": 767,
    "cards": "22888m22p2356778s",
    "answer": "2s",
    "tips": "这手牌根据五搭牌原理的六搭拆搭原则以及两对拆搭原则，不打2筒和2万，所以在23条和78条做选择。打78条会丢69条进张，打2条只丢1条进张。根据丢张最少进张最多原则，所以打出2条为最佳答案。"
  },
  {
    "id": 768,
    "cards": "345689m46788p111s",
    "answer": "4p",
    "tips": "这手牌打掉4筒最高效，这个牌4筒的作用是靠搭5筒，9万的作用是靠搭7万，打4筒不丢5筒，打9万也不丢7万，但是如果我们打掉4筒保留9万，摸来7万之后打出8筒，我们可以得到369万的三面听，打掉9万保留4筒摸来5筒，还是要去打掉47筒。所以正确答案打掉4筒。"
  },
  {
    "id": 769,
    "cards": "2388m6777p455679s",
    "answer": "6p",
    "tips": "这手牌我们要去判断搭子价值，保留价值高的搭子打掉价值低的搭子。很明显6筒的价值最低，打掉6筒保留的搭子进张都能听牌。所以正确答案打掉6筒。"
  },
  {
    "id": 770,
    "cards": "2334m124567p3678s",
    "answer": "3s",
    "tips": "这手牌很多朋友第一反应是打掉1筒（打1筒不丢3筒），但是分解手牌后可以发现，本局是缺将也缺搭子。打出1筒，进347筒还是缺1搭。不打1筒，进147筒都可以形成带将牌的五搭牌。那是打3万还是3条呢？有麻友说打3万，无将打大肚（2334万为大肚牌型），但本手牌不只缺将，也缺搭子。2334万是大肚牌型，进张能力是很强的，进来12345万都可以形成两个搭子。所以正确答案打掉3条。"
  },
  {
    "id": 771,
    "cards": "3578m24567p67889s",
    "answer": "3m",
    "tips": "这手牌是六搭牌型。缺对子。67889条是肯定不能打的。因为可进张为5到9筒。所以我们能打的是在35万、24筒中间选择一张。由于4筒可以和567筒形成4连牌型，所以只能打35万。打3万还是5万，5是78万的衍牌，缺对和缺搭子不打衍牌（本局是缺对）。所以只能打3万。"
  },
  {
    "id": 772,
    "cards": "789m4467p1235688s",
    "answer": "7p",
    "tips": "这手牌应该在7筒和5条中做选择，我们要注意手牌后期的优化。打掉7筒，如果摸来3筒，可以得到34筒和56条的两个双面搭；但是打掉5条，我们摸来9条，是一张无效牌。因为8条的边张对子改良空间很差，所以打掉7筒更合理。"
  },
  {
    "id": 773,
    "cards": "245667m223p23567s",
    "answer": "3p",
    "tips": "这手牌根据麻将口诀“一对定将”，打掉3筒，2筒做将，专心优化万子和条子的搭子。"
  },
  {
    "id": 774,
    "cards": "4467m888p1115688s",
    "answer": "7m",
    "tips": "这手牌根据麻将口诀“两对拆搭”，选择拆56条或是67万的搭子。因为打7万，来3万打6万可以形成好的两对半；而打5条来9条，无法和一对8条组成好搭子。这手牌主要是考虑后续牌优化问题。所以正确答案打掉7万。"
  },
  {
    "id": 775,
    "cards": "246678m4567p3345s",
    "answer": "3s",
    "tips": "这手牌4567筒是四连牌型，靠搭靠对能力最强肯定不打。把678万看成一副成牌。246万三连坎，比边肚牌型3345条进张要多，所以打掉3条，将手牌打成无将一上听。"
  },
  {
    "id": 776,
    "cards": "3456m4456p344588s",
    "answer": "4p",
    "tips": "这手牌根据麻将口决“有将拆边肚，无将拆大肚”，直接打掉4筒，我们的正确打法是打掉4筒，这手牌，我们有对子，缺的是好的搭子，如果我们打掉4条，我们只能进3筒、5筒才能形成双面搭听牌，最后我们很大根率会听在3万、6万的单吊将牌上面；留下4条我们可以进25条、36条4门牌，而且听口质量都不错。所以正确答案打掉4筒。"
  },
  {
    "id": 777,
    "cards": "22346778p223499s",
    "answer": "2p",
    "tips": "这手牌有两个边肚牌型，一个大肚牌型，这手牌不缺对子，有将拆边肚，正确打法是打掉2筒，因为34筒跟67筒有重复的进张5筒，留下2条，我们会多1门进张，所以正确打法是打掉2筒。"
  },
  {
    "id": 778,
    "cards": "36667889m134577p",
    "answer": "8m",
    "tips": "这手牌是典型的一对3单，1筒旁边有345筒，考虑到搭子的传递功能，1筒的靠张有1236筒，共4门牌。在1筒、3万、8万里面3万靠张能力是最强的，所以这手牌的正确打法是打掉8万，8万的靠张是6789万，我们有3个6万，8万最好的靠搭是摸7万听69万，其它的都是胡卡张，而69万我们手上已经就4张，所以我们正确打法是打掉8万。"
  },
  {
    "id": 779,
    "cards": "2377789m55667p45s",
    "answer": "4s",
    "tips": "拿到这手牌，首先分析手牌，像77789万这种牌，如果我们有其它的对子，我们考虑拆掉89万，但这手牌，55667筒，我们要看成567筒跟56筒2搭牌，也就是说，7万开了杠我们没有其它的对子，影响了手牌的推进，那么这手牌，77万就是一对定将，55667筒这种牌型进张非常多，56筒不能打，我们能拆的就是45条和23万，根据麻将口诀“早拆中间晚拆边”，在牌局前期我们打掉45条，在麻将后期看桌面的张再决定拆，23万或45条。大家要灵活运用。正确答案打掉4条。"
  },
  {
    "id": 780,
    "cards": "379m2257789p1244s",
    "answer": "1s",
    "tips": "这手牌属于六搭拆搭，打掉3万，我们还是六搭牌，而且3万后续优化成力非常强，所以3万不能打。这手牌正确打法是打掉1条，打1条不丢3条。并且预留了好的进张空间。"
  },
  {
    "id": 781,
    "cards": "235799p11124678s",
    "answer": "5p",
    "tips": "这手牌如果打2条，摸来8筒，我们会有4条、5筒、7筒，3个单张。打4条，摸来了5条，我们会丢掉45678条五连牌的效果，所以这手牌正确打法是打掉5筒，打5筒来了8筒，直接打掉9筒，23筒跟24条形成一个四人抬轿。四人抬轿我们可以进7门牌。就算不来8筒，9筒边张也比较好碰，来14筒，打掉4条，我们可以吊2条、边3筒。来3条，我们可以打掉4条，胡14筒。正确答案打掉5筒。"
  },
  {
    "id": 782,
    "cards": "45678m113445667s",
    "answer": "6s",
    "tips": "这手牌的正确打法是打掉6条，我们会形成14条的两对半牌型，留下14条的两对半，有更大机会碰出或进张。"
  },
  {
    "id": 783,
    "cards": "23789m2245p33588s",
    "answer": "2p",
    "tips": "这是典型的六搭拆搭的牌型，要把手牌推进成五搭牌的话，我们能选择的只有去拆2筒、拆8条，或者在23万和45筒里面去拆1搭，根据我们平时的拆搭思路，三对拆对的话是在手里有两副成牌的前提下，但是这个牌我们手里都是好的双面搭，根据丢张最少原则，要优先选择去拆掉2筒或者8条的对子，才能实现手牌最大的一个进张效率。实战中，遇到这种牌型，麻将口诀“三对拆对”我们要灵活运用，一进听时，我们肯定是三对拆对，但是不是一进听的情况下，并不是说我们不能拆对，朋友们要注意啦。正确答案打掉2筒。"
  },
  {
    "id": 784,
    "cards": "1112257p1122257s",
    "answer": "5p",
    "tips": "这手牌是六搭牌型，我们做减法处理成五搭，麻将口诀“两对拆搭”，我们在57条、57筒之间去做选择，同样卡6，搭子的价值是一样的，那我们就考虑后续的改良有没有区别，57条的改良牌型是4条和8条，57筒的改良牌是4筒和8筒，注意5条旁边3个2条本身是一副成牌，如果我们打掉5条，我们摸来4条的话，4条跟2条是无效靠搭，换言之，打5条丢4条，但是我们打掉5筒，如果摸来4筒的话，是可以形成224筒的一个有效靠搭，打5筒不丢4筒，合理选择应该是打掉5筒。"
  },
  {
    "id": 785,
    "cards": "123m22577p335678s",
    "answer": "3s",
    "tips": "这手牌是两副成牌带三个对子，典型的三对拆对的牌型，处理思路是拆成最好的搭子带对子，2筒边张对子优先考虑保留，目前来看拆3条和7筒没有区别，但是如果我们选择拆掉7筒，摸来679条的话，我们还是要继续去打出57筒搭子，手里剩一张5或者7筒，整个手牌没有形成两对半的牌型，但是如果我们选择打掉3条，摸来679条，我们再打掉3条，手牌会形成两对半加条子的双面搭，所以最合理的选择是打掉3条。"
  },
  {
    "id": 786,
    "cards": "12333789p334779s",
    "answer": "3s",
    "tips": "这个牌麻友们一看，手牌有37条两对，不缺对子，会想去打12筒，保留3筒杠牌的空间，但是注意，这个牌12筒一打，我们整个手牌是四搭牌，因此分解手牌时候，我们3个3筒要分解成一对3筒加123筒一副成牌，这样才保证手牌五搭的完整性，这么分解后，三对拆对，打出3条，拆成34条的双面搭，加一对3筒、一对7条带9条的两对半牌型。所以正确答案打掉3条。"
  },
  {
    "id": 787,
    "cards": "135m13578p234789s",
    "answer": "1m",
    "tips": "这手牌是5个搭子，不需要做加减法，我们分解手牌后发现，这个牌我们缺对子，135万和135筒怎么选择？135筒旁边有78筒加持，筒子有1357筒，四连坎，125万三连坎，根据缺对牌型，打短留长，所以直接打掉1万。"
  },
  {
    "id": 788,
    "cards": "556m4556p3445678s",
    "answer": "5p",
    "tips": "这个牌分解后，我们肯定是在5筒和6万里面做选择，估计很多朋友会一对定将去选择打掉这张6万，但是朋友们注意，我们有34条、78条的两个双面搭，这个牌我们不缺好搭子，保留5筒的靠搭能力强的大肚牌型没有用处，如果我们打掉6万定将，保留5筒做改良对牌型的推进没有意义。但是打掉5筒，保留6万，如果后续摸来47万，我们选择打掉5万，可以把牌型改良成四人抬轿。所以保留6万比5筒更有价值，正确答案打掉5筒。"
  },
  {
    "id": 789,
    "cards": "1235m1236p467889s",
    "answer": "6p",
    "tips": "这手牌分解手牌后，很明显这手牌缺对缺搭，我们要保留靠对靠搭能力强的牌。468条3连坎我们肯定不会去拆，我们剩下只有5万和6筒做选择，这个牌合理的选择是打掉这张6筒，保留5万，因为5万摸来4万的话可以形成12345万的五连牌型，五连牌型的靠对能力极强。所以正确答案打掉6筒。"
  },
  {
    "id": 790,
    "cards": "4478m5688p345779s",
    "answer": "4m",
    "tips": "这手牌根据六搭拆搭，很多朋友会选择打掉5筒，但是这手牌如果打掉5筒，我们很大概率会听在卡7筒、卡8条或两对倒的叫口上；9条也不能打，打9条，我们不仅还是六搭牌，还会丢掉4张8条的进张机会，如果碰了4万，或碰了7条，或碰了8筒，我们还是要拆一个对子，打9条我们没有把牌打成进一步，是把牌打成了退2步，所以9条不能打；我们的正确打法是打掉4万，打4万我们只丢2张4万的进张，8筒边张牌型，比4万要容易碰出。所以我们留下8筒的对子，这手牌的正确打法是打掉4万，朋友们，如果有得选择，我们一定要把牌听成好的叫口，这样我们才能更容易胡牌。"
  },
  {
    "id": 791,
    "cards": "245m12337p112378s",
    "answer": "7p",
    "tips": "这手牌我们不缺搭子，缺的是对子，所以我们留下摸对能力强的牌，打掉1条，我们会丢掉2张1条，4张4条一共6张牌；2万也不能打，我们进2万有2万的对子加45万的一个搭子；进5万我们有5万的对子加24万的搭子；进3万我们能形成2345万的四连牌型，麻将口决“缺搭缺对留四连”，四连牌型找将摸搭能力是极强的，所以2万也不能打。3筒也不能打，摸3筒，3筒一个对子加一个123筒一副成牌，摸2筒摸1筒，都可以形成两对牌牌型，两对半的牌型进张数量非常多，麻将口诀，“无将牌型打闲不打连”，所以这手牌我们打掉7筒是正确的。"
  },
  {
    "id": 792,
    "cards": "1244m379p2257789s",
    "answer": "1m",
    "tips": "这手牌有六个搭子，六搭拆搭，所以需要拆掉一个搭子。打掉1万，手牌变成五搭牌，页且不丢3万的进张。为什么不打闲张3筒呢？因为手上有2个卡张搭，3筒的孤张有优化成两面搭的潜力。这是拆搭养孤的典型例子。所以正确答案打掉1万。"
  },
  {
    "id": 793,
    "cards": "223489p12233478s",
    "answer": "9p",
    "tips": "这手牌打2筒可以组成四人抬桥，但打掉2筒，大概率会胡在单吊89筒或卡7筒的叫口上，而我们打掉9筒，100%的机会形成双面听的叫口。进258筒，胡69条；进69条胡25筒。所以正确打法是打掉9筒。"
  },
  {
    "id": 794,
    "cards": "899m2245p1112357s",
    "answer": "2s",
    "tips": "这手牌打8万不仅会丢掉7万进张，手牌也还是六搭牌，没有把牌打进一步；打5筒会丢掉6筒的进张；打7条会丢掉6条进张；打掉2条，不丢14条，把手牌打成了五搭牌，所以正确打法是打掉2条。"
  },
  {
    "id": 795,
    "cards": "344568m23667888p",
    "answer": "7p",
    "tips": "这手牌属于一进听牌型，我们应该一对先定将，正确打法是打掉7筒，可以进14筒，257万，形成双面搭叫口。"
  },
  {
    "id": 796,
    "cards": "1267999m3334789s",
    "answer": "1m",
    "tips": "这手牌如果打4条，3条可以开杠，13万、67万可以形成四人抬桥；但打掉4条，摸来5678万4门牌，只能单吊1万或2万，要么听边3万。所以打掉4条，大概率只能胡一张牌。打掉1万，摸35678万、245条，都可以听双面听或3面听，所以正确打法是打掉1万。"
  },
  {
    "id": 797,
    "cards": "246m2389p1115689s",
    "answer": "9p",
    "tips": "这手牌是六搭牌型，缺对子不确搭子，所以我们要留下靠对能力强的搭子。如果打掉9筒，56条、89条虽然有重复进张7条，但如果我们摸进来7条可以形成56789条，摸对能力最强的5连牌型，摸进5689条，4张牌任意一张都能形成一个对子加一个成牌。所以9条是肯定不能打的，打2筒都比打9条强，所以正确答案打掉9筒。"
  },
  {
    "id": 798,
    "cards": "3588899p3588999s",
    "answer": "5s",
    "tips": "这手牌打3筒，丢2筒、打3条，丢2条，能打的只能是5筒跟5条，为什么正确答案是5条呢？因为打5筒，我们摸进来67筒还是一张废牌，而打5条如果我们摸进来67条，可以跟一对8条组成搭子，由其摸进来7条，可以跟组成一对9筒，899条，完美的两对半。所以正确打法是打掉5条。"
  },
  {
    "id": 799,
    "cards": "24456m3478p22678s",
    "answer": "4m",
    "tips": "这手牌我们优先打掉4万，可以预留3万的进张，形成一个23456万的五连牌型。就算没有摸进来3万，我们进了25筒、69筒，再打掉2万。高手打麻将的思维，走一步，看3步，朋友们打麻将我们要灵活运用。"
  },
  {
    "id": 800,
    "cards": "2246999m3334579p",
    "answer": "6m",
    "tips": "这手牌9筒肯定不能打，打9筒我们会丢失超级两对半的牌型，打4筒不仅会丢掉3筒的碰出，我们的听口会落在卡5万，卡6筒，卡8筒的叫口上。我们打掉6万，可以进23万、368筒一共5门牌的进张；打6万，如果摸来8筒，我们可以听2万、36筒，三面听，所以正确打法是打掉6万。"
  },
  {
    "id": 801,
    "cards": "3445689p1124889s",
    "answer": "9p",
    "tips": "这手牌根据麻将口诀“六搭拆搭和先拆边后拆卡”。打4条我们会丢掉1条的碰出，打4条不仅没有把牌打成五搭牌，是把牌打退了2步。打9筒，我们不丢7筒的进张，也把牌打成了五搭牌，所以正确打法是打掉9筒。"
  },
  {
    "id": 802,
    "cards": "5688m333789p3356s",
    "answer": "6s",
    "tips": "这手牌，只能在5万跟6条之间去打掉一张，打5万丢4万；打6条丢7条。为什么打6条是正确的？因为打6条我们摸进来2条，可以改良成14筒；打5万，我们摸进来9万没有改良的空间。所以正确打法是打掉6条。"
  },
  {
    "id": 803,
    "cards": "999m3456p3456999s",
    "answer": "3s",
    "tips": "这手牌打3条，我们摸进来7条，旁边的9条可以承接，可以胡47条卡8条。比打其他牌多胡4张8条的机会。所以正确答案打掉3条。"
  },
  {
    "id": 804,
    "cards": "568m112378p37789s",
    "answer": "3s",
    "tips": "这手牌缺对缺搭，边肚牌型的1筒、7条不打；3条，只有摸3条才有用；8万可以进578万3门牌，尤其进了7万，可以听58万的听口，所以这手牌要留下这个8万，正确答案打掉3条。"
  },
  {
    "id": 805,
    "cards": "1233588m379p6689s",
    "answer": "9s",
    "tips": "这手牌的搭子的质量都很差，留下3筒做改良，打9条不丢7条进张。所以正确答案打掉9条。"
  },
  {
    "id": 806,
    "cards": "2367889p1367789s",
    "answer": "1s",
    "tips": "这手牌是缺对子的牌型，我们不打复合型牌，所以只能在13条中打1张，正确答案是先打1条。"
  },
  {
    "id": 807,
    "cards": "779m11378p345789s",
    "answer": "3p",
    "tips": "这手牌不需要改良，打3筒，有机会勾出1筒；779万，摸来6万可以把牌优化成677万。还有就是一对1筒没有改良空间，所以正确打法打掉3筒就可以了。"
  },
  {
    "id": 808,
    "cards": "3456999m1223478s",
    "answer": "3m",
    "tips": "这手牌打12条，进25条、69条、36万，6门24-4=20张的进牌，一进听牌；打36万，进1-9条都能听牌，9门36-7=29张，一进听牌，所以打36万进牌最多，先打3万。"
  },
  {
    "id": 809,
    "cards": "233m234777p12445s",
    "answer": "5s",
    "tips": "这手牌打1条，只有摸36条才能听牌，丢失了两对半牌型；打2万丢了14万；打5条只丢6条，所以正确打法就是打掉5条。"
  },
  {
    "id": 810,
    "cards": "12356m12345p3478s",
    "answer": "6m",
    "tips": "这手牌缺对子，15筒这种5连牌不能打掉，拆哪个搭子都会有丢张。打掉6万，摸来4万回头牌，我们可以组成12345万5连牌型，摸对能力非常强，所以打掉6万是最正确的打法。"
  },
  {
    "id": 811,
    "cards": "234789m22235788p",
    "answer": "7p",
    "tips": "这手牌打掉7筒，我们胡卡4筒，碰了8筒可以把牌优化成，134筒的听口。"
  },
  {
    "id": 812,
    "cards": "1355688p1355789s",
    "answer": "1s",
    "tips": "这手牌先不拆对子，打1筒，如果摸进来4条，我们就有3筒、1条、5条，3个单张都要打掉，整手牌就废了。所以正确打法是打掉1条。打掉1条，我们来4筒，345筒一副成牌，再打掉1筒，就变成了两对半牌型。所以正确打法就是打掉1条。防后悔张。"
  },
  {
    "id": 813,
    "cards": "2256789m1145578p",
    "answer": "5p",
    "tips": "这手牌有六搭牌，有3个对子，一副成牌。这手牌打2万、打5筒、打9万、打8筒，都是2进听牌。这手牌虽然没有2副成牌，一般情况下我们不拆对子，但这手牌，都是2进听牌，打了5筒确实还是六搭牌，但5筒的碰出概率很底，拆89万、拆78筒，对后续的牌有很大的丢张，这手牌，我们先拆5筒的对子就可以了。所以正确答案打掉5筒。"
  },
  {
    "id": 814,
    "cards": "1223457p1367889s",
    "answer": "1p",
    "tips": "拿到这手牌分析一下，首先条子不能打，留下13条、89条，我们可以一进听牌。那么能打的只能是1筒跟7筒，这手牌搭子质量太差，我们要留出7筒对牌型做改良，打掉1筒就可以了。"
  },
  {
    "id": 815,
    "cards": "4579m1236777p345s",
    "answer": "9m",
    "tips": "这手牌打6筒，我们可以进3-9万7门牌，而3458万4门牌都只能胡卡张或单吊将牌。打掉9万，我们进568筒、3467万也是7门牌，除了摸4万我们只胡卡6万，摸568筒、367万6门牌都是双面听或者三面听。所以正确答案就是打掉这个9万。"
  },
  {
    "id": 816,
    "cards": "467889m23378p799s",
    "answer": "7s",
    "tips": "这手牌如果打掉4万或8万，别人杠了5万，那么我们还要重新去组搭子，整手牌就废了。所以打7条我们把手牌留了退路，别人碰了5万，我们还有7万的进张，碰了7万还有5万的进张，如果我们先打48万就把牌打死了。所以正确打法是打掉7条。"
  },
  {
    "id": 817,
    "cards": "55789m2268p11168s",
    "answer": "8s",
    "tips": "这手牌打8筒，摸来4条，我们组成了468条3连坎；打8条摸来4筒，可以组成2468筒4连坎，多1门牌的进张。所以正确打法是打掉8条。"
  },
  {
    "id": 818,
    "cards": "23677889m346789p",
    "answer": "3p",
    "tips": "这手牌打69筒后只有4门牌能形成双面听；打3筒可以进5门牌形成双面听。所以正确打法是打掉3筒。"
  },
  {
    "id": 819,
    "cards": "2278m34578p12345s",
    "answer": "8p",
    "tips": "这手牌12345条，不能打，进125条，我们能组成两对半牌型；进36条，可以进接听牌。我们打掉8筒，摸来6筒的回头牌，可以组成34567筒5连牌型，打掉8万摸来6万，还是要打67万，所以正确打法打掉8筒就可以了。来了回头牌可以接住。"
  },
  {
    "id": 820,
    "cards": "123777m57889p246s",
    "answer": "8p",
    "tips": "这手牌应该选择打掉8筒，因为打8筒后整手牌会变成无将一上听，摸进5筒可以听牌，保留246条3连坎，摸进2356条也可以听牌。"
  },
  {
    "id": 821,
    "cards": "123368999m22457s",
    "answer": "7s",
    "tips": "这手牌要使用策略打法：6、8万可以叫牌不能打，如果保留7条，会有6条的有效牌重复问题，所以打掉7条。这手牌的技巧：两面搭子会降低周边单张牌的改良能力，通常考虑打掉。所以正确答案打掉7条。"
  },
  {
    "id": 822,
    "cards": "456m44456779p456s",
    "answer": "7p",
    "tips": "这手牌打4筒，胡卡8筒；打9筒胡47筒，手上有5张47筒张，只剩3张胡牌机会。所以这手牌的正确打法是打掉7筒，打7筒可胡89筒，有7张胡牌机会。"
  },
  {
    "id": 823,
    "cards": "222334m677p13888s",
    "answer": "6p",
    "tips": "这手牌中222334万属于321牌型可进张数太多了，可以进12345万，形成两搭成牌。保持一进听牌。我们不能去拆掉。所以这手牌的正确打法是打出6筒，可以进7筒、2条、12345万，共7门20张进牌机会。打13条会变成两进听。打7筒就是23万必须做将，损失了321牌型进12345万的进张机会。打4万，进张机会是58筒、2条3门12张进牌机会。比打6筒少了8张进张机会。所以正确打法是打掉6筒。"
  },
  {
    "id": 824,
    "cards": "999m12357889p246s",
    "answer": "8p",
    "tips": "这手牌的正确打法是打掉8筒，首先，246条3连坎的牌型，我们肯定不能去打掉。如果打出9筒，8筒做将牌，摸6筒、35条可以听牌，进张机会是3门12张；打8筒，我们摸5筒、2356条可以听牌，进张机会是5门18张的进牌机会。所以这手牌正确打法是打掉8筒，一进听牌的机会比打9筒多了6张牌。"
  },
  {
    "id": 825,
    "cards": "344788p22356789s",
    "answer": "3s",
    "tips": "这手牌的正确答案是打掉3条，打出3条，我们只损失了1条的进张。打其它的任何一张都会损失多1门牌的进张。"
  },
  {
    "id": 826,
    "cards": "13888m677p222334s",
    "answer": "6p",
    "tips": "这手牌的正确打法是打掉6筒，进张机会为7筒、2万、12345条，8门24张的进牌机会；如果打掉3条，进张机会为578筒、2万、25条，6门19张的进牌机会，所以打6筒比打掉3条多5张进牌的机会。"
  },
  {
    "id": 827,
    "cards": "13m1135p22257799s",
    "answer": "5p",
    "tips": "这手牌的正确打法是打掉5筒，六搭拆搭，打出5筒，变成五搭牌，只丢4筒的进张，打其它的任何牌，我们手牌还是六搭牌。"
  },
  {
    "id": 828,
    "cards": "45788m233556779p",
    "answer": "7m",
    "tips": "这手牌的正确打法是打掉7万，23筒做1搭，567筒做1搭，剩下3579筒4连坎，全手牌只剩一对将。根据麻将口诀一对先定将，所以打出7万。"
  },
  {
    "id": 829,
    "cards": "3578m46p11145688s",
    "answer": "5m",
    "tips": "这手牌是六搭拆搭的牌型，需要拆掉1搭形成五搭牌，78万不能拆，我们能拆的是46筒和35万。46筒进37筒可以改良成双面好搭，35万进26万可以改良成双面好搭，6万跟78万有重复的进张，因此拆35万。打出5万，摸2万，可以形成23万双面搭，摸6万我们78万能接。所以正确的打法是打掉5万。"
  },
  {
    "id": 830,
    "cards": "2356778m2245678p",
    "answer": "2m",
    "tips": "这手牌我们不缺对，也不缺好搭，听牌只需五搭牌，现在是六搭牌，需要拆1搭，拆任何搭子都会丢张。但是拆23万，打出2万，只丢1万进张。来4万我们可以组成456万、778万，形成两对半牌型。拆78万，我们会丢69万的进张，所以这手牌我们打掉2万是正确的。丢张最少，进张最多。"
  },
  {
    "id": 831,
    "cards": "11677m35688p6789s",
    "answer": "6s",
    "tips": "这手牌的正确打法是打掉69条，有朋友打3筒，刚好五搭，但如果我们保留3筒，来了4筒可以345筒组成成牌，688筒组成搭子；打出7万，手牌变成两对半（打成两对半听牌效率高一半），对手牌起到了优化作用。而如果打3筒保留69条，进来了569条，对手牌也并没有改进作用。所以正确答案打掉6条或者9条。"
  },
  {
    "id": 832,
    "cards": "13445667m455567p",
    "answer": "4p",
    "tips": "这手牌的正确打法是打掉4筒，虽然1万好像完全没什么作用，但是我们反向思维一下，如果打出1万，那么5筒是不是必须做将，于是4筒就是一张废牌，既然是废牌，所以干脆打出4筒，保留1万还可以进12万。因此打出4筒为正确答案。"
  },
  {
    "id": 833,
    "cards": "456m34579p233378s",
    "answer": "9p",
    "tips": "这手牌的正确答案是打掉9筒，这手牌我们缺对子。如果打出2条，手牌变成四人抬轿，进789筒、6789条都可听牌，进张数为7门24张；但只有进789筒，才能听69条的双面听。打出9筒，进7筒、124条、69条都可以听牌，可进张数为6门22张。进6789条、7筒，听口为三面听（听124条）；进124条、7筒，听69条，也是双面好听。当进张数大于20时，主要需要考虑后续的听口质量。所以打出9筒为最正确的打法。"
  },
  {
    "id": 834,
    "cards": "12256999p222377s",
    "answer": "3s",
    "tips": "这手牌的正确打法是打出3条，如果不打3条，23条组成搭子的话，这手牌就是六搭牌。我们没有把牌往前推进，把牌打倒退了，根据五搭牌原理，打出3条。我们还可以形成两对半牌型。"
  },
  {
    "id": 835,
    "cards": "246999m678p22466s",
    "answer": "2m",
    "tips": "这手牌的正确打法是打掉2万，首先4条不能打，打4条会丢35条2门进张。打26万只丢失1门进张。打出2万，摸进来37万可以优化成双面搭，所以打2万是最正确的打法。"
  },
  {
    "id": 836,
    "cards": "234778m3334p6667s",
    "answer": "7m",
    "tips": "这手牌根据丢张最少，进张最多原则，打出7万，进张为5678条、2345筒、69万，可进张数为40-8=32张，打7万是最正确的打法。"
  },
  {
    "id": 837,
    "cards": "11146778m345689s",
    "answer": "4m",
    "tips": "这手牌的正确打法是打掉4万，这手牌我们缺对子，也缺搭子。表面上看9条没有什么，但保留9条，摸进来369条都可以组成对子还有一副成牌，我们缺搭子，所以要留下6778万这个大肚牌型，可以进568万，都可以形成好的搭子，所以这手牌打掉4万就可以了。"
  },
  {
    "id": 838,
    "cards": "13668999m113678s",
    "answer": "8m",
    "tips": "这手牌的正确答案是打掉8万，这手牌比较简单，主要考虑后续牌型的优化。可以看出已经是两对半，碰6万和1条都是听卡2万。所以我们能打的牌只有在8万和3条之间选择。因为13万为卡张搭子，需要优化，而8万优化空间有限，而保留3条，摸来4条可以优化成两面好搭。所以选择打出8万。而如果把1万换成2万，这手牌则应该打出3条，因为搭子不需要优化，6万碰出机会比1条小，留8万可以辅助6万对子，我们摸进来7万也可听牌。所以这手牌我们最优秀的打法是打掉8万。"
  },
  {
    "id": 839,
    "cards": "22234677m788p234s",
    "answer": "7m",
    "tips": "这手牌的正确答案是打掉7万，这手牌我们有两副成牌，3个对子。三对拆对，拆掉带好搭子的对子，我们拆打8筒或7万的对子都可以形成好的搭子，相对来说，8筒碰出机会比7万更大一点，所以这手牌我们打掉7万就可以了。进689筒、258万都可以听牌，且听口质量都不错。"
  },
  {
    "id": 840,
    "cards": "124567m789p24556s",
    "answer": "2s",
    "tips": "这手牌的正确答案是打掉2条，这手牌是典型的无将一上听牌型。有朋友们可能在想打1万不丢3万，但如果打掉1万，我们进47万是不能一进听牌的。所以在25条中间选。打2条不丢3条进张，打5条丢567条进张。这手牌我们需要理解成：无将一上听，打闲不打连（1万是24567万相连的牌），我们缺将缺搭不打衍（yan）牌。（1万是24万的衍牌）"
  },
  {
    "id": 841,
    "cards": "123788m2446p3557s",
    "answer": "2p",
    "tips": "这手牌的正确打法是打掉2筒，这手牌主要考虑后续优化。一个成牌（123万），3个对子（4筒，5条，8万），缺一个搭子，如果把对子拆开比如35条1搭、57条1搭，刚好五搭牌。打26筒、37条都是有丢张。2筒周边的牌是13筒，摸进来1筒是个边张搭。其他牌摸进来周边牌都是两面好搭，所以建议打出2筒。（金3银7臭28）"
  },
  {
    "id": 842,
    "cards": "135889m3788p1226s",
    "answer": "9m",
    "tips": "这手牌的正确打法是打掉9万，手牌只有4个搭子。缺搭子保留组搭能力最强的中张牌，所以6条、3筒不能打，只能在1条和9万之间选。表面上好像1条和9万是一样的，但考虑打出9万，摸进7万可以和5万组成卡6万的搭子，勉强可以算作五搭牌（打1条摸进3条，还是四搭牌）所以考虑后续进张可能性，这手牌应该打出9万。"
  },
  {
    "id": 843,
    "cards": "12235m444555p579s",
    "answer": "2m",
    "tips": "这手牌的正确打法是打掉2万，这手牌我们缺对子，579条为3连坎牌型我们不打。1223万为大肚牌型。5万为孤张。我们用2万来靠搭子，可进张机会为1234万，4门12张，而且只有3万摸进来才能形成两面搭子。留5万可进张机会为34567万，5门18张，摸46万都可形成两面搭。打2万比打5万多6张进张机会，而且还有机会听双面听。所以打2万是这手牌的正确打法。"
  },
  {
    "id": 844,
    "cards": "3334789m1367999p",
    "answer": "1p",
    "tips": "这手牌我们打掉13筒、进245万、5678筒都可以形成双面好听，共7门25张。打4万的话，虽然也是四人抬轿，进张机会为1235678筒，共7门24张进张机会。而且只有进123筒，才能形成双面搭的听口。所以这手牌，我们打掉13筒的进牌数量与听口质量比打掉4万要好太多，这手牌拆掉13筒就可以了。"
  },
  {
    "id": 845,
    "cards": "114m3445889p3447s",
    "answer": "7s",
    "tips": "这手牌3445筒可以分解为34筒和45筒，变成两个双面搭。889筒为1搭，344条为1搭，一对1万为1搭，这样刚好组成五搭牌。剩下7条和4万两个孤张。打7条还是4万呢？假如留7条，我们的344条进的5条跟7条有重复进张。而留下4万，不会产生重复进张问题。所以这手牌打掉7条效率最高。"
  },
  {
    "id": 846,
    "cards": "345689m46778p111s",
    "answer": "4p",
    "tips": "首先这手牌9万不能打，因为这手牌我们摸来9万的对子也可以听牌，来了7万，可以优化成369万三面听。所以在4筒和7筒中间选择。有朋友说，无将拆大肚（6778筒为大肚牌型）确实留下4筒比7筒多一张进张机会，但是为了考虑后续优化改良，打出4筒有利于后续手牌的优化。打出4筒比打7筒少1门进张，但我们进5689筒可以优化手牌。让听口质量更好。所以这手牌我们打4筒最正确。"
  },
  {
    "id": 847,
    "cards": "2334578p2244467s",
    "answer": "8p",
    "tips": "这手牌是六搭牌，六搭拆搭，我们要拆一个搭子。拆23筒丢14筒、拆67条丢58条、拆78筒只丢9筒进张，根据丢张最少，进张最多原则，所以打出8筒为最优秀的打法。而且打掉8筒，摸来3筒，我们还可以把手牌改变成两对半，多了一个2条的碰出，所以正确打法是打掉8筒。"
  },
  {
    "id": 848,
    "cards": "1112357m2245889s",
    "answer": "2m",
    "tips": "这手牌也是六个搭子，六搭拆搭，打出2万，我们把手牌推进成了五搭牌，我们也没有丢14万的进张，来了1万可以杠，来4万我们35万能接，不要舍不得打，我们打牌的最终目的是为了听牌也胡牌，不是为了牌型好看。这手牌打掉2万，就是我们最高效的打法。"
  },
  {
    "id": 849,
    "cards": "25677m112888999s",
    "answer": "2s",
    "tips": "虽然这手牌，我们打掉2万，可以形成了两对半牌型，但是这手牌567万要看成一副成牌，那么我们的手牌就变成了一对先定将，我们打2条后，可以进123456789万、还有1条都可以听牌，进张机会为10门33张。如果我们打2万后，摸进124条、456789万能听牌。一共是9门28张机会。打7万呢？打7万我们摸进1234条、1234万可听牌，进张机会为8门28张。所以我们打2条进33张牌是最高效率的打法，我们摸进来368万，还能形成2面听的听口。这手牌，我们打2条就可以了。"
  },
  {
    "id": 850,
    "cards": "2334m56689p12778s",
    "answer": "9p",
    "tips": "这手牌分析牌型后，可以看出缺好的搭子，那么这个2334万大肚牌型肯定不能去打掉，根据丢张最少，进张最多原则，打出9筒，不丢7筒的进张。可进牌有369条、12345万、467筒。看起来的烂牌我们也不要放弃，这手牌我们打掉9筒，如果能摸进来3条或者7筒，牌就不差了，进12345万、进69条，都是好牌，看起来烂的牌，我们只要能进一个好张，我们的牌就好了。(尤其是湖南，广东，打红中飞的麻将，再怎么样的烂牌我们也不要乱打，不要把心态打乱了，心态好了，牌自然就顺了。)"
  },
  {
    "id": 851,
    "cards": "22888m22p2356778s",
    "answer": "2s",
    "tips": "这手牌根据麻将口诀“两对拆搭”，这手牌我们不打2筒和2万，所以在23条和78条做选择。打78条会丢69条进张，打2条只丢1条进张。根据丢张最少进张最多原则，所以打出2条为最佳答案。"
  },
  {
    "id": 852,
    "cards": "12333445m567999p",
    "answer": "9p",
    "tips": "这手牌打9筒胡25万，胡牌机会为6张。打5万胡34万，胡牌机会为3张。打14万胡36万，胡牌机会为5张，打3万胡14万，胡牌机会为5张牌。所以这手牌，我们打掉9筒胡6张牌，是这手牌的最正确打法。也有朋友想打3万胡14万5张牌，保留了9筒开杠的机会，也是可以的。看个人的取舍。麻将没有绝对正确的答案。这手牌从概率上来说9筒是最优秀的打法。"
  },
  {
    "id": 853,
    "cards": "3378m34555p78999s",
    "answer": "3m",
    "tips": "这手牌可以看成是六搭牌的三对拆一对。打出3万只损失3万碰出机会。打5筒会损失25筒，打9条会损失69条。所以这手牌的正确打法是打掉3万。我们打出3万，进25筒、69万、69条均可以听牌。进张数量为4门24张"
  },
  {
    "id": 854,
    "cards": "113557m12378p222s",
    "answer": "7m",
    "tips": "这手牌打3万丢24万，打1万丢了15万的碰出，打5万也是同样丢15万的碰出，打掉7万我们只丢掉6万的进张。正确打法是打掉7万，把手牌打成超级两对半。麻将口诀，打成两对半，胜率高一半。"
  },
  {
    "id": 855,
    "cards": "23456m11123p5779s",
    "answer": "5s",
    "tips": "这手牌打5条丢6条，打9条丢8条，所以我们正确打法是打掉5条，我们有23456万5连牌型，不需要留5条做改良，5条是中张牌比9条安全，而且779条形成半封闭牌型，卡8条比卡6条要容易胡牌，57卡6神仙难救。"
  },
  {
    "id": 856,
    "cards": "3578999m1134899s",
    "answer": "8m",
    "tips": "这手牌打8条，会丢掉7条的进张，就算进了9条，整手牌还是六搭牌，所以打8条不仅没把牌打进一步，还是把牌打退了2步。4条也不能打，会丢掉5条的进张，所以这手牌我们能打的是8万，不丢69万进张，357万为3连坎，同时把六搭牌打成了五搭牌。"
  },
  {
    "id": 857,
    "cards": "5567m4567p455699s",
    "answer": "5m",
    "tips": "这手牌有3个重要的经典牌型，4567筒为四连牌型肯定不能打，5567万为边肚牌型，4556条为大肚牌型。所以根据麻将口诀“有将拆边肚，无将打大肚”，我们的正确打法是打掉5万。"
  },
  {
    "id": 858,
    "cards": "5677m236778p4567s",
    "answer": "7p",
    "tips": "这手牌根据麻将口诀“有将拆边肚，无将打大肚”，4567条为四连牌型，4577万为边肚牌型，6778筒为大肚牌型，23筒为一搭，这手牌分析后是没有将。所以我们直接打掉7筒就可以了。"
  },
  {
    "id": 859,
    "cards": "12378999m2244p78s",
    "answer": "4p",
    "tips": "这手牌很简单，我们应该看成三对拆一对。9万肯定不能打，留9万我们还可以进6万，所以24筒，我们应该要打掉4筒是正确的。相对来说，2筒比4筒更容易碰出。所以正确打法是打掉4筒。"
  },
  {
    "id": 860,
    "cards": "336778m1237p7789s",
    "answer": "7s",
    "tips": "这手牌可以看成是一对3单，我们要考虑3个单张的靠张能力，首先7万是肯定不能打。因为我们进56789万5门牌，我们都能形成双面搭。为什么打7条是正确的？因为7条旁边有789条的重复进张，所以我们的正确打法是打掉7条。"
  },
  {
    "id": 861,
    "cards": "4456778p2233789s",
    "answer": "3s",
    "tips": "这手牌打3条，可以碰2条、进14条、进4筒、进69筒，都可以是一进听，进124条、进4筒，可以听69筒；进69筒，可以听14条。另外2条比3条好碰出，所以正确答案打掉3条。"
  },
  {
    "id": 862,
    "cards": "1126799m3578999s",
    "answer": "8s",
    "tips": "这手牌是六搭牌，根据麻将口诀“六搭拆搭”，打8条不丢69条的进张，而且把牌打成了五搭牌。所以正确答案打掉8条。"
  },
  {
    "id": 863,
    "cards": "2279m3479p123779s",
    "answer": "7p",
    "tips": "这手牌根据麻将口诀“六搭拆搭”，34筒双面搭我们肯定保留，只能在79万和79筒里面去做选择，正确的打法是打掉79筒的其中一张，因为79筒的改良牌型是6筒，如果摸进6筒改良成67筒的双面搭，后续会跟手牌34筒有5筒的重复进张，等于整个手牌没有改良，但是保留79万，摸来改良牌不会出现重复进张的情况。所以正确答案先打掉7筒。"
  },
  {
    "id": 864,
    "cards": "111m2478p2477999s",
    "answer": "2p",
    "tips": "这手牌有六个搭子，六搭拆搭，在24条和24筒当中做选择，金3银7臭28，2条2筒的改良空间最差，我们肯定在2条和2筒里面做选择，24筒的改良牌型是5筒，24条的改良牌型是5条，摸来5筒形成45筒的双面搭子跟78筒会存在6筒重复进张，合理的选择是打掉2筒。"
  },
  {
    "id": 865,
    "cards": "1134579p1233479s",
    "answer": "9s",
    "tips": "这手牌是六搭牌，79条跟79筒去拆掉1搭，我们应该选择拆掉那张牌呢？79条的改良牌是6条，79筒的改良牌是6筒，还可以摸来2筒，形成234筒一副成牌加579筒3连坎；79条摸来6条，改良成67条的双面搭，还会跟34条有5条的重复进张，所以选择拆掉79条，打出9条。"
  },
  {
    "id": 866,
    "cards": "11456m258p123789s",
    "answer": "2p",
    "tips": "这手牌属于一对3单，靠张一上听的牌型，有朋友一看，麻将口诀，258筒打5筒，要注意，如果这手牌我们打掉5筒，我们进张12346789筒8门，但是我们后续摸来1469筒，我们的听口都是卡张，不是卡3筒就是卡5筒，如果我们打掉28筒中的一张，我们进张只少1门，但是我们双面听的概率更大，保留5筒中张，后续的调整空间也会更好。所以这手牌的正确答案是2筒或8筒。"
  },
  {
    "id": 867,
    "cards": "1223367m3334889p",
    "answer": "4p",
    "tips": "这手牌保留4筒是没有价值的，因为4筒的能力是摸进2筒或者5筒，但是这手牌摸进2筒，也得把2筒打掉，因为它搭子的价值，不如23万和67万，摸进5筒也得把它打掉，所以说这手牌保留4筒在手上，没有任何的能力，所以打掉4筒，有机会勾出3筒开杠，并且保留9筒的话，摸进7筒打8筒，可以改良成一个加强带碰的四人抬轿。"
  },
  {
    "id": 868,
    "cards": "3477889p2223889s",
    "answer": "3s",
    "tips": "这手牌能打的只有39条，并且效果都是一样的，可以进2569筒听牌，既然效果是一样的，那么就要去考虑后续的改良空间，如果打掉9条的话，摸进134条对整手牌都没有任何的改良，都需要拆搭，所以这手牌正确打法应该是打掉3条，摸进78条，可以把手牌改成四人抬轿牌型。"
  },
  {
    "id": 869,
    "cards": "34889m224578p123s",
    "answer": "5p",
    "tips": "根据麻将口诀“六搭拆搭'，无论打8万还是9万之后，手上还是六搭牌，所以需要把牌型尽快打成五搭牌型。正确打法是应该打掉5筒，因为5筒是一个衍牌，224筒可以进3筒、78筒可以进6筒，所以这张5筒是没有多大作用的，应该直接打掉。"
  },
  {
    "id": 870,
    "cards": "134456m56667889s",
    "answer": "8s",
    "tips": "这手牌应该打掉8条，可以摸进25万听457条、摸进147万、457条都可以听牌、有8门32张减去手上的6张，一共有26张的听牌机会，比打掉1万多了7张，提升了40%左右的听牌速度。"
  },
  {
    "id": 871,
    "cards": "234m2337p1115667s",
    "answer": "2p",
    "tips": "这手牌是一对3单的牌型，首先6条是绝对不能打的，因为5667条属于大肚牌型，它的靠张能力非常强，摸进45条、78条都能把它变成一个好搭子，所以这手牌论单张的进张能力，2筒肯定不如7筒，因为根据麻将口诀金3银7，所以这手牌的正确打法应该是打掉2筒，保留6条和7筒，去做一个靠张一上听，摸进45678条可以碰出3筒，摸进56789筒，都可以听胡，所以应该打2筒。"
  },
  {
    "id": 872,
    "cards": "1234567m78p23666s",
    "answer": "1m",
    "tips": "这手牌应该打掉147万其中一张，打出去后就成了无将一上听四人抬轿牌型，四人抬轿就是保留3副成牌，外加两个两面搭，这时候两个搭子的周边，摸进6789筒，1234条都可以听牌，总共8门32张，减去手牌的4张，还有28张的一进听牌机会。"
  },
  {
    "id": 873,
    "cards": "455666m11567p334s",
    "answer": "3s",
    "tips": "这手牌有三个对子，三对拆对牌型，应该打3条，只是会失去碰3条的机会，但是换来的是进1筒、2条、34567万就可以听牌的牌型。所以打3条是效率最高的，8门牌进张效率。"
  },
  {
    "id": 874,
    "cards": "445588m55p234678s",
    "answer": "5m",
    "tips": "这手牌应该保留8万对子，因为靠边的对子比较容易碰牌，同时要尽量保留45万的搭子作为后续的听牌牌型，所以应该拆掉45万的对子，正确打法应该打掉5万，因为5万比4万有更大的概率，消耗对方更多的中心牌，可以从最中心的序数牌部位，破坏别人手牌的关联能力，从而降低别人创造多连顺，多门进牌的机会。"
  },
  {
    "id": 875,
    "cards": "1238m25p44455567s",
    "answer": "2p",
    "tips": "这手牌是一个一对3单的牌型，要注意重复进张，如果打8万的话，保留25筒来做靠张一上听，3筒和4筒是重复进张，所以这样的话效率会降低很多，所以像这种一对3单靠张一上听的牌，就不要保留条1门花色的，特别是有重复进张的，所以应该打掉2筒，因为5筒的进张能力是比2筒要更强的。"
  },
  {
    "id": 876,
    "cards": "113445667m23456s",
    "answer": "6m",
    "tips": "这手牌应该打掉6万，因为147万是1万筋线上的牌，如果打掉4万的话，对方手上有1234万的四连牌，他肯定也会跟着你打4万，所以这手牌，为了方便利于碰出的情况下，应该直接打掉6万。"
  },
  {
    "id": 877,
    "cards": "23355789p114567s",
    "answer": "3p",
    "tips": "这手牌的正确打法应该是打掉3筒，可以进145筒、13568条一共8门牌，并且下叫听牌的质量也是比较高的，但是如果打47条的话，后期很有可能会听在1条和5筒的对倒胡上。"
  },
  {
    "id": 878,
    "cards": "4667m223888p4677s",
    "answer": "4m",
    "tips": "这手牌应该优先打掉有重复进张的牌，需要在4条和4万之间做一个选择，需要注意的是后续如果碰了7条，那46条依然可以组成一个搭子，但是如果碰了6万，剩下的47万就会变成散牌，所以正确打法应该打掉4万。"
  },
  {
    "id": 879,
    "cards": "22356789p334788s",
    "answer": "3p",
    "tips": "根据麻将口诀，三对拆一对是在有两副成牌的情况下，才去做三对拆一对，没有两副成牌三对也可以不拆对，应该打掉一个搭子，这手牌如果打7条的话，会丢失69条的进张，打掉4条会丢失25条的进张，打掉3筒只会丢失一个1筒的进张，所以应该打3筒。"
  },
  {
    "id": 880,
    "cards": "11577m11123p5688s",
    "answer": "5s",
    "tips": "这手牌是典型的六搭牌，需要拆掉1搭，所以正确打法应该是打掉5条，因为后续如果摸上7条，也不会浪费，并且整手牌变成了五搭牌。"
  },
  {
    "id": 881,
    "cards": "23555m3456789p56s",
    "answer": "9p",
    "tips": "这手牌应该打成无将一上听，也就是打掉369筒其中的一张，万子可以进1234万，条子可以进4567条，总共8门32张，减去手上4张，还有28张进牌机会。像这种手上没有将，打掉手里的孤张，保留双搭做四人抬轿是最大几率打法。正确答案打掉9筒。"
  },
  {
    "id": 882,
    "cards": "345999m22245667s",
    "answer": "6s",
    "tips": "这手牌应该打掉6条听牌，一共听347条3门牌，比打掉其他牌要听的多。"
  },
  {
    "id": 883,
    "cards": "334888m34p222468s",
    "answer": "4m",
    "tips": "这手牌根据麻将口诀“一对先定将”，因此正确打法应该是打掉4万，专心优化筒子和条子的搭子。"
  },
  {
    "id": 884,
    "cards": "123999m57889p246s",
    "answer": "8p",
    "tips": "这手牌应该选择打掉8筒，因为打8筒后整手牌会变成无将一上听，摸进5筒可以听牌，保留3连坎摸进2356条也可以听牌。"
  },
  {
    "id": 885,
    "cards": "23677899m234556p",
    "answer": "7m",
    "tips": "这手牌根据麻将口诀“两对拆搭”，正确打法应该直接打掉7万，把手牌打成一个两对半的牌型，打掉7万后，进张可以是14万、碰9万、进147筒、碰5筒，比打掉5筒多了两门牌的进张。"
  },
  {
    "id": 886,
    "cards": "11267999m346799s",
    "answer": "6s",
    "tips": "根据麻将口诀，这手牌是六搭拆搭牌型，可能很多人会选择打掉2万，打掉2万会丢失3万的进张，并且整手牌依旧是六搭牌型，接下来不管是进张也好、碰出也好，还是需要去继续拆掉1搭，因为六搭牌永远有两张废牌，所以说这手牌，应该直接打掉6条。因为67条是一个搭子，67条的能力是进58条，打掉6条，既不会丢失8条的进张，也不会丢失5条的进张，所以应该打掉6条。"
  },
  {
    "id": 887,
    "cards": "33488m233444678s",
    "answer": "3m",
    "tips": "这手牌正确的打法是打掉3万，保留233444条的321牌型，进张是258万、12345条，总共是8门32张，减去手牌8张，还有24张进牌。"
  },
  {
    "id": 888,
    "cards": "6678m112334p3334s",
    "answer": "3p",
    "tips": "这手牌如果打1筒的话，可以进25筒、69万、245条，总共7门牌；如果打3筒的话，可以进1筒、23456条、456789万，总共12门牌；如果打6万，可以进12345筒、23456条，总共10门牌；如果打4条，可以进12345筒、456789万，总共11门牌。所以正确答案应该打掉3筒。"
  },
  {
    "id": 889,
    "cards": "344568m111p23378s",
    "answer": "2s",
    "tips": "这手牌根据麻将口诀“一对先定将”，正确打法应该先打掉2条，可以进69条和257万听牌。"
  },
  {
    "id": 890,
    "cards": "13556p123334778s",
    "answer": "3s",
    "tips": "这手牌还没有那么快听牌，考虑打掉哪张不容易损失更多的进张机会，如果打1筒，损失2筒1门的机会；如果打1条，损失2条和5条两门的机会；如果打3条，只会损失3条1门一张的进张机会，况且绝张的中心牌更不容易进张，所以这手牌应该打掉3条。"
  },
  {
    "id": 891,
    "cards": "22m2356778p23888s",
    "answer": "2p",
    "tips": "这手牌正确打法应该打掉2筒，因为打掉2筒后，可以进469筒听牌，而打掉其他的牌，进张只有2门。"
  },
  {
    "id": 892,
    "cards": "2245667m2255578s",
    "answer": "2m",
    "tips": "这手牌要拆掉两个搭子和两个对子，在听牌时，搭子的效率要比对子高，所以应该在2万和2条之间做选择。打2条的话，可以进69条、58万总共4门牌；打2万的话，可以进69条、358万总共5门牌，所以这手牌打掉2万是最佳打法，多进1门3万。"
  },
  {
    "id": 893,
    "cards": "1156m1233367p668s",
    "answer": "1p",
    "tips": "在这副手牌中56万、67筒都是双面搭，摸进47万、58筒就能组成成牌了，打出8条，这牌依然是六搭牌，并且会丢失7条的进张。这副牌当中，3筒就可以组成一副成牌，所以12筒的价值是最低的，我们直接打掉因此可以拆掉12筒，根据选项则选择打掉1筒。"
  },
  {
    "id": 894,
    "cards": "133456m13567889s",
    "answer": "1m",
    "tips": "这手牌如果打掉9条的话，可以进28条、23万，一共4门。如果打掉1万的话，可以进2478条、3万，一共5门，而且可以把手牌打成一个两对半的牌型，所以正确打法应该是打掉1万。"
  },
  {
    "id": 895,
    "cards": "244456899p22246s",
    "answer": "8p",
    "tips": "这手牌应该打掉8筒，因为打掉8筒并不会丢失7筒的进张，3个4筒看作一副成牌，56筒照样可以进7筒，所以说这手牌打掉8筒是一个不丢张的打法，可以进3479筒、5条听牌。"
  },
  {
    "id": 896,
    "cards": "2224589p1234456s",
    "answer": "9p",
    "tips": "这副牌的最优解是打掉9筒，因为14条打出去的话，只能摸89筒才能两面听；9筒打出去可以摸来147条、8筒都可以两面听，所以这副牌应该打掉9筒。"
  },
  {
    "id": 897,
    "cards": "3444789p2333778s",
    "answer": "7s",
    "tips": "这副牌打掉8条，要想胡牌的话，除非碰7条不然只能胡对倒和坎张，但是打掉7条的话，进牌都可以两面听，因此这副牌最优打法是打掉7条。"
  },
  {
    "id": 898,
    "cards": "112334m7888p6678s",
    "answer": "3m",
    "tips": "这手牌的正确打法应该是打3万，打6条可以进12345万、56789筒，一共10门。打7筒可以进12345万、456789条，一共11门。打3万可以进1万、456789条、56789筒，一共12门。"
  },
  {
    "id": 899,
    "cards": "23778m245667p999s",
    "answer": "8m",
    "tips": "这手牌根据麻将口诀“一对先定将”，应该打8万，这样就会有358筒、14万的进张后直接听牌。"
  },
  {
    "id": 900,
    "cards": "345788m12344588p",
    "answer": "1p",
    "tips": "这手牌应该在788万和445筒之间进行拆对，如果打掉4筒，可以进368筒、689万，总共6门19张牌；如果打8万，可以进3468筒、69万，总共也是6门19张牌；考虑到8万对子比4筒对子更好碰出，所以应该拆445筒，但是由于手牌有123筒可以和445筒连起来，所以打掉1筒，才是最正确最安全的打法。"
  },
  {
    "id": 901,
    "cards": "234m2337p1115667s",
    "answer": "2p",
    "tips": "根据麻将口诀，应该一对先定将，打掉7筒的话，可以进1234筒、45678条，总共9门36张，减去手牌7张，还有29张的进牌机会；打掉6条的话，可以进123456789筒，总共9门36张，减去手牌4张，还有32张进牌机会。但是打2筒的话，可以进45678条、356789筒，总共11门44张，减掉手牌7张，还有37张进牌的机会。这手牌的正确打法应该是打掉2筒。"
  },
  {
    "id": 902,
    "cards": "23666888m223468s",
    "answer": "2s",
    "tips": "这手牌如果打2条，可以进678条、1234万，总共7门牌，如果打8条，可以进256条、14万，总共5门牌，所以这手牌正确打法应该打掉2条。"
  },
  {
    "id": 903,
    "cards": "112456668m46888p",
    "answer": "2m",
    "tips": "这手牌的正确打法应该是打2万，因为打8万会丢失7万的进张，打2万并不会丢失3万的进张，并且可以进5筒、367万听牌。"
  },
  {
    "id": 904,
    "cards": "23467899m355799s",
    "answer": "5s",
    "tips": "这手牌如果打掉3条，有效进张是56789条5门20张减去手牌6张，还有14张牌的进张机会，同时也保留了三对在手上，这明显是不对的；这手牌我们有两副成牌，根据麻将口诀，三对拆一对，打掉5条，保留了条子的4连坎，可进468条、碰9条和9万，一共是5门20张，减去手牌4张，一共有16张牌的进张机会。正确打法应该是打掉5条。"
  },
  {
    "id": 905,
    "cards": "13579p123444788s",
    "answer": "7s",
    "tips": "这手牌13579筒为5连坎，靠搭能力非常强。根据麻将口诀，一对先定将，正确打法应该先打掉7条，可以进2468筒听牌。"
  },
  {
    "id": 906,
    "cards": "3334567m3467889s",
    "answer": "8s",
    "tips": "这手牌如果打掉47万的话，可以进23456789条听牌，一共8门32张减去手上7张，还有25张的进张机会。但是会丢失万子5连的效果，丢失4门牌，所以这手牌应该打掉8条，可以进24578万、2569条效率最高。"
  },
  {
    "id": 907,
    "cards": "7888m23345p34567s",
    "answer": "7m",
    "tips": "这手牌的正确打法应该是打掉7万，可以进123456筒、2345678条，一共13门52张牌，减去手上的10张，一共有42张进牌就听牌的机会。"
  },
  {
    "id": 908,
    "cards": "12366789m334779s",
    "answer": "3s",
    "tips": "这手牌该打掉3条。此牌是典型的三对牌型，3个对子两副成牌，所以根据三对拆一对原则，拆掉好成牌的对子，留下不好成牌的对子去碰牌、组牌，所以拆掉3条有较大概率听25条；如果拆掉7条就会听卡8条，所以这牌应该打掉3条。"
  },
  {
    "id": 909,
    "cards": "3477789m24499p45s",
    "answer": "9m",
    "tips": "这手牌保留89万的搭子是没有任何作用的，正确打法应该是打掉9万，如果打掉2筒的话不仅会损失3筒的进张，而且仍然有六搭牌，还是需要拆掉搭子。所以应该打掉9万。"
  },
  {
    "id": 910,
    "cards": "2223579m1123468p",
    "answer": "9m",
    "tips": "这手牌如果打掉8筒的话，只能进48万；如果打掉9万的话，可以进7筒、46万，所以正确打法应该是先打掉9万，把手牌先打成357万3连坎，然后再调整机会看看1筒能不能碰出，如果碰出的话，打掉7万，就可以把手牌打成一个超级四人抬轿，可以进678筒、1345万听牌，所以应该打9万。"
  },
  {
    "id": 911,
    "cards": "12366799p345667s",
    "answer": "6s",
    "tips": "这手牌是三对拆一对牌型，如果打掉6筒，接下来碰了9筒，那6条就只能做将，听在58筒上；但是如果打掉6条，即使碰了9筒，也可以听在258条上，比打9筒多1门，所以正确打法应该是打6条。"
  },
  {
    "id": 912,
    "cards": "1225667m355p1234s",
    "answer": "1m",
    "tips": "首先这手牌的四连牌型和大肚牌型不能动，因为这种牌型的靠张能力非常强，正确打法应该打掉1万，因为打掉1万后，可以进45筒、2356条、24578万都是有用的，所以打掉1万是最高效的打法。"
  },
  {
    "id": 913,
    "cards": "345566m34567778p",
    "answer": "6m",
    "tips": "这手牌正常情况下都会打36万，虽然同样是听4、7万，但建议打6万，首先保持出牌安全性，因为6万有一对，3万只是单张，这样打6万相对不容易被碰，其次保持序数牌延伸优势，打6万后，后续如果来2万，再打出5万，手牌就可以优化成23456的五连顺听3门牌。"
  },
  {
    "id": 914,
    "cards": "23456m113445667p",
    "answer": "6p",
    "tips": "这副牌最优解是打掉6筒。首先，打4筒，如果别人手牌有1234筒牌型，就会跟着打4筒，1筒就难打出来，只能自己摸；其次，如果打6筒，打哪一张都可以碰出下叫听胡，或者摸进147万听258筒；摸进258筒听147万，所以这副牌应该打掉6筒。"
  },
  {
    "id": 915,
    "cards": "113467m22245899p",
    "answer": "4m",
    "tips": "这手牌是六搭拆搭的牌型，第一步是在不丢张或者少丢张的情况下，把六搭牌推进成五搭牌，所以正确打法应该打4万，打4万把牌打成了五搭牌，万子也不会损失25万的进张，而打其他的任何一张牌，都会损失进张。"
  },
  {
    "id": 916,
    "cards": "11468999m224578p",
    "answer": "5p",
    "tips": "这手牌根据六搭拆搭原理，以不丢张或者少丢张为原则，所以这副手牌应该打掉5筒，因为打掉5筒，不会丢失36筒的进张，4筒可以和1对2筒组搭。手牌推进成5搭牌。打其他牌都会丢张。"
  },
  {
    "id": 917,
    "cards": "1122247m2345567p",
    "answer": "4m",
    "tips": "这手牌是一个一对3单的牌型，很明显2345筒4连牌型可以进1234567筒，是不能动筒字，能选的就是打掉47万其中的一张，打4万进56789万有21张，打7万进23456万20张减去自己手上4张有16张进张机会，所以正确打法应该是打4万。"
  },
  {
    "id": 918,
    "cards": "45m4456788p44555s",
    "answer": "4p",
    "tips": "这手牌根据麻将口诀，是典型的三对拆一对牌型，需要从48筒和4条之间拆掉一对，由于8筒更容易碰出，优先考虑留下，因此剩下4筒和4条可以选择，正确打法应该是打4筒，因为如果打4条，那另外一张4条，就会变成没有用的单牌，而打4筒，剩下的4筒还可以组成4567筒4连牌型。所以正确答案应该打4筒。"
  },
  {
    "id": 919,
    "cards": "45688m124588p368s",
    "answer": "1p",
    "tips": "这手牌正确打法应该先打1筒，不影响3筒的进张，并且可以创造优化手牌的机会，因为有两个进单张的边搭12筒和坎搭368条，其中边搭12筒是所有搭子里最不容易进张的搭子，会拖慢手牌进牌效率，所以应该打1筒。"
  },
  {
    "id": 920,
    "cards": "446688m23555678s",
    "answer": "6m",
    "tips": "这手牌正确打法应该是拆468的万子对子，打8万的话，可以进467万3门牌；打4万的话，可以进568万3门牌；打6万的话，可以进4578万4门牌，因此，这手牌打掉6万是正确打法。"
  },
  {
    "id": 921,
    "cards": "12345788m334778p",
    "answer": "7m",
    "tips": "这手牌的正确打法应该打掉7万，因为打掉7万并不会损失6万的进张，但是打3筒或者7筒，都会损失较多的进张，所以应该打7万。"
  },
  {
    "id": 922,
    "cards": "244567m112334p23s",
    "answer": "2m",
    "tips": "这手牌是复合牌型，112334筒，成牌可以固定成123筒，也可以固定成234筒，当123筒时，进张就是25筒；当234筒时，进张就是12筒。因此像这手牌，在优先留住两对子的情况下，拆搭就不能拆筒子，正确打法应该是打2万。"
  },
  {
    "id": 923,
    "cards": "57889m888999p335s",
    "answer": "8m",
    "tips": "这手牌把789万当一个成牌，8万拆出来，是一个一对3单的牌型，应该打8万，这样就会有34567条、34567万的进张听牌机会。"
  },
  {
    "id": 924,
    "cards": "5688m11577p11123s",
    "answer": "5m",
    "tips": "这手牌根据麻将口诀，六搭拆搭，应该打5万，6万可以跟8万进行靠搭，组成五搭牌牌型。其他选项打掉后，手里还是六搭牌。"
  },
  {
    "id": 925,
    "cards": "224567m34666778p",
    "answer": "7m",
    "tips": "这手牌如果打掉8筒的话，可以进257筒、23万，一共5门。如果打掉7筒的话，可以进2569筒、23万，一共6门。如果打掉7万，可以进256789筒、23万，一共7门。所以正确答案是打7万。"
  },
  {
    "id": 926,
    "cards": "22488999m224567s",
    "answer": "4m",
    "tips": "这手牌根据听牌前坎搭的进牌效率不如对子，所以这手牌要留对子，那么就要拆坎搭中的4万，4条和7条，但是47条是四连牌型中的一部分，后续有比较大的优化机会，所以这手牌应该打4万。"
  },
  {
    "id": 927,
    "cards": "3467889m3334567p",
    "answer": "8m",
    "tips": "这手牌如果打掉47筒的话，可以进23456789万听牌，一共8门32张减去手上7张，还有25张的进张机会，但是会丢失筒子五连牌型的效果，丢失4门牌，所以这手牌应该打掉8万，可以进24578筒、2569万9门36张减去手上5张，还有31张的进张机会。所以正确答案打掉8万效率最高。"
  },
  {
    "id": 928,
    "cards": "45m3477789p24499s",
    "answer": "9p",
    "tips": "这手牌保留89筒的搭子是没有任何作用的，正确打法应该是打掉9筒，如果打掉2条的话不仅会损失3条的进张，而且仍然有六搭牌，还是需要拆掉搭子。所以应该打掉9筒。"
  },
  {
    "id": 929,
    "cards": "4568m233789p2456s",
    "answer": "2p",
    "tips": "分析牌型后，这手牌是一对3单的牌型，要注意单张的靠张能力，正确打法应该是打掉2筒，因为2筒保留的话它的进张能力是1234筒，保留8万的话，进张能力是36789万，2条的进张能力是12347条，对比下来只有2筒的靠张能力最差，所以应该打掉2筒。"
  },
  {
    "id": 930,
    "cards": "3334m6678p112334s",
    "answer": "3s",
    "tips": "这手牌如果打1条的话，可以进25条、69筒、245万，总共7门牌；如果打3条的话，可以进1条、23456万、456789筒，总共12门牌；如果打6筒，可以进12345条、23456万，总共10门牌；如果打4万，可以进12345条、456789筒，总共11门牌。所以正确答案应该打掉3条。"
  },
  {
    "id": 931,
    "cards": "345566p34567778s",
    "answer": "6p",
    "tips": "这手牌正常情况下都会打36筒，虽然同样是听4、7筒，但建议打6筒，首先保持出牌安全性，因为6筒有一对，3筒只是单张，这样打6筒相对不容易被碰，其次保持序数牌延伸优势，打6筒后，后续如果来2筒再打出5筒，手牌就可以优化成23456筒，形成147筒的三面听。"
  },
  {
    "id": 932,
    "cards": "12278m2457p11135s",
    "answer": "2p",
    "tips": "这手牌是一个两进听的牌型，没有那么快听牌，所以打掉1万是不对的，因为2457筒里面，2筒和7筒的作用都是进3筒和6筒，45筒的作用也是如此，所以这手牌应该在2筒和7筒之间选择，根据麻将口诀金3银7臭28原则，应该打掉2筒。"
  },
  {
    "id": 933,
    "cards": "346799m11267999p",
    "answer": "6m",
    "tips": "根据麻将口诀，这手牌是六搭拆搭牌型，可能很多人会选择打掉2筒，打掉2筒会丢失3筒的进张，并且整手牌依旧是六搭牌型，接下来不管是进张也好、碰出也好，还是需要去继续拆掉1搭，因为六搭牌永远有两张废牌，所以说这手牌，应该直接打掉6万。因为67万是一个搭子，67万的能力是进58万，打掉6万，既不会丢失8万的进张，也不会丢失5万的进张，所以应该打掉6万。"
  },
  {
    "id": 934,
    "cards": "114567m23355789s",
    "answer": "3s",
    "tips": "这手牌如果我们打掉4万，或者7万，这手牌剩3个对子，后期很大可能会听在1万或5条的对倒胡上，我们打牌的目的是为了胡牌，不是为了碰牌，所以这手牌我们的正确打法是打掉3条，可以进145条、13568万，一共8门牌，并且下叫听牌的质量也很高。如果我们能摸来3568万，再打掉2条，只丢一个1条的进张，形成两对半的牌型，碰1万、碰5条、进4条，都能形成两面或三面听的叫口。所以这手牌我们先打掉3条是正确的。"
  },
  {
    "id": 935,
    "cards": "999m23778p245667s",
    "answer": "8p",
    "tips": "根据麻将口诀一对先定将，应该打8筒，这样就会有358条、14筒的进张后直接听牌。"
  },
  {
    "id": 936,
    "cards": "234678m445588p55s",
    "answer": "5p",
    "tips": "这手牌应该保留8筒对子，因为靠边的对子比较容易碰牌，同时要尽量保留45筒的搭子作为后续的听牌牌型，所以应该拆掉45筒的对子，正确打法应该打掉5筒，因为5筒比4筒有更大的概率，消耗对方更多的中心牌，可以从最中心的序数牌部位，破坏别人手牌的关联能力，从而降低别人创造多连顺，多门进牌的机会。"
  },
  {
    "id": 937,
    "cards": "23555678m446688p",
    "answer": "6p",
    "tips": "这手牌正确打法应该是拆468的筒子对子，打8筒的话，可以进467筒3门牌；打4筒的话，可以进568筒3门牌；打6筒的话，可以进4578筒4门牌，因此，这手牌打掉6筒是正确打法。"
  },
  {
    "id": 938,
    "cards": "335679m12234447s",
    "answer": "2s",
    "tips": "这手牌应该打掉2条。这手牌是典型的四搭牌，缺搭子，我们需要靠张能力强的单牌重新去组搭子。9万摸来8万可以形成56789万五连牌型。根据麻将口诀金3银7臭28，打掉2条就可以了。"
  },
  {
    "id": 939,
    "cards": "2345568m11788p13s",
    "answer": "8m",
    "tips": "可以看到这手牌是一个六搭牌，如果打掉8筒的话，会丢失8筒的碰张，而且整手牌依然有六搭牌，如果打1条的话会丢失2条的进张。正确的打法应该是打掉8万，因为打掉8万后，没有丢失7万的进张，依旧有234万和556万可以保留7万的进张。"
  },
  {
    "id": 940,
    "cards": "334m677888p11179s",
    "answer": "4m",
    "tips": "这手牌如果打7筒的话，进牌有8条、235万、58筒，总共是6门24张，减去手里的5张，还有19张牌的进牌机会。正确打法应该打掉4万，进牌有8条、3万、56789筒，总共是7门28张，减去手里的8张，还有20张牌的听牌机会，所以打4万才是最大几率打法。"
  },
  {
    "id": 941,
    "cards": "123778m2456p4568s",
    "answer": "8m",
    "tips": "这手牌应该打掉8万，保留8条和2筒，因为8条可以进36789条听牌，2筒也是同样的效率，可以进12347筒听牌，留8万会降低效率，所以正确打法应该打8万。"
  },
  {
    "id": 942,
    "cards": "234888m3568p2334s",
    "answer": "3s",
    "tips": "这手牌的正确答案是打掉3条，我们可以把手牌打成无将一上听，筒子进345678筒，6门牌任何一张都可以听牌。"
  },
  {
    "id": 943,
    "cards": "11344789p344567s",
    "answer": "4s",
    "tips": "根据麻将口诀，这手牌属于三对拆一对的牌型，如果打掉4筒，那么碰出1筒或者碰出4条的情况下，只能打掉3条听在25筒上面，但是如果打掉4条的话，无论是碰出14筒，还是进张25筒，都可听在258条上面，胡牌的几率会更大，所以正确打法应该是打掉4条。"
  },
  {
    "id": 944,
    "cards": "777m456888p35799s",
    "answer": "3s",
    "tips": "这手牌如果打7条只能听夹4条，但是打3条时后续有更好的优化机会，除了听夹6条之外，当摸来8条或者9条时，就可以继续优化手牌打出5条，可以组成7999条或者7899条听牌，所以正确打法应该是打3条。"
  },
  {
    "id": 945,
    "cards": "244456p11234778s",
    "answer": "7s",
    "tips": "根据麻将口诀，三对拆一对的情况，正确打法应该是打掉7条，如果打2筒的话，可以进1679条、47筒，总共6门24张，减掉手上的7张，还有17张牌的进牌机会，同时也丢失了3筒的进张；打7条的话，可以进169条、347筒，总共也是6门24张，减掉手上的5张，还有19张的进牌机会，比打掉2筒多了2张，并且7条是一个中张牌，并不好碰，所以应该打掉7条。"
  },
  {
    "id": 946,
    "cards": "3399m13678p78899s",
    "answer": "8s",
    "tips": "这手牌优先考虑拆掉89条，留下13筒，因为89条进牌只有进7条才有用，进89条，只能组成一个789条一副成牌加8条或者9条的搭子，我们本来就有3万，9万的2个对子了，所以我们的正确打法是打掉这个8条的搭子。"
  },
  {
    "id": 947,
    "cards": "112334m23p244567s",
    "answer": "2s",
    "tips": "这手牌是复合牌型，112334万，成牌可以固定成123万，也可以固定成234万，当123万时，进张就是25万；当234万时，进张就是12万。因此像这手牌，在优先留住两对子的情况下，拆搭就不能拆万子，正确打法应该是打2条。"
  },
  {
    "id": 948,
    "cards": "34m3444567p34567s",
    "answer": "3p",
    "tips": "这手牌如果打3筒，进2345678条、2345万都可以听牌，总共11门。如果打4万，进3万、258条、2358筒都可以听牌，总计8门。因此这手牌打3筒才是最佳打法。"
  },
  {
    "id": 949,
    "cards": "12345788p334778s",
    "answer": "7p",
    "tips": "这手牌符合麻将口诀三对拆一对，是在有两副成牌的情况下，我们三对拆一对，这手牌的正确打法应该打掉7筒，打7筒我们只丢失9筒的进张，而打其它的任何一张都至少丢失了2门的进张，打4条丢25条，打8条丢69条。打掉7筒过后，进368筒、进235679条，9门牌的任何一张都可以把牌打成两对半。"
  },
  {
    "id": 950,
    "cards": "44m2388999p45677s",
    "answer": "4m",
    "tips": "这手牌是三对拆一对的牌型，如果打7条，摸来3条8条变成5连顺，或者上手56条形成双面搭，我们还是去拆4万的对子，这样拆的话，完美错过两对半的牌型。变成了8筒一对定将，两对半牌型在现实中是效率最高的牌型。打4万，摸来3568条，我们可以有4567条4连坎，同时也保留了两对半牌型。来8筒或者7条都可以听14筒。所以正确打法是打掉4万。"
  },
  {
    "id": 951,
    "cards": "579m33577p123789s",
    "answer": "9m",
    "tips": "这手牌的正确打法，应该把它打成一个两对半的牌型，直接打掉5万或者9万，可以保留筒子这边的跳对3连坎，可以碰37筒，可以进46筒，卡6万或者卡8万，共是5门20张，减去手上4张，还有16张进张机会。所以这手牌的正确答案是打掉9万，留下5万的话，我们可以预留进4万做一个优化改良的机会。"
  },
  {
    "id": 952,
    "cards": "334m455666p11567s",
    "answer": "3m",
    "tips": "这手牌有2副成牌，所以我们是三对拆对牌型，这手牌应该打3万，打3万我们只失去碰3万的机会，但是换来的是进1条、25万、34567筒，一共8门牌的任何一张，1进就可以听牌。"
  },
  {
    "id": 953,
    "cards": "56m23555p3456789s",
    "answer": "9s",
    "tips": "这手牌应该打成无将一上听，也就是打掉369条其中的一张，筒子可以进1234筒，万子可以进4567万，总共8门32张，减去手上4张，还有28张进牌机会。像这种手上没有将，打掉手里的孤张，保留双搭做四人抬轿是最大几率打法。正确答案打掉9条。"
  },
  {
    "id": 954,
    "cards": "112456668m46888p",
    "answer": "2m",
    "tips": "这手牌的正确打法应该是打2万，因为打8万会丢失7万的进张，打2万并不会丢失3万的进张，并且可以进5筒、367万听牌。"
  },
  {
    "id": 955,
    "cards": "1223367p3334889s",
    "answer": "4s",
    "tips": "这手牌保留4条是没有价值的，因为4条的能力是摸进2条或者5条，但是这手牌摸进2条，也得把2条打掉，因为它搭子的价值，不如23筒和67筒，摸进5条也得把它打掉，所以说这手牌保留4条在手上，没有任何的能力，所以打掉4条，有机会勾出3条开杠，并且保留9条的话，摸进7条打8条，可以改良成一个加强带碰的四人抬轿。"
  },
  {
    "id": 956,
    "cards": "1122247p2345567s",
    "answer": "4p",
    "tips": "这手牌是一个一对3单的牌型，很明显2345条4连牌型可以进1234567条，是不能动条子，能选的就是打掉47筒其中的一张，打4筒进56789筒有21张，打7筒进23456筒20张减去自己手上4张有16张进张机会，所以正确打法应该是打4筒。"
  },
  {
    "id": 957,
    "cards": "3446m455p1234789s",
    "answer": "4p",
    "tips": "这手牌虽然打掉6万，我们不丢5万的进张，但是打掉6万，我们就失去了一进听牌的机会，留下6万我们们才能保证手牌五搭牌的完整性，我们要先把牌定型再去做改良，所以6万不能打，14条也不能打，留下14条，我们可以进123456条6门牌，去做优化改良，摸进123456条任意一张再打6万，如果我们留下4筒，摸来36筒也听不了牌。五搭牌只有一个对子且一进听牌的时候，果断先定将。所以正确打法是打掉4筒。"
  },
  {
    "id": 958,
    "cards": "223468m23666888p",
    "answer": "2m",
    "tips": "这手牌如果打2万，可以进678万、1234筒，总共7门牌，如果打8万，可以进256万、14筒，总共5门牌，所以这手牌正确打法应该打掉2万。"
  },
  {
    "id": 959,
    "cards": "11135m12278p2457s",
    "answer": "2s",
    "tips": "这手牌是一个两进听的牌型，没有那么快听牌，所以打掉1筒是不对的，因为2457条里面，2条和7条的作用都是进3条和6条，45条的作用也是如此，所以这手牌应该在2条和7条之间选择，根据麻将口诀金3银7臭28原则，应该打掉2条。"
  },
  {
    "id": 960,
    "cards": "3578999m1134899p",
    "answer": "8m",
    "tips": "这手牌根据六搭拆搭原理，拆搭的原则就是拆掉丢张少或者说不丢张的牌，首先这里打掉8筒肯定是不明智的，因为打掉8筒，手里还是六搭牌，打掉3万之后我们会丢4万的进张，打掉4筒，虽然说手牌可以被打成五搭，但是丢了5筒的进张，所以正确打法应该是打掉8万，保留8万的作用是进69万，打掉后也不会丢失69万的进张。"
  },
  {
    "id": 961,
    "cards": "233456778m23478p",
    "answer": "3m",
    "tips": "这手牌的正确打法应该是打掉3万，可以进12456789万、6789筒，一共12门48张牌，减去手牌9张还有39张进牌机会，比打掉2、8条多了20张的进张机会。"
  },
  {
    "id": 962,
    "cards": "113557p11234678s",
    "answer": "5p",
    "tips": "这手牌的正确打法应该是打掉5筒，进1条、1246筒总共5门20张，减掉手上的4张，共16张的进牌机会可以听牌，比打7筒多了两张，并且保留了357筒3连坎牌型，是最优打法。"
  },
  {
    "id": 963,
    "cards": "23666m1234567p78s",
    "answer": "1p",
    "tips": "这手牌应该打掉147筒其中一张，打出去后就成了无将一上听四人抬轿牌型，四人抬轿就是保留3副成牌，外加两个两面搭，这时候两个搭子的周边，摸进6789条，1234万都可以听牌，总共8门32张，减去手牌的4张，还有28张的一进听牌机会。"
  },
  {
    "id": 964,
    "cards": "23378m344568p111s",
    "answer": "2m",
    "tips": "这手牌根据麻将口诀“一对先定将”，正确打法应该先打掉2万，可以进69万和257筒听牌。"
  },
  {
    "id": 965,
    "cards": "345788p12344588s",
    "answer": "4s",
    "tips": "这手牌应该在788筒和445条之间进行拆对，如果打掉4条，可以进368条、689筒，总共6门19张牌；如果打8筒，可以进3468条、69筒，总共也是6门19张牌；考虑到8筒对子比4条对子更好碰出，所以应该拆445条，但是由于手牌有123条可以和45条连起来，所以打掉4条，才是最正确最安全的打法。"
  },
  {
    "id": 966,
    "cards": "22245667m345999p",
    "answer": "6m",
    "tips": "这手牌应该打掉6万听牌，一共听347万3门牌，比打掉其他牌要听的多。"
  },
  {
    "id": 967,
    "cards": "334788m22356789s",
    "answer": "3s",
    "tips": "根据麻将口诀，三对拆一对是在有两副成牌的情况下，才去做三对拆一对，没有两副成牌三对也可以不拆对，应该打掉一个搭子，这手牌如果打7万的话，会丢失69万的进张，打掉4万会丢失25万的进张，打掉3条只会丢失一个1条的进张，所以应该打3条。"
  },
  {
    "id": 968,
    "cards": "44555m45p4456788s",
    "answer": "4s",
    "tips": "根据麻将口诀，这手牌是典型的三对拆一对牌型，需要从48条和4万之间拆掉一对，由于8条更容易碰出，优先考虑留下，因此剩下4条和4万可以选择，正确打法应该是打4条，因为如果打4万，那另外一张4万，就会变成没有用的单牌，而打4条，剩下的4条还可以组成4567条四连牌型。所以应该打4条。"
  },
  {
    "id": 969,
    "cards": "2223579m1123468p",
    "answer": "9m",
    "tips": "这手牌如果打掉8筒的话，只能进48万，如果打掉9万的话，可以进7筒、46万，所以正确打法应该是先打掉9万，把3579万先打成357万3连坎，然后再调整机会看看1筒能不能碰出，如果碰出的话，打掉7万，就可以把手牌打成一个超级四人抬轿，可以进678筒、1345万听牌，所以应该打9万。"
  },
  {
    "id": 970,
    "cards": "3588999m3588899p",
    "answer": "5m",
    "tips": "这手牌根据麻将口诀，六搭拆搭，所以需要从35筒和35万中间做选择，考虑到手牌的关联性，关联点就在5筒和5万，5筒右边的进张是67筒假设打了5筒和3筒，后面进了67筒，和8筒组成了一副成牌，然后保留一对8筒，一对9筒一共还是六搭牌，并没有对手牌起到推进的作用。所以正确打法应该是打掉5万，后面进67万后，可以和8万组成一副成牌，碰到8万就是五搭牌型。"
  },
  {
    "id": 971,
    "cards": "6678m112334p7888s",
    "answer": "3p",
    "tips": "这手牌的正确打法应该是打3筒，打6万可以进12345筒、56789条，一共10门。打7条可以进12345筒、456789万共11门。打3筒可以进1筒、456789万，56789条，一共12门。"
  },
  {
    "id": 972,
    "cards": "335679m12234447s",
    "answer": "2s",
    "tips": "这副牌我们应该打掉2条。此牌是典型的四搭牌，缺搭子，我们需要靠张能力强的单牌重新去组搭子，7条靠张能力最强不打；9万属于567万的衍牌，也不能打；打掉2条可以形成1234条4连牌型加一个4条对子，所以这牌咱直接打掉2条。"
  },
  {
    "id": 973,
    "cards": "11288m2368p34667s",
    "answer": "8p",
    "tips": "这手牌根据麻将口诀，六搭拆搭，小技巧就是优先拆搭，而不是三对拆一对。所以这手牌正确打法应该是打8筒，因为其他3个选项打出去后，手里还是六搭牌。"
  },
  {
    "id": 974,
    "cards": "1245667p1124889s",
    "answer": "1p",
    "tips": "这手牌可能很多人会选择打掉4条，不仅变成五搭牌，而且进3条也不丢张，但是这样打就会剩下一对8条做将，有效进张就只有358筒了。所以更优秀的打法应该是打掉1筒，后面不论是进3筒还是进58筒，都可以把牌型打成两对半的牌型，胜率会比打4条更高，所以正确打法应该是打1筒。"
  },
  {
    "id": 975,
    "cards": "4677m4667p223888s",
    "answer": "4p",
    "tips": "这手牌应该优先打掉有重复进张的牌，需要在4万和4筒之间做一个选择，需要注意的是后续如果碰了7万，那46万依然可以组成一个搭子，但是如果碰了6筒，剩下的47筒就会变成散牌，所以正确打法应该打掉4筒。"
  },
  {
    "id": 976,
    "cards": "345667m12366799s",
    "answer": "6m",
    "tips": "这手牌是三对拆一对牌型，如果打掉6条，接下来碰了9条，那6条就只能做将，听在58条上，但是如果打掉6万即使碰了9条，也可以听在258万上，比打9条多1门，所以正确打法应该是打6万。"
  },
  {
    "id": 977,
    "cards": "66778m56p1233356s",
    "answer": "6s",
    "tips": "这手牌估计有不少人秒打12条，保留3条开杠空间，这个牌打出12条，手牌就打倒退啦，打成2进听牌，手牌分解后缺对，我们肯定看成123条一副成牌加3条对子，那么我们在3个双面搭子里面做选择，注意看，我们手牌分解成一对3条带123条最合理，那么3个双面搭子里面，是不是我们只有打出这个6条我们只丢1门7条，因为来4条，我们35条接住，打出3条，把手牌推进成四人抬轿。合理的选择，打出这张6条。"
  },
  {
    "id": 978,
    "cards": "1115667m234p2337s",
    "answer": "2s",
    "tips": "根据麻将口诀，应该一对先定将，这手牌的正确打法应该是打掉2条，因为打掉7条的话，可以进1234条、45678万，总共9门36张，减去手牌7张，还有29张的进牌机会；打掉6万的话，可以进123456789条，总共9门36张，减去手牌4张，还有32张进牌机会。但是打2条的话，可以进45678万、356789条，总共11门44张，减掉手牌7张，还有37张进牌的机会。"
  },
  {
    "id": 979,
    "cards": "13567889m133456p",
    "answer": "1p",
    "tips": "这手牌如果打掉9万的话，可以进28万、23筒，一共4门。如果打掉1筒的话，可以进2478万、3筒，一共5门，而且可以把手牌打成一个两对半的牌型，所以正确打法应该是打掉1筒。"
  },
  {
    "id": 980,
    "cards": "123m34889p224578s",
    "answer": "5s",
    "tips": "根据麻将口诀“六搭拆搭'，无论打8筒还是9筒之后，手上还是六搭牌，所以需要把牌型尽快打成五搭牌型。正确打法是应该打掉5条，因为5条是一个衍牌，224条可以进3条、78条可以进6条，所以这张5条是没有多大作用的，应该直接打掉。"
  },
  {
    "id": 981,
    "cards": "123334778m13556s",
    "answer": "3m",
    "tips": "这手牌还没有那么快听牌，考虑打掉哪张不容易损失更多的进张机会，如果打1条，损失2条1门的机会；如果打1万，损失2万和5万两门的机会；如果打3万，只会损失3万1门一张的进张机会，况且绝张的中心牌更不容易进张，所以这手牌应该打掉3万。"
  },
  {
    "id": 982,
    "cards": "34567m7888p23345s",
    "answer": "7p",
    "tips": "这手牌的正确打法应该是打掉7筒，可以进123456条、2345678万，一共13门52张牌，减去手上的10张，一共有42张进牌就听牌的机会。"
  },
  {
    "id": 983,
    "cards": "116778m2333p3456s",
    "answer": "2p",
    "tips": "这手牌打7万，进14筒，牌型变成两对牌，不能一进听牌，36条更加不能打，3456条的4连牌型，可以进12345678条、进56789万都可以听牌，所以正确打法是打掉2筒，2筒的有效进张只有14筒，进了14筒，牌型变成两对牌，不能一进听牌，进其它的张还是要打掉2筒。所以正确打法是打掉2筒。"
  },
  {
    "id": 984,
    "cards": "11156899m224578p",
    "answer": "5p",
    "tips": "这手牌是六搭牌型，六搭牌的原则是，第一步把六搭牌打成五搭牌，以不丢张或少丢张的原则，这手牌，所以打掉5筒，能把牌打成五搭牌，也不会丢失369筒的进张。"
  },
  {
    "id": 985,
    "cards": "22357888p234678s",
    "answer": "3p",
    "tips": "这手牌打掉一张后直接听牌，考虑到后续改良可能性正确打法应该打掉3筒，如果后续再进2筒，就可以改良成7888筒，听3门的牌型。"
  },
  {
    "id": 986,
    "cards": "1223478m1122378s",
    "answer": "1m",
    "tips": "这手牌分解手牌后，看成两副成牌234万，123条，剩下4个搭子，12万、78万、12条、78条中间拆一个，那肯定从12万或者12条之间拆掉1搭，所以正确打法应该是打掉1万，后续无将时，留12条还可以碰一对，留一对做将。"
  },
  {
    "id": 987,
    "cards": "1245667p1124889s",
    "answer": "1p",
    "tips": "可能很多人会选择打掉4条，不仅变成五搭牌，而且进3条也不丢张，但是这样打就会剩下一对8条做将，有效进张就只有358筒了。所以更优秀的打法应该是打1筒，后面不论是进3筒还是进58筒，都可以把牌型打成两对半的牌型，胜率会比打4条更高，所以正确打法应该是打1筒。"
  },
  {
    "id": 988,
    "cards": "23355789p114567s",
    "answer": "3p",
    "tips": "这手牌的正确打法应该是打掉3筒，可以进145筒、13568条一共8门牌，并且下叫听牌的质量也是比较高的，但是如果打47条的话，后期很有可能会听在1条和5筒的对倒胡上。"
  },
  {
    "id": 989,
    "cards": "23677899p234556s",
    "answer": "7p",
    "tips": "这手牌根据麻将口诀“两对拆搭”，正确打法应该直接打掉7筒，把手牌打成一个两对半的牌型，打掉7筒后，进张可以是14筒、碰9筒、进147条、碰5条，比打掉5条多了两门牌的进张。"
  },
  {
    "id": 990,
    "cards": "11288m2368p34667s",
    "answer": "8p",
    "tips": "这手牌根据麻将口诀，六搭拆搭，小技巧就是优先拆搭而不是三对拆一对，所以这手牌正确打法应该是打8筒，因为其他3个选项打出去后，手里还是六搭牌。"
  },
  {
    "id": 991,
    "cards": "56667889m134456p",
    "answer": "8m",
    "tips": "这手牌应该打掉8万，可以摸进25筒听457万、摸进147筒、457万都可以听牌、有8门32张减去手上的6张，一共有26张的听牌机会，比打掉1筒多了7张，提升了40%左右的听牌速度。"
  },
  {
    "id": 992,
    "cards": "34m222468p334888s",
    "answer": "4s",
    "tips": "这手牌根据麻将口诀，一对先定将，因此正确打法应该是打掉4条，专心优化万子和筒子的搭子。468筒为3连坎肯定不打。"
  },
  {
    "id": 993,
    "cards": "11234678m113557s",
    "answer": "5s",
    "tips": "这手牌的正确打法应该是打掉5条，进1万、1246条总共5门20张，减掉手上的4张，共16张的进牌机会可以听牌，比打7条多了两张，并且保留了357条3连坎牌型，是最优打法。"
  },
  {
    "id": 994,
    "cards": "3578999p1134899s",
    "answer": "8p",
    "tips": "这手牌根据六搭拆搭原理，拆搭的原则就是拆掉丢张少或者说不丢张的牌，首先这里打掉8条肯定是不明智的，因为打掉8条，手里还是六搭牌，打掉3筒之后我们会丢4筒的进张，打掉4条，虽然说手牌可以被打成五搭，但是丢了5条的进张，所以正确打法应该是打掉8筒，保留8筒的作用是进69筒，打掉后也不会丢失69筒的进张。"
  },
  {
    "id": 995,
    "cards": "246m123999p57889s",
    "answer": "8s",
    "tips": "这手牌应该选择打掉8条，因为打8条后整手牌会变成无将一上听，摸进5条可以听牌，保留3连坎摸进2356万也可以听牌。"
  },
  {
    "id": 996,
    "cards": "2223889m3477889s",
    "answer": "3m",
    "tips": "这手牌能打的只有39万，并且效果都是一样的，可以进2569条听牌，既然效果是一样的，那么就要去考虑后续的改良空间，如果打掉9万的话，摸进134万对整手牌都没有任何的改良，都需要拆搭，所以这手牌正确打法应该是打掉3万，摸进78万，可以把手牌改成四人抬轿牌型。"
  },
  {
    "id": 997,
    "cards": "112456668p46888s",
    "answer": "2p",
    "tips": "这手牌的正确打法应该是打2筒，因为打8筒会丢失7筒的进张，打2筒并不会丢失3筒的进张，并且可以进5条、367筒听牌。"
  },
  {
    "id": 998,
    "cards": "1245667m1124889p",
    "answer": "1m",
    "tips": "这手牌可能很多人会选择打掉4筒，不仅变成五搭牌，而且进3筒也不丢张，但是这样打就会剩下一对8筒做将，有效进张就只有358万了。所以更优秀的打法应该是打1万，后面不论是进3万还是进58万，都可以把牌型打成两对半的牌型，胜率会比打4筒更高，所以正确打法应该是打1万。"
  },
  {
    "id": 999,
    "cards": "224567p34666778s",
    "answer": "7p",
    "tips": "这手牌如果打掉8条的话，可以进257条、23筒，一共5门。如果打掉7条的话，可以进2569条、23筒，一共6门。如果打掉7筒，可以进256789条、23筒，一共7门。所以正确答案是打7筒。"
  },
  {
    "id": 1000,
    "cards": "345566m34567778p",
    "answer": "6m",
    "tips": "这手牌正常情况下都会打36万，虽然同样是听47万，但建议打6万，首先保持出牌安全性，因为6万有一对，3万只是单张，这样打6万相对不容易被碰，其次保持序数牌延伸优势，打6万后，后续如果来2万或者7万再打出5万，手牌就可以优化成23456万，或者34567的五连牌型听3门。所以正确答案打掉6万。"
  },
  {
    "id": 1001,
    "cards": "1234456m2224589s",
    "answer": "9s",
    "tips": "这手牌听牌数量都较多的时候应该追求听牌质量而不是数量。打14万，可进3-9条，24张听牌机会。打9条，可进147万、368条，20张听牌机会。比打14万少了4张，但是打14万，进3456条都是1门听牌，而打9条听牌都是2门或者3门。所以正确答案打掉9条。"
  },
  {
    "id": 1002,
    "cards": "116778m2333p3456s",
    "answer": "2p",
    "tips": "这手牌是六搭牌型，且有2个对子，打掉5筒没有丢失369筒的进张，打掉58万没有做到六搭拆搭，正确打法是打掉5筒。把整手牌打成了五搭牌，也没有丢失3筒的进张。"
  },
  {
    "id": 1003,
    "cards": "11156899m224578p",
    "answer": "5p",
    "tips": "这首牌是六搭牌型,且有2个对子,打掉5筒没有丢失369筒的进张,打掉58万没有做到六搭拆搭,正确打法是打掉5筒。把整手牌打成了五搭牌,也没有丢失3筒的进张。"
  },
  {
    "id": 1004,
    "cards": "33488m233444678s",
    "answer": "3m",
    "tips": "这手牌的正确的打法是打掉3万，保留233444条的321牌型，进张是258万、12345条，总共是8门32张，减去手牌8张，还有24张进牌。"
  },
  {
    "id": 1005,
    "cards": "2226678m1113479s",
    "answer": "6m",
    "tips": "这手牌正确的打法，应该是打掉6万，把手牌打成无将一上听，四人抬轿的牌型，可以进2345789条，总共7门28张，减去手牌4张，一共24张进张机会，比打掉9条和4条，多了7张牌的进张机会。"
  },
  {
    "id": 1006,
    "cards": "23677899m234556p",
    "answer": "7m",
    "tips": "这手牌根据麻将口诀，两对拆搭，正确打法应该直接打掉7万，把手牌打成一个两对半的牌型，打掉7万后，进张可以是14万、碰9万、进147筒、碰5筒，比打掉5筒多了两门牌的进张效果。"
  },
  {
    "id": 1007,
    "cards": "345788m12344588p",
    "answer": "1p",
    "tips": "这手牌应该在788万和445筒之间进行拆对，如果打掉4筒，可以进368筒、689万，总共6门19张牌；如果打8万，可以进3468筒、69万，总共也是6门19张牌；考虑到8万对子比4筒对子更好碰出，所以应该拆445筒，但是由于手牌有123筒可以和445筒连起来，所以打掉1筒，才是最正确最安全的打法。"
  },
  {
    "id": 1008,
    "cards": "22245899m113467s",
    "answer": "4s",
    "tips": "这手牌是六搭拆搭的牌型，第一步是在不丢张或者少丢张的情况下，把六搭牌推进成五搭牌，所以正确打法应该打4条，打4条把牌打成了五搭牌，条子也不会损失25条的进张，而打其他的任何一张牌，都会损失进张。"
  },
  {
    "id": 1009,
    "cards": "2255578m2245667p",
    "answer": "2p",
    "tips": "这手牌要拆掉两个搭子和两个对子，在听牌时，搭子的效率要比对子高，所以应该在2筒和2万之间做选择。打2万的话，可以进69万、58筒总共4门牌；打2筒的话，可以进69万、358筒总共5门牌，所以这手牌打掉2筒是最佳打法，多进1门3筒。"
  },
  {
    "id": 1010,
    "cards": "368m12445568888s",
    "answer": "1s",
    "tips": "这手牌正确打法应该先打1条，不影响3条的进张，并且可以创造优化手牌的机会，因为有两个进单张的边搭12条和坎搭368万，其中边搭12条是所有搭子里最不容易进张的搭子，会拖慢手牌进牌效率，所以应该打1条。"
  },
  {
    "id": 1011,
    "cards": "23778m245667p999s",
    "answer": "8m",
    "tips": "这手牌根据麻将口诀“一对先定将”，应该打8万，这样就会有358筒、14万的进张后直接听牌。"
  },
  {
    "id": 1012,
    "cards": "113557p11234678s",
    "answer": "5p",
    "tips": "这手牌的正确打法应该是打掉5筒，进1条、1246筒总共5门20张，减掉手上的4张，一共16张的进牌机会可以听牌，比打7筒多了两张，并且保留了两个对子和357筒3连坎牌型，所以打掉5筒是最优打法。"
  },
  {
    "id": 1013,
    "cards": "44455567m1238p25s",
    "answer": "2s",
    "tips": "这手牌是一个一对3单的牌型，要注意重复进张，如果打8筒的话，保留25条来做靠张一上听，3条和4条是重复进张，所以这样的话效率会降低很多，所以像这种一对3单靠张一上听的牌，就不要保留条1门花色的，特别是有重复进张的，所以应该打掉2条，因为5条的进张能力是比2条要更强的。"
  },
  {
    "id": 1014,
    "cards": "33577m123789p579s",
    "answer": "5s",
    "tips": "这手牌的正确打法，应该把它打成一个两对半的牌型，直接打掉5条或者9条，可以保留万子这边的跳对3连坎，可碰3万、可进4万、可碰7万、可进夹6条或者夹8条，共是5门20张，减去手上4张，还有16张进张机会，所以应该打5条。"
  },
  {
    "id": 1015,
    "cards": "23677899m234556p",
    "answer": "7m",
    "tips": "这手牌根据麻将口诀，两对拆搭，正确打法应该直接打掉7万，把手牌打成一个两对半的牌型，打掉7万后，进张可以是14万、碰9万、进147筒、碰5筒，比打掉5筒多了两门牌的进张效果。"
  },
  {
    "id": 1016,
    "cards": "455666m11567p334s",
    "answer": "3s",
    "tips": "三对拆对牌型，应该打3条，只是会失去碰3条的机会，但是换来的是进1筒、25条、34567万就可以听牌的牌型。一共是8门牌的进张。"
  },
  {
    "id": 1017,
    "cards": "11788m13p2345568s",
    "answer": "8s",
    "tips": "可以看到这手牌是一个六搭牌，如果打掉8万的话，会丢失8万的碰张，而且整手牌依然有六搭牌，如果打1筒的话会丢失2筒的进张。正确的打法应该是打掉8条。因为打掉8条后，没有丢失7条的进张，依旧有234条和556条可以保留7条的进张。"
  },
  {
    "id": 1018,
    "cards": "2226678m1113479s",
    "answer": "6m",
    "tips": "这手牌正确的打法，应该是打掉6万，把手牌打成无将一上听，四人抬轿的牌型，可以进2345789条，总共7门28张，减去手牌4张，一共24张进张机会，比打掉9条和4条，多了7张牌的进张机会。"
  },
  {
    "id": 1019,
    "cards": "6678m112334p3334s",
    "answer": "3p",
    "tips": "这手牌如果打1筒的话，可以进25筒、69万、245条，总共7门牌；如果打3筒的话，可以进1筒、23456条、456789万，总共12门牌；如果打6万，可以进12345筒、23456条，总共10门牌；如果打4条，可以进12345筒、456789万，总共11门牌。所以正确答案应该打掉3筒。"
  },
  {
    "id": 1020,
    "cards": "3588999p3588899s",
    "answer": "5p",
    "tips": "这手牌根据麻将口诀，六搭拆搭，所以需要从35条和35筒中间做选择，考虑到手牌的关联性，关键点就在5条和5筒，5条右边的进张是67条，假设打了5条和3条，后面进了67条，和8条组成了一副成牌，然后保留一对8条，一对9条，一共还是六搭牌，并且没有对手牌起到推进的作用。所以正确打法应该是打掉5筒，后面进67筒后，可以和8筒组成一副成牌，打掉8筒就是五搭牌型。"
  },
  {
    "id": 1021,
    "cards": "45688m124588p368s",
    "answer": "1p",
    "tips": "这手牌正确打法应该先打1筒，不影响3筒的进张，并且可以创造优化手牌的机会，因为有两个进单张的边搭12筒和坎搭368条，其中边搭是所有搭子里最不容易进张的搭子，会拖慢手牌进牌效率，所以应该打1筒。"
  },
  {
    "id": 1022,
    "cards": "1234m1225667p355s",
    "answer": "1p",
    "tips": "首先这手牌的四连牌型和大肚牌型不能动，因为这种牌型的靠张能力非常强，正确打法应该打掉1筒，因为打掉1筒后，可以进45条、2356万、24578筒都是有用的，所以打掉1筒是最高效的打法。"
  },
  {
    "id": 1023,
    "cards": "1115667m234p2337s",
    "answer": "2s",
    "tips": "这手牌是一对3单的牌型，首先6万是绝对不能打的，因为5667万属于大肚牌型，它的靠张能力非常强，摸进45万、78万都能把它变成一个好搭子，所以这手牌论单张的进张能力，2条肯定不如7条，因为根据麻将口诀金3银7，所以这手牌的正确打法应该是打掉2条，保留6万和7条，去做一个靠张一上听，摸进45678万可以碰出3条，摸进56789条，都可以听胡，所以应该打2条。"
  },
  {
    "id": 1024,
    "cards": "57889m888999p335s",
    "answer": "8m",
    "tips": "这手牌把8万拆出来，是一个一对3单的牌型，应该打8万，这样就会有34567条和34567万的进张听牌机会。"
  },
  {
    "id": 1025,
    "cards": "12345788p334778s",
    "answer": "7p",
    "tips": "这手牌的正确打法应该打掉7筒，因为打掉7筒并不会损失6筒的进张，但是打3条或者7条，都会损失较多的进张，所以应该打7筒。"
  },
  {
    "id": 1026,
    "cards": "233456778m23478p",
    "answer": "3m",
    "tips": "这手牌的正确打法应该是打掉3万，可以进12456789万、6789筒，一共12门48张牌，减去手牌9张还有39张进牌机会，比打掉28万多了20张的进张机会。"
  },
  {
    "id": 1027,
    "cards": "123444788m13579s",
    "answer": "7m",
    "tips": "这手牌13579条为5连坎，靠搭能力非常强。根据麻将口诀，一对先定将，正确打法应该先打掉7万，可以进2468条听牌。"
  },
  {
    "id": 1028,
    "cards": "124588m12333678s",
    "answer": "1m",
    "tips": "这手牌把123条当成1搭，一对3条当成1搭，有六搭牌。六搭拆搭。根据丢张最少进张最多原则，打1万不丢3万进张。所以正确答案打掉1万。"
  },
  {
    "id": 1029,
    "cards": "44789m113577p123s",
    "answer": "7p",
    "tips": "这手牌打7筒保留357筒的3连坎的进张机会。可进牌为4万、1246筒，共20-4=16张进张听牌机会。打1筒和7筒进张机会相同，但1筒相对碰出机会大一些。打4万的话，只有来147筒才能听牌，进张机会为12-4=8张。所以打出7筒为最佳选择。"
  },
  {
    "id": 1030,
    "cards": "3456m23345667p34s",
    "answer": "3m",
    "tips": "这手牌根据丢张最少进张最多原则，打出36万。进张机会为134568筒、进25条有8门进牌听牌机会。所以正确答案打掉3万。"
  },
  {
    "id": 1031,
    "cards": "6789m78p23345667s",
    "answer": "9m",
    "tips": "这手牌里有两个大肚牌型（2334条、5667条为大肚牌型）相连叫双翼牌型，进张机会是相当多的，所以不拆条子。打掉69万，进134568条、69筒都能听牌。进张机会有32-6=26张。所以正确答案先打掉9万。"
  },
  {
    "id": 1032,
    "cards": "67799m678p234556s",
    "answer": "5s",
    "tips": "这手牌有两个成牌加三个对子时，遵循三对拆一对原则，拆掉有最好搭子的对子。所以正确答案是打掉5条。进张56789万、147条可以听牌，32-6=16张进张听牌机会。进56789万，听147条。进147条打7万听58万。都是很不错的听口。"
  },
  {
    "id": 1033,
    "cards": "2334568m1156688s",
    "answer": "8m",
    "tips": "这手牌根据麻将口诀三对拆一对是在有两个成牌的情况下。这里只有456万1个成牌。所以根据丢张最少进张最多原则打出8万。打8万没有丢张。"
  },
  {
    "id": 1034,
    "cards": "12366799m345667s",
    "answer": "6s",
    "tips": "这手牌手上有两副成牌时，三对拆对，拆掉带好搭子的对子。这里打出6条，条子可进张为258条，万子可以进56789万，8门32-6=26张进牌机会。摸258条打6万听58万；摸56789万听258条。正确答案打掉6条。"
  },
  {
    "id": 1035,
    "cards": "45m44599p3477789s",
    "answer": "9s",
    "tips": "这手牌有六搭牌，六搭拆搭，保留好的搭子。只能在8条和9条中做选择，保留7条杠的机会。所以起手摸到这手牌应该先打掉9条。"
  },
  {
    "id": 1036,
    "cards": "11122234566788p",
    "answer": "8p",
    "tips": "这手牌打6筒胡258筒共12-6=6张胡牌机会，打8筒胡12369筒共20-9=11张胡牌机会。所以正确答案打掉8筒。"
  },
  {
    "id": 1037,
    "cards": "34m2334578p22678s",
    "answer": "8p",
    "tips": "这手牌根据麻将口诀“一对定将”，2条不能拆。打3筒进69筒或是25万可以听牌，共16张进张听牌机会。打8筒进146筒或是25万可以听牌，共20-1=19张进张听牌机会。比打3筒多了3张听牌机会。所以正确答案打掉8筒。"
  },
  {
    "id": 1038,
    "cards": "11124789m112489p",
    "answer": "4p",
    "tips": "这手牌打出4筒，进3万和7筒都可以听牌。如果打出4万，进了37筒可以听牌。听牌机会相同，但是打了4万，来了3万相当要拆出一个1万来做成牌，丢了杠出机会。所以建议打出4筒。"
  },
  {
    "id": 1039,
    "cards": "668m1156p1233367s",
    "answer": "1s",
    "tips": "在这副手牌中56筒、67条都是双面搭，摸进47筒、58条就能组成成牌了，打出8万，这牌依然是六搭牌，并且会丢失7万的进张。这副牌当中，3条就可以组成一副成牌，所以12条的价值是最低的，我们直接打掉。因此可以拆掉12条，根据选项则选择打掉1条。"
  },
  {
    "id": 1040,
    "cards": "1245667p2455568s",
    "answer": "2s",
    "tips": "这手牌，如何正确的分解手牌是处理这手牌的关键，很多麻友去拆12筒就是不会分解手牌，分解完发现手牌是两进听，已经是5搭牌了。2条和8条是两张孤张，所以可以打掉。"
  },
  {
    "id": 1041,
    "cards": "999m357999p46778s",
    "answer": "4s",
    "tips": "这手牌打4条不丢张，进7条、34678筒可以听牌。摸进5689条，打出3筒优化成更好的四人抬轿。摸进7条打出3筒听6筒。摸进4筒打7条听78筒。摸进8筒打7条听4筒。摸进6筒打7条单吊3筒。所以正确答案打掉4条。"
  },
  {
    "id": 1042,
    "cards": "2334m3334p234599s",
    "answer": "4p",
    "tips": "这手牌分解后，三副成牌，一对三单，注意搭子的传递功能，2334万大肚牌型靠搭能力很强，进12345万，而且摸到1245万都是双面听，2345条靠搭1234567条都可以听牌，4筒靠搭23456筒，但是只有摸到3筒和5筒才能形成双面搭，3筒手上已经有三张，所以打掉靠搭能力最弱的4筒最合理。"
  },
  {
    "id": 1043,
    "cards": "788999m12336778s",
    "answer": "7m",
    "tips": "这手牌打出7万，8万做将，进8万123456789条都可听牌，进张机会为40-8-2=30张，进2468条都可以形成双面好听。打3条，进56789条、56789万可听牌，进张机会为40-10=30张，进68条才可以形成双面好听，所以打7万，听口质量有可能会好一些。打7条和打3条概率相同。"
  },
  {
    "id": 1044,
    "cards": "23m2355999p23778s",
    "answer": "2s",
    "tips": "由于听牌只需要五搭牌，现在这手牌有六搭牌，没有孤张和卡搭需要拆掉1搭。拆2条，只丢失1条的进张。丢张最少进张最多。所以正确答案打掉2条。"
  },
  {
    "id": 1045,
    "cards": "2478m22899p23378s",
    "answer": "2m",
    "tips": "这手牌是六搭牌，搭子多了，必须拆掉1搭，只有拆24万卡张搭子，先打边张，保留中心张。"
  },
  {
    "id": 1046,
    "cards": "113557m12344467s",
    "answer": "7m",
    "tips": "这手牌根据麻将口诀“两对拆搭”。因为两对拆对的话，损失了两个碰牌机会。打出7万，进1245万、58条都可以听牌。进张机会为20张，而且进1245万，都能形成两面好听口。打5万，进46万、58条都可以听牌，进张机会为16张。所以正确答案打掉7万。"
  },
  {
    "id": 1047,
    "cards": "22245667m345999s",
    "answer": "6m",
    "tips": "这手牌应该打掉6万听牌，一共听347万3门，比打掉其他牌要听的多。"
  },
  {
    "id": 1048,
    "cards": "334779m12366789p",
    "answer": "3m",
    "tips": "这手牌应该打掉3万。此牌是典型的三对牌型，3个对子两副成牌，所以根据三对拆一对原则，拆掉好成牌的对子，留下不好牌的对子去碰牌、组牌，所以拆掉3万有较大概率听25万，如果拆掉7万就会听卡8万，所以这牌应该打掉3万。"
  },
  {
    "id": 1049,
    "cards": "466678m13445667s",
    "answer": "4m",
    "tips": "这手牌打掉4万，进2458条（进2条打6条，胡4条和69万，进5条打1条，形成258条的好叫口），进69万都可以听牌，进张听牌机会为6*4-8=16张，而且增加了4条的碰出机会。"
  },
  {
    "id": 1050,
    "cards": "22899m23378p2478s",
    "answer": "2s",
    "tips": "这手牌是六搭牌，搭子多了，必须拆掉1搭，只有拆24条卡张搭子，先打边张，保留中心张。所以正确答案打掉2条。"
  },
  {
    "id": 1051,
    "cards": "12344467p113557s",
    "answer": "7s",
    "tips": "这手牌属于两对拆搭。因为两对拆对的话，损失了两个碰牌机会。打出7条，进1245条、58筒都可以听牌。进张机会为20张，而且进1245条，都能形成两面好听口。打5条，进46条、58筒都可以听牌，进张机会为16张。所以正确答案打掉7条。"
  },
  {
    "id": 1052,
    "cards": "345999p22245667s",
    "answer": "6s",
    "tips": "这手牌很明显应该打掉6条，听347条，比打掉2条、9筒，多1门听口。"
  },
  {
    "id": 1053,
    "cards": "1223367p3334889s",
    "answer": "4s",
    "tips": "这手牌保留4条是没有价值的，因为4条的能力是摸进2条或者5条，但是这手牌摸进2条，也得把2条打掉，因为它搭子的价值，不如23筒和67筒，摸进5条也得把它打掉，所以说这手牌保留4条在手上没有任何的能力，所以打掉4条，有机会勾出3条开杠，并且保留9条的话，摸进7条打8条，可以改良成一个加强代碰的四人抬轿。"
  },
  {
    "id": 1054,
    "cards": "1115667m234p2337s",
    "answer": "2s",
    "tips": "这手牌在一进听牌的情况下一对先定将。打出6万，摸123456789条可以听牌，进张机会为36-4=32张进张机会。摸68条可以形成两面听；打出7条，进张机会为45678万、1234条可以听牌，进张机会为36-4-3=29张进张机会。摸45678万都可以形成两面听：打出2条，摸45678万、56789条可以听牌，进张机会为40-4-1=35张进张机会，摸4578万、68条都可以形成两面听。所以正确答案打掉2条。"
  },
  {
    "id": 1055,
    "cards": "13445667p466678s",
    "answer": "4s",
    "tips": "这手牌应该打掉4条，进2458筒（进2筒打6筒，胡4筒和69条；进5筒打1筒，形成258筒的好叫口），进69条都可以听牌，进张听牌机会为6*4-8=16张，而且增加了4筒的碰出机会。"
  },
  {
    "id": 1056,
    "cards": "244456m11234778p",
    "answer": "7p",
    "tips": "根据麻将口诀，三对拆一对的情况，正确打法应该是打掉7筒，如果打2万的话，可以进1679筒、47万，总共6门24张，减掉手上的7张，还有17张牌的进牌机会，同时也丢失了3万的进张；打7筒的话，可以进169筒、347万，总共也是6门24张，减掉手上的5张，还有19张的进牌机会，比打掉2万多了2张，并且7筒是一个中张牌，并不好碰，所以应该打掉7筒。"
  },
  {
    "id": 1057,
    "cards": "344568m111p23378s",
    "answer": "2s",
    "tips": "这手牌根据麻将口诀“一对先定将”，正确打法应该先打掉2条，可以进69条和257万听牌。"
  },
  {
    "id": 1058,
    "cards": "455m1234789p3446s",
    "answer": "4m",
    "tips": "这手牌虽然打掉6条，我们不丢5条的进张，但是打掉6条，我们就失去了一进听牌的机会，留下6条我们们才能保证手牌五搭牌的完整性，我们要先把牌定型再去做改良，所以6条不能打，14筒也不能打，留下14筒，我们可以进123456筒6门牌，去做优化改良，摸进123456筒任意一张再打6条，如果我们留下4万，摸来36万也听不了牌。五搭牌只有一个对子且一进听牌的时候，果断先定将。所以正确打法是打掉4万。"
  },
  {
    "id": 1059,
    "cards": "2388999m45677p44s",
    "answer": "4s",
    "tips": "这手牌是三对拆一对的牌型，如果打7筒，摸来3筒8筒变成5连顺，或者上手56筒形成双面搭，我们还是去拆4条的对子，这样拆的话，完美错过两对半的牌型。变成了8万一对定将，两对半牌型在现实中是效率最高的牌型。打4条，摸来3568筒，我们可以有4567筒4连坎，同时也保留了两对半牌型。来8万或者7筒都可以听14万。所以正确打法是打掉4条。"
  },
  {
    "id": 1060,
    "cards": "56m1233356p66778s",
    "answer": "6p",
    "tips": "这手牌估计很多麻友会直接打掉12筒，保留3筒开杠空间，这个牌打出12筒，手牌就打倒退啦，打成了二进听牌，手牌分解后缺对，我们肯定看成123筒一副成牌加3筒对子，那么我们在3个双面搭子里面做选择，注意看，我们手牌分解成一对3筒带123筒最合理，那么3个双面搭子里面，是不是我们只有打出这个6筒，只丢1门7筒，因为来4筒，我们35筒接住，打出3筒，把手牌推进成四人抬轿。这手牌合理的选择，打出这张6筒。"
  },
  {
    "id": 1061,
    "cards": "3444567m34567p34s",
    "answer": "3m",
    "tips": "这手牌如果打3万，进2345678筒、2345条都可以听牌，总共11门。如果打4条，进3条、258筒、2358万都可以听牌，总计8门。因此这手牌打3万才是最佳打法。"
  },
  {
    "id": 1062,
    "cards": "23345667m34p3456s",
    "answer": "3s",
    "tips": "这手牌根据丢张最少进张最多原则，打出36条，进张机会为134568万、25筒，任意一张都可以听牌。两个大肚牌型相连（2334万+5667万），叫双翼牌型，这种牌型进张数非常多，不拆。所以正确打法是打掉36条。又根据麻将口诀“打边不打中”，优先打掉3条。"
  },
  {
    "id": 1063,
    "cards": "44599m3477789p45s",
    "answer": "8p",
    "tips": "这手牌不缺对子，也不缺好的搭子，77789筒我们就要看成777筒跟89筒的搭子，六搭拆搭，保留好的搭子。六搭牌永远有两张废牌，这手牌我们打掉89筒就可以了，还可以保留7筒杠的机会。"
  },
  {
    "id": 1064,
    "cards": "78m23345667p6789s",
    "answer": "6s",
    "tips": "这手牌里有两个大肚牌型（2334筒、5667筒为大肚牌型）相连叫双翼牌型，进张机会是相当多的，所以不拆筒子。打掉69条，进134568筒、69万都能听牌。进张机会有32-6=26张。所以正确答案先打掉9条。"
  },
  {
    "id": 1065,
    "cards": "345667p12366799s",
    "answer": "6p",
    "tips": "这手牌手上有两副成牌时，三对拆对，拆掉带好搭子的对子。这里打出6筒，筒子可进张为258筒，条子可以进56789条，8门32-6=26张进牌机会。摸258筒打6条听58条；摸56789条听258筒。正确答案打掉6筒。"
  },
  {
    "id": 1066,
    "cards": "11122234566788m",
    "answer": "8m",
    "tips": "这手牌打6万胡258万，共3门6张胡牌机会；打8万胡1234679万，共7门17张胡牌机会，所以这手牌正确打法是打掉8万，比打掉3万多11张的胡牌机会。"
  },
  {
    "id": 1067,
    "cards": "1245667p2455568s",
    "answer": "2s",
    "tips": "这手牌的正确打法是打掉2条或8条，我们把456条看成一副成牌，剩下2个孤张28条，打出2条或8条都可以。而如果分解手牌时把3个5条做一副搭子，那么就没有将牌，变成了4个搭子，4个搭子里还有3个卡张，那这手牌基本可以放弃了。"
  },
  {
    "id": 1068,
    "cards": "12333678p124588s",
    "answer": "1s",
    "tips": "这手牌的正确打法是打掉12条，我们把123筒当成1搭，一对3筒当成1搭，有六搭牌。六搭拆搭。根据丢张最少进张最多原则，打12条不丢3条进张。所以正确答案打掉1条。"
  },
  {
    "id": 1069,
    "cards": "678m234556p67799s",
    "answer": "5p",
    "tips": "这手牌有两个成牌加三个对子时，遵循三对拆一对原则，拆掉有最好搭子的对子。所以正确答案是打掉5筒。进张56789条、147筒可以听牌，32-6=16张进张听牌机会。进56789条，听147筒。进147筒打7条听58条。都是很不错的听口。"
  },
  {
    "id": 1070,
    "cards": "1156688p2334568s",
    "answer": "8s",
    "tips": "这手牌的正确打法是打掉8条，麻将口诀三对拆一对，是在有两副成牌的情况下。这里只有456条一个成牌。所以根据丢张最少进张最多原则，打出8条。打8条没有丢张。"
  },
  {
    "id": 1071,
    "cards": "23m2355999p23778s",
    "answer": "2p",
    "tips": "这手牌是典型的六搭牌，六搭拆搭，没有孤张，也没有大肚牌型，所以我们需要拆一个搭子。这里的8条我们不能去打，一对定将是在我们一进可以听牌的时候，我们才去一对定将，这手牌我们需要二进才能听牌，打掉8条，我们不仅还是六搭牌，还丢了69条的进张，所以这手牌，我们拆掉23筒的搭子，只丢失1筒的进张。打掉2筒我们丢张最少，拆掉其它的搭子我们都至少丢2门进张。正确答案打掉2筒。"
  },
  {
    "id": 1072,
    "cards": "113577m123p44789s",
    "answer": "7m",
    "tips": "这手牌，我们看成三对拆一对，打掉7万，保留357万3连坎的进张机会。可以进4条、1246万，共5门16张的进牌机会。打掉1万和打掉7万进张机会相同，但1万相对碰出机会大一些。打4条的话，只有来147万才能听牌，进张机会为3门8张。所以打出7万进16张牌为最正确的打法。"
  },
  {
    "id": 1073,
    "cards": "234678m445588p55s",
    "answer": "5p",
    "tips": "这手牌应该保留8筒对子，因为靠边的对子比较容易碰牌，同时要尽量保留45筒的搭子作为后续的听牌牌型，所以应该拆掉45筒的对子，正确打法应该打掉5筒，因为5筒比4筒有更大的概率，消耗对方更多的中心牌，可以从最中心的序数牌部位，破坏别人手牌的关联能力，从而降低别人创造多连张的进牌机会。"
  },
  {
    "id": 1074,
    "cards": "112489m11124789s",
    "answer": "4m",
    "tips": "这手牌打出4万，进3条和7万都可以听牌。如果打出4条，进了37万可以听牌。听牌机会相同，但是打了4条，来了3条相当要拆出一个1条来做成牌，丢了杠出机会。所以建议打出4万。"
  },
  {
    "id": 1075,
    "cards": "23456p113445667s",
    "answer": "6s",
    "tips": "首先这手牌是一进听胡的状态，打掉4条和6条都可以一进听胡，但是打4条的话，对手打出1条的概率就会比较小，但是打6条的话，就不存在这种情况，无论是碰1条还是碰4条，都可以直接听牌，所以正确打法应该是打6条。"
  }
];
